%%%---------------------------------------
%%% module      : data_gladiator
%%% description : 决斗场配置
%%%
%%%---------------------------------------
-module(data_gladiator).
-compile(export_all).
-include("gladiator.hrl").




base_gladiator_kv(1) ->
10;


base_gladiator_kv(2) ->
[{1,{2,0,10}},{2,{2,0,10}},{3,{2,0,10}},{4,{2,0,10}},{5,{2,0,10}},{6,{2,0,10}},{7,{2,0,10}},{8,{2,0,10}},{9,{2,0,10}},{10,{2,0,10}},{11,{2,0,10}},{12,{2,0,10}},{13,{2,0,10}},{14,{2,0,10}},{15,{2,0,10}},{16,{2,0,10}},{17,{2,0,10}},{18,{2,0,10}},{19,{2,0,10}},{20,{2,0,10}}];


base_gladiator_kv(3) ->
3600;


base_gladiator_kv(4) ->
1033;


base_gladiator_kv(5) ->
0;


base_gladiator_kv(6) ->
33002;


base_gladiator_kv(7) ->
[{680,980},{1342,790}];


base_gladiator_kv(8) ->
0;


base_gladiator_kv(9) ->
60;


base_gladiator_kv(10) ->
[{1005,886}];


base_gladiator_kv(11) ->
10;


base_gladiator_kv(12) ->
0.1;


base_gladiator_kv(13) ->
999;


base_gladiator_kv(14) ->
60;


base_gladiator_kv(15) ->
[{100,[{255,1033,100},{255,41,50},{0,38040002,10}]},{150,[{255,1033,150},{255,41,50},{0,38040002,10}]},{200,[{255,1033,200},{255,41,50},{0,38040002,10}]},{250,[{255,1033,250},{255,41,50},{0,38040002,10}]}];


base_gladiator_kv(16) ->
[{100,[{255,1033,60},{255,41,30},{0,38040002,6}]},{150,[{255,1033,90},{255,41,30},{0,38040002,6}]},{200,[{255,1033,120},{255,41,30},{0,38040002,6}]},{250,[{255,1033,150},{255,41,30},{0,38040002,6}]}];


base_gladiator_kv(17) ->
36255010;


base_gladiator_kv(18) ->
20;


base_gladiator_kv(19) ->
3000;

base_gladiator_kv(_Key) ->
	[].

get_glad_power(0) ->
	#glad_power_cfg{medal = 0,point_power = [{100,{50,80}},{150,{60,105}},{200,{80,120}},{250,{80,110}}],point_weight = [{15,100},{37,150},{40,200},{8,250}]};

get_glad_power(1) ->
	#glad_power_cfg{medal = 1,point_power = [{100,{50,80}},{150,{60,105}},{200,{80,120}},{250,{80,110}}],point_weight = [{15,100},{37,150},{40,200},{8,250}]};

get_glad_power(2) ->
	#glad_power_cfg{medal = 2,point_power = [{100,{50,80}},{150,{60,105}},{200,{80,120}},{250,{80,110}}],point_weight = [{15,100},{37,150},{40,200},{8,250}]};

get_glad_power(3) ->
	#glad_power_cfg{medal = 3,point_power = [{100,{50,80}},{150,{60,105}},{200,{80,120}},{250,{80,110}}],point_weight = [{15,100},{37,150},{40,200},{8,250}]};

get_glad_power(4) ->
	#glad_power_cfg{medal = 4,point_power = [{100,{50,80}},{150,{60,105}},{200,{80,120}},{250,{80,110}}],point_weight = [{15,100},{37,150},{40,200},{8,250}]};

get_glad_power(5) ->
	#glad_power_cfg{medal = 5,point_power = [{100,{50,80}},{150,{60,105}},{200,{80,120}},{250,{80,110}}],point_weight = [{15,100},{37,150},{40,200},{8,250}]};

get_glad_power(6) ->
	#glad_power_cfg{medal = 6,point_power = [{100,{50,80}},{150,{60,105}},{200,{80,120}},{250,{80,110}}],point_weight = [{15,100},{37,150},{40,200},{8,250}]};

get_glad_power(7) ->
	#glad_power_cfg{medal = 7,point_power = [{100,{50,80}},{150,{60,105}},{200,{80,120}},{250,{80,110}}],point_weight = [{15,100},{37,150},{40,200},{8,250}]};

get_glad_power(8) ->
	#glad_power_cfg{medal = 8,point_power = [{100,{50,80}},{150,{60,105}},{200,{80,120}},{250,{80,110}}],point_weight = [{15,100},{37,150},{40,200},{8,250}]};

get_glad_power(9) ->
	#glad_power_cfg{medal = 9,point_power = [{100,{50,80}},{150,{60,105}},{200,{80,120}},{250,{80,110}}],point_weight = [{15,100},{37,150},{40,200},{8,250}]};

get_glad_power(10) ->
	#glad_power_cfg{medal = 10,point_power = [{100,{50,80}},{150,{60,105}},{200,{80,120}},{250,{80,110}}],point_weight = [{15,100},{37,150},{40,200},{8,250}]};

get_glad_power(11) ->
	#glad_power_cfg{medal = 11,point_power = [{100,{50,80}},{150,{60,105}},{200,{80,120}},{250,{80,110}}],point_weight = [{15,100},{37,150},{40,200},{8,250}]};

get_glad_power(12) ->
	#glad_power_cfg{medal = 12,point_power = [{100,{50,80}},{150,{60,105}},{200,{80,120}},{250,{80,110}}],point_weight = [{15,100},{37,150},{40,200},{8,250}]};

get_glad_power(13) ->
	#glad_power_cfg{medal = 13,point_power = [{100,{50,80}},{150,{60,105}},{200,{80,120}},{250,{80,110}}],point_weight = [{15,100},{37,150},{40,200},{8,250}]};

get_glad_power(14) ->
	#glad_power_cfg{medal = 14,point_power = [{100,{50,80}},{150,{60,105}},{200,{80,120}},{250,{80,110}}],point_weight = [{15,100},{37,150},{40,200},{8,250}]};

get_glad_power(15) ->
	#glad_power_cfg{medal = 15,point_power = [{100,{50,80}},{150,{60,105}},{200,{80,120}},{250,{80,110}}],point_weight = [{15,100},{37,150},{40,200},{8,250}]};

get_glad_power(16) ->
	#glad_power_cfg{medal = 16,point_power = [{100,{50,80}},{150,{60,105}},{200,{80,120}},{250,{80,110}}],point_weight = [{15,100},{37,150},{40,200},{8,250}]};

get_glad_power(17) ->
	#glad_power_cfg{medal = 17,point_power = [{100,{50,80}},{150,{60,105}},{200,{80,120}},{250,{80,110}}],point_weight = [{15,100},{37,150},{40,200},{8,250}]};

get_glad_power(18) ->
	#glad_power_cfg{medal = 18,point_power = [{100,{50,80}},{150,{60,105}},{200,{80,120}},{250,{80,110}}],point_weight = [{15,100},{37,150},{40,200},{8,250}]};

get_glad_power(19) ->
	#glad_power_cfg{medal = 19,point_power = [{100,{50,80}},{150,{60,105}},{200,{80,120}},{250,{80,110}}],point_weight = [{15,100},{37,150},{40,200},{8,250}]};

get_glad_power(20) ->
	#glad_power_cfg{medal = 20,point_power = [{100,{50,80}},{150,{60,105}},{200,{80,120}},{250,{80,110}}],point_weight = [{15,100},{37,150},{40,200},{8,250}]};

get_glad_power(21) ->
	#glad_power_cfg{medal = 21,point_power = [{100,{50,80}},{150,{60,105}},{200,{80,120}},{250,{80,110}}],point_weight = [{15,100},{37,150},{40,200},{8,250}]};

get_glad_power(22) ->
	#glad_power_cfg{medal = 22,point_power = [{100,{50,80}},{150,{60,105}},{200,{80,120}},{250,{80,110}}],point_weight = [{15,100},{37,150},{40,200},{8,250}]};

get_glad_power(23) ->
	#glad_power_cfg{medal = 23,point_power = [{100,{50,80}},{150,{60,105}},{200,{80,120}},{250,{80,110}}],point_weight = [{15,100},{37,150},{40,200},{8,250}]};

get_glad_power(24) ->
	#glad_power_cfg{medal = 24,point_power = [{100,{50,80}},{150,{60,105}},{200,{80,120}},{250,{80,110}}],point_weight = [{15,100},{37,150},{40,200},{8,250}]};

get_glad_power(25) ->
	#glad_power_cfg{medal = 25,point_power = [{100,{50,80}},{150,{60,105}},{200,{80,120}},{250,{80,110}}],point_weight = [{15,100},{37,150},{40,200},{8,250}]};

get_glad_power(26) ->
	#glad_power_cfg{medal = 26,point_power = [{100,{50,80}},{150,{60,105}},{200,{80,120}},{250,{80,110}}],point_weight = [{15,100},{37,150},{40,200},{8,250}]};

get_glad_power(27) ->
	#glad_power_cfg{medal = 27,point_power = [{100,{50,80}},{150,{60,105}},{200,{80,120}},{250,{80,110}}],point_weight = [{15,100},{37,150},{40,200},{8,250}]};

get_glad_power(28) ->
	#glad_power_cfg{medal = 28,point_power = [{100,{50,80}},{150,{60,105}},{200,{80,120}},{250,{80,110}}],point_weight = [{15,100},{37,150},{40,200},{8,250}]};

get_glad_power(29) ->
	#glad_power_cfg{medal = 29,point_power = [{100,{50,80}},{150,{60,105}},{200,{80,120}},{250,{80,110}}],point_weight = [{15,100},{37,150},{40,200},{8,250}]};

get_glad_power(30) ->
	#glad_power_cfg{medal = 30,point_power = [{100,{50,80}},{150,{60,105}},{200,{80,120}},{250,{80,110}}],point_weight = [{15,100},{37,150},{40,200},{8,250}]};

get_glad_power(31) ->
	#glad_power_cfg{medal = 31,point_power = [{100,{50,80}},{150,{60,105}},{200,{80,120}},{250,{80,110}}],point_weight = [{15,100},{37,150},{40,200},{8,250}]};

get_glad_power(32) ->
	#glad_power_cfg{medal = 32,point_power = [{100,{50,80}},{150,{60,105}},{200,{80,120}},{250,{80,110}}],point_weight = [{15,100},{37,150},{40,200},{8,250}]};

get_glad_power(33) ->
	#glad_power_cfg{medal = 33,point_power = [{100,{50,80}},{150,{60,105}},{200,{80,120}},{250,{80,110}}],point_weight = [{15,100},{37,150},{40,200},{8,250}]};

get_glad_power(34) ->
	#glad_power_cfg{medal = 34,point_power = [{100,{50,80}},{150,{60,105}},{200,{80,120}},{250,{80,110}}],point_weight = [{15,100},{37,150},{40,200},{8,250}]};

get_glad_power(35) ->
	#glad_power_cfg{medal = 35,point_power = [{100,{50,80}},{150,{60,105}},{200,{80,120}},{250,{80,110}}],point_weight = [{15,100},{37,150},{40,200},{8,250}]};

get_glad_power(36) ->
	#glad_power_cfg{medal = 36,point_power = [{100,{50,80}},{150,{60,105}},{200,{80,120}},{250,{80,110}}],point_weight = [{15,100},{37,150},{40,200},{8,250}]};

get_glad_power(37) ->
	#glad_power_cfg{medal = 37,point_power = [{100,{50,80}},{150,{60,105}},{200,{80,120}},{250,{80,110}}],point_weight = [{15,100},{37,150},{40,200},{8,250}]};

get_glad_power(38) ->
	#glad_power_cfg{medal = 38,point_power = [{100,{50,80}},{150,{60,105}},{200,{80,120}},{250,{80,110}}],point_weight = [{15,100},{37,150},{40,200},{8,250}]};

get_glad_power(39) ->
	#glad_power_cfg{medal = 39,point_power = [{100,{50,80}},{150,{60,105}},{200,{80,120}},{250,{80,110}}],point_weight = [{15,100},{37,150},{40,200},{8,250}]};

get_glad_power(40) ->
	#glad_power_cfg{medal = 40,point_power = [{100,{50,80}},{150,{60,105}},{200,{80,120}},{250,{80,110}}],point_weight = [{15,100},{37,150},{40,200},{8,250}]};

get_glad_power(41) ->
	#glad_power_cfg{medal = 41,point_power = [{100,{50,80}},{150,{60,105}},{200,{80,120}},{250,{80,110}}],point_weight = [{15,100},{37,150},{40,200},{8,250}]};

get_glad_power(42) ->
	#glad_power_cfg{medal = 42,point_power = [{100,{50,80}},{150,{60,105}},{200,{80,120}},{250,{80,110}}],point_weight = [{15,100},{37,150},{40,200},{8,250}]};

get_glad_power(43) ->
	#glad_power_cfg{medal = 43,point_power = [{100,{50,80}},{150,{60,105}},{200,{80,120}},{250,{80,110}}],point_weight = [{15,100},{37,150},{40,200},{8,250}]};

get_glad_power(44) ->
	#glad_power_cfg{medal = 44,point_power = [{100,{50,80}},{150,{60,105}},{200,{80,120}},{250,{80,110}}],point_weight = [{15,100},{37,150},{40,200},{8,250}]};

get_glad_power(45) ->
	#glad_power_cfg{medal = 45,point_power = [{100,{50,80}},{150,{60,105}},{200,{80,120}},{250,{80,110}}],point_weight = [{15,100},{37,150},{40,200},{8,250}]};

get_glad_power(46) ->
	#glad_power_cfg{medal = 46,point_power = [{100,{50,80}},{150,{60,105}},{200,{80,120}},{250,{80,110}}],point_weight = [{15,100},{37,150},{40,200},{8,250}]};

get_glad_power(47) ->
	#glad_power_cfg{medal = 47,point_power = [{100,{50,80}},{150,{60,105}},{200,{80,120}},{250,{80,110}}],point_weight = [{15,100},{37,150},{40,200},{8,250}]};

get_glad_power(48) ->
	#glad_power_cfg{medal = 48,point_power = [{100,{50,80}},{150,{60,105}},{200,{80,120}},{250,{80,110}}],point_weight = [{15,100},{37,150},{40,200},{8,250}]};

get_glad_power(49) ->
	#glad_power_cfg{medal = 49,point_power = [{100,{50,80}},{150,{60,105}},{200,{80,120}},{250,{80,110}}],point_weight = [{15,100},{37,150},{40,200},{8,250}]};

get_glad_power(50) ->
	#glad_power_cfg{medal = 50,point_power = [{100,{50,80}},{150,{60,105}},{200,{80,120}},{250,{80,110}}],point_weight = [{15,100},{37,150},{40,200},{8,250}]};

get_glad_power(51) ->
	#glad_power_cfg{medal = 51,point_power = [{100,{50,80}},{150,{60,105}},{200,{80,120}},{250,{80,110}}],point_weight = [{15,100},{37,150},{40,200},{8,250}]};

get_glad_power(52) ->
	#glad_power_cfg{medal = 52,point_power = [{100,{50,80}},{150,{60,105}},{200,{80,120}},{250,{80,110}}],point_weight = [{15,100},{37,150},{40,200},{8,250}]};

get_glad_power(53) ->
	#glad_power_cfg{medal = 53,point_power = [{100,{50,80}},{150,{60,105}},{200,{80,120}},{250,{80,110}}],point_weight = [{15,100},{37,150},{40,200},{8,250}]};

get_glad_power(54) ->
	#glad_power_cfg{medal = 54,point_power = [{100,{50,80}},{150,{60,105}},{200,{80,120}},{250,{80,110}}],point_weight = [{15,100},{37,150},{40,200},{8,250}]};

get_glad_power(55) ->
	#glad_power_cfg{medal = 55,point_power = [{100,{50,80}},{150,{60,105}},{200,{80,120}},{250,{80,110}}],point_weight = [{15,100},{37,150},{40,200},{8,250}]};

get_glad_power(56) ->
	#glad_power_cfg{medal = 56,point_power = [{100,{50,80}},{150,{60,105}},{200,{80,120}},{250,{80,110}}],point_weight = [{15,100},{37,150},{40,200},{8,250}]};

get_glad_power(57) ->
	#glad_power_cfg{medal = 57,point_power = [{100,{50,80}},{150,{60,105}},{200,{80,120}},{250,{80,110}}],point_weight = [{15,100},{37,150},{40,200},{8,250}]};

get_glad_power(58) ->
	#glad_power_cfg{medal = 58,point_power = [{100,{50,80}},{150,{60,105}},{200,{80,120}},{250,{80,110}}],point_weight = [{15,100},{37,150},{40,200},{8,250}]};

get_glad_power(59) ->
	#glad_power_cfg{medal = 59,point_power = [{100,{50,80}},{150,{60,105}},{200,{80,120}},{250,{80,110}}],point_weight = [{15,100},{37,150},{40,200},{8,250}]};

get_glad_power(60) ->
	#glad_power_cfg{medal = 60,point_power = [{100,{50,80}},{150,{60,105}},{200,{80,120}},{250,{80,110}}],point_weight = [{15,100},{37,150},{40,200},{8,250}]};

get_glad_power(61) ->
	#glad_power_cfg{medal = 61,point_power = [{100,{50,80}},{150,{60,105}},{200,{80,120}},{250,{80,110}}],point_weight = [{15,100},{37,150},{40,200},{8,250}]};

get_glad_power(62) ->
	#glad_power_cfg{medal = 62,point_power = [{100,{50,80}},{150,{60,105}},{200,{80,120}},{250,{80,110}}],point_weight = [{15,100},{37,150},{40,200},{8,250}]};

get_glad_power(63) ->
	#glad_power_cfg{medal = 63,point_power = [{100,{50,80}},{150,{60,105}},{200,{80,120}},{250,{80,110}}],point_weight = [{15,100},{37,150},{40,200},{8,250}]};

get_glad_power(64) ->
	#glad_power_cfg{medal = 64,point_power = [{100,{50,80}},{150,{60,105}},{200,{80,120}},{250,{80,110}}],point_weight = [{15,100},{37,150},{40,200},{8,250}]};

get_glad_power(65) ->
	#glad_power_cfg{medal = 65,point_power = [{100,{50,80}},{150,{60,105}},{200,{80,120}},{250,{80,110}}],point_weight = [{15,100},{37,150},{40,200},{8,250}]};

get_glad_power(66) ->
	#glad_power_cfg{medal = 66,point_power = [{100,{50,80}},{150,{60,105}},{200,{80,120}},{250,{80,110}}],point_weight = [{15,100},{37,150},{40,200},{8,250}]};

get_glad_power(67) ->
	#glad_power_cfg{medal = 67,point_power = [{100,{50,80}},{150,{60,105}},{200,{80,120}},{250,{80,110}}],point_weight = [{15,100},{37,150},{40,200},{8,250}]};

get_glad_power(68) ->
	#glad_power_cfg{medal = 68,point_power = [{100,{50,80}},{150,{60,105}},{200,{80,120}},{250,{80,110}}],point_weight = [{15,100},{37,150},{40,200},{8,250}]};

get_glad_power(69) ->
	#glad_power_cfg{medal = 69,point_power = [{100,{50,80}},{150,{60,105}},{200,{80,120}},{250,{80,110}}],point_weight = [{15,100},{37,150},{40,200},{8,250}]};

get_glad_power(70) ->
	#glad_power_cfg{medal = 70,point_power = [{100,{50,80}},{150,{60,105}},{200,{80,120}},{250,{80,110}}],point_weight = [{15,100},{37,150},{40,200},{8,250}]};

get_glad_power(71) ->
	#glad_power_cfg{medal = 71,point_power = [{100,{50,80}},{150,{60,105}},{200,{80,120}},{250,{80,110}}],point_weight = [{15,100},{37,150},{40,200},{8,250}]};

get_glad_power(72) ->
	#glad_power_cfg{medal = 72,point_power = [{100,{50,80}},{150,{60,105}},{200,{80,120}},{250,{80,110}}],point_weight = [{15,100},{37,150},{40,200},{8,250}]};

get_glad_power(73) ->
	#glad_power_cfg{medal = 73,point_power = [{100,{50,80}},{150,{60,105}},{200,{80,120}},{250,{80,110}}],point_weight = [{15,100},{37,150},{40,200},{8,250}]};

get_glad_power(74) ->
	#glad_power_cfg{medal = 74,point_power = [{100,{50,80}},{150,{60,105}},{200,{80,120}},{250,{80,110}}],point_weight = [{15,100},{37,150},{40,200},{8,250}]};

get_glad_power(75) ->
	#glad_power_cfg{medal = 75,point_power = [{100,{50,80}},{150,{60,105}},{200,{80,120}},{250,{80,110}}],point_weight = [{15,100},{37,150},{40,200},{8,250}]};

get_glad_power(76) ->
	#glad_power_cfg{medal = 76,point_power = [{100,{50,80}},{150,{60,105}},{200,{80,120}},{250,{80,110}}],point_weight = [{15,100},{37,150},{40,200},{8,250}]};

get_glad_power(77) ->
	#glad_power_cfg{medal = 77,point_power = [{100,{50,80}},{150,{60,105}},{200,{80,120}},{250,{80,110}}],point_weight = [{15,100},{37,150},{40,200},{8,250}]};

get_glad_power(78) ->
	#glad_power_cfg{medal = 78,point_power = [{100,{50,80}},{150,{60,105}},{200,{80,120}},{250,{80,110}}],point_weight = [{15,100},{37,150},{40,200},{8,250}]};

get_glad_power(79) ->
	#glad_power_cfg{medal = 79,point_power = [{100,{50,80}},{150,{60,105}},{200,{80,120}},{250,{80,110}}],point_weight = [{15,100},{37,150},{40,200},{8,250}]};

get_glad_power(80) ->
	#glad_power_cfg{medal = 80,point_power = [{100,{50,80}},{150,{60,105}},{200,{80,120}},{250,{80,110}}],point_weight = [{15,100},{37,150},{40,200},{8,250}]};

get_glad_power(81) ->
	#glad_power_cfg{medal = 81,point_power = [{100,{50,80}},{150,{60,105}},{200,{80,120}},{250,{80,110}}],point_weight = [{15,100},{37,150},{40,200},{8,250}]};

get_glad_power(82) ->
	#glad_power_cfg{medal = 82,point_power = [{100,{50,80}},{150,{60,105}},{200,{80,120}},{250,{80,110}}],point_weight = [{15,100},{37,150},{40,200},{8,250}]};

get_glad_power(83) ->
	#glad_power_cfg{medal = 83,point_power = [{100,{50,80}},{150,{60,105}},{200,{80,120}},{250,{80,110}}],point_weight = [{15,100},{37,150},{40,200},{8,250}]};

get_glad_power(84) ->
	#glad_power_cfg{medal = 84,point_power = [{100,{50,80}},{150,{60,105}},{200,{80,120}},{250,{80,110}}],point_weight = [{15,100},{37,150},{40,200},{8,250}]};

get_glad_power(85) ->
	#glad_power_cfg{medal = 85,point_power = [{100,{50,80}},{150,{60,105}},{200,{80,120}},{250,{80,110}}],point_weight = [{15,100},{37,150},{40,200},{8,250}]};

get_glad_power(86) ->
	#glad_power_cfg{medal = 86,point_power = [{100,{50,80}},{150,{60,105}},{200,{80,120}},{250,{80,110}}],point_weight = [{15,100},{37,150},{40,200},{8,250}]};

get_glad_power(87) ->
	#glad_power_cfg{medal = 87,point_power = [{100,{50,80}},{150,{60,105}},{200,{80,120}},{250,{80,110}}],point_weight = [{15,100},{37,150},{40,200},{8,250}]};

get_glad_power(88) ->
	#glad_power_cfg{medal = 88,point_power = [{100,{50,80}},{150,{60,105}},{200,{80,120}},{250,{80,110}}],point_weight = [{15,100},{37,150},{40,200},{8,250}]};

get_glad_power(89) ->
	#glad_power_cfg{medal = 89,point_power = [{100,{50,80}},{150,{60,105}},{200,{80,120}},{250,{80,110}}],point_weight = [{15,100},{37,150},{40,200},{8,250}]};

get_glad_power(90) ->
	#glad_power_cfg{medal = 90,point_power = [{100,{50,80}},{150,{60,105}},{200,{80,120}},{250,{80,110}}],point_weight = [{15,100},{37,150},{40,200},{8,250}]};

get_glad_power(91) ->
	#glad_power_cfg{medal = 91,point_power = [{100,{50,80}},{150,{60,105}},{200,{80,120}},{250,{80,110}}],point_weight = [{15,100},{37,150},{40,200},{8,250}]};

get_glad_power(92) ->
	#glad_power_cfg{medal = 92,point_power = [{100,{50,80}},{150,{60,105}},{200,{80,120}},{250,{80,110}}],point_weight = [{15,100},{37,150},{40,200},{8,250}]};

get_glad_power(93) ->
	#glad_power_cfg{medal = 93,point_power = [{100,{50,80}},{150,{60,105}},{200,{80,120}},{250,{80,110}}],point_weight = [{15,100},{37,150},{40,200},{8,250}]};

get_glad_power(94) ->
	#glad_power_cfg{medal = 94,point_power = [{100,{50,80}},{150,{60,105}},{200,{80,120}},{250,{80,110}}],point_weight = [{15,100},{37,150},{40,200},{8,250}]};

get_glad_power(95) ->
	#glad_power_cfg{medal = 95,point_power = [{100,{50,80}},{150,{60,105}},{200,{80,120}},{250,{80,110}}],point_weight = [{15,100},{37,150},{40,200},{8,250}]};

get_glad_power(96) ->
	#glad_power_cfg{medal = 96,point_power = [{100,{50,80}},{150,{60,105}},{200,{80,120}},{250,{80,110}}],point_weight = [{15,100},{37,150},{40,200},{8,250}]};

get_glad_power(97) ->
	#glad_power_cfg{medal = 97,point_power = [{100,{50,80}},{150,{60,105}},{200,{80,120}},{250,{80,110}}],point_weight = [{15,100},{37,150},{40,200},{8,250}]};

get_glad_power(98) ->
	#glad_power_cfg{medal = 98,point_power = [{100,{50,80}},{150,{60,105}},{200,{80,120}},{250,{80,110}}],point_weight = [{15,100},{37,150},{40,200},{8,250}]};

get_glad_power(99) ->
	#glad_power_cfg{medal = 99,point_power = [{100,{50,80}},{150,{60,105}},{200,{80,120}},{250,{80,110}}],point_weight = [{15,100},{37,150},{40,200},{8,250}]};

get_glad_power(100) ->
	#glad_power_cfg{medal = 100,point_power = [{100,{50,80}},{150,{60,105}},{200,{80,120}},{250,{80,110}}],point_weight = [{15,100},{37,150},{40,200},{8,250}]};

get_glad_power(_Medal) ->
	[].

get_glad_all_attr() ->
[{1,0.0139},{2,0.278},{3,0.0056},{4,0.0056},{5,0.0056},{6,0.0056},{7,0.0056},{8,0.0056}].


get_glad_robot_attr(1) ->
0.0139;


get_glad_robot_attr(2) ->
0.278;


get_glad_robot_attr(3) ->
0.0056;


get_glad_robot_attr(4) ->
0.0056;


get_glad_robot_attr(5) ->
0.0056;


get_glad_robot_attr(6) ->
0.0056;


get_glad_robot_attr(7) ->
0.0056;


get_glad_robot_attr(8) ->
0.0056;

get_glad_robot_attr(_Type) ->
	[].

get_glad_all_name() ->
["阿博特","艾比盖","埃达","黑骑士","萌小乖","小乖","小强","阿贝","爱得莱德","爱得拉","旗木","冷峰","香远","头领","男名","亚伯拉罕","爱尔柏塔","阿芙拉","漩涡","皇族","丽影","王子","埃利诺","艾奇逊","贝齐","阿加莎","纳尔","古墓","莎伦纳","骑士","阿克曼","贝蒂","爱葛妮丝","专属","艾尔莎","丫头","帅帅","萌萌爱","亚当","比尤莱","亚莉克希亚","非主流唯爱","洛菲达","阿木","小帅","亚当斯","布莱兹","艾丽斯","宇智波","银铃","绅士","艾迪生","布伦达","爱玛","完美","非主流","小芳","佐助","阿狄森","布里奇特","奥尔瑟雅","经典","芳芳","鸣人","艾狄生","布鲁克诺娃","阿尔娃夏诺","巅峰","冰激凌","巴扎克","卡卡西","阿德拉","西莱斯特","阿蜜莉雅","回忆","经典回忆","倾城之恋","瞎眼盲僧","阿德莱德","夏洛特诺玛","艾咪酱","独恋红尘","红尘","喵喵酱","小墨","阿道夫","谢里尔法","阿娜丝塔西夏","银月传说","永恒经典","小笨蛋酱","墨尘","阿格尼丝","克里斯丁","安德烈亚","单身孤独","回忆至爱","喵咪酱","小林","艾伯特","克莱娜","安妮儿","恋孤独","独恋","燕尾蝶蜂","爱情相信眼泪","奥尔科特","克莱拉那","安娜贝利","午夜传说","传说","姑娘不哭","小傻瓜","奥尔丁顿","潼恩斯克","安纳贝尔","大和","可爱","小妞酱","小雨","奥尔德里奇","德博拉娜","安东妮儿","慕容铅华","单身","幕小小","小宇","亚历克","多洛雷斯","艾谱莉娜","欧阳闪耀","醉恋","夏洛特玲玲","小羽","亚历山大","多明尼卡","爱勒贝拉","西门","千语","阿绫","小渔","阿尔弗列德","多拉蕾娜","爱琳","爱琳娜","午夜","麦当娜","小煜","艾尔弗雷德","桃乐斯丽","艾丝翠得","夏日倾城","倾城","妖精恋","幕潇雨","艾丽丝","伊甸苹果","亚特兰特","诸葛","慕容","戴安娜","小瑜","阿丽丝","伊迪丝","阿西娜","哈利","欧阳","小娜","晓宇","阿利克","伊莲恩","奥德丽","演绎","南宫","莎","小禹","艾尔索普","艾琳诺","奥劳拉","司马","夏侯","小鱼","豆包","阿利","艾伦","芭芭拉","纳兰","春野","潇雨","包子","阿米利亚","艾尔玛","碧翠丝","自由","猫猫","豆浆","安德森","艾西","贝琳达","浪漫","卑弥呼","玄子","志伟","安德鲁","埃尔韦拉","贝拉","守护","彩虹","国宝","小辉","安","费滋","柏妮丝","华丽","熊猫","小二","安娜","弗朗西斯","柏莎","王者","蕊蕊","瑞萌萌","安妮伦纳","弗莉达","百丽儿","龙之","小蕊","小瑞","安东尼","菲德翠卡贝丝","左岸","七夜","墨墨","安托瓦妮特","盖尔","贝芙","阿尔","笑笑","阿修罗","安东尼娅","乔治亚","布兰琪","挚爱","泪眼","匪徒","阿拉贝拉","杰拉尔丁","卡米拉","天道","星星","汏少爺","阿奇博尔德","吉榭尔","坎蒂丝","红人","淑女","花满楼","阿姆斯特朗","葛罗瑞亚","卡拉","star","梦醒","榮耀","阿诺德","格拉迪斯","卡萝","笑傲","小梦","誑磝","阿瑟","达卡罗琳","神圣","晓梦","輝煌","阿特利","葛佳丝塔芙","大爱","妖娆","茉莉","神气","奥古斯丁","汉纳","凯丝","天使","牡丹","先生","奥古斯塔斯","海柔尔","塞西莉亚","温柔","姗姗","浪子","奥斯汀","赫瑟尔","夏洛特","灵魂","小珊","空空","赫达","绮莉","无情","卡卡","白壁德","海伦","克洛怡","潇洒","咪咪","清景","巴比","海洛伊丝","克莱儿","无忧","蜜蜜","晓林","巴比特","胡尔达","克莱拉","繁华","小蜜","葛莉谢尔","巴赫","克莱曼婷","柔情","小秘","阿信","培根","康斯坦丝","绝版","莫莫","波特","鲍德温","伊莎蓓尔","科拉","寂寞","沫沫","草雉","巴纳德","杰奎琳","卡洛儿","幻想","么么","巴神","巴尼","萌乔巴","可妮莉雅","旋律","笨笨","巴雷特","琼酱","黛西","优雅","美子","飞飞","希伯来","黛儿","精彩","雯雯","浮云","巴里","乔伊","黛娜","辉煌","小雯","仙人","巴特","乔伊斯","黛芙妮","荣耀","晓雯","东东","巴塞洛缪","朱恩","达莲娜","梦之星","乐乐","天宇","巴特利特","卡玛","潼恩","寻梦","小仙","灰狼","巴顿","凯伦","黛碧","精英","仙儿","光光","拜耳","凯伊","迪得莉","凯瑟琳","格格","阳阳","鲍尔","金百莉","迪丽雅","记忆","小倩","冷风","蒲福","吉蒂","丹尼丝","伤心","倩倩","竹子","比尔德","克里斯廷","黛安娜","迷糊","小茜","牙牙","博福特","罗瑞尔","善良","小神","比彻","罗伦","唐娜","安妮","公主","泡泡","贝克","李克贝安","多拉","比利","小诺","战神","贝基","多琳","琼斯","小","使者","比尔博姆","林赛","多莉丝","卡尔","多多","小龙","贝尔","洛兰","桃乐斯","查理","朝汐","胖胖","贝拉米","璐易丝","尔莎","嘉利","羊羊","闹闹","莉迪亚","伊甸","丘奇","安娜贝尔","鬼鬼","毛毛","贝洛克","玛佩尔","丹妮萝莉","小鬼","大飞","本海伦","玛德琳","艾德文娜","杜威","雪舞","皇帝","本尼迪克特","穆得","艾琳","迪克","琪琪","春哥","本杰明","塞尔特","道尔","酷酷","贝内特","麦格","伊丽莎白","盖伊","小姐","圈圈","本森","梅根","埃拉","娜娜酱","麦兜","本瑟姆","玛希","休斯顿艾琳","丹尼尔卡特","心儿","熊熊","伯克利","玛莉提丝","爱尔莎","伊凡","欣儿","夜夜","边沁","纳塔利","乔克里拉","馨儿","麒麟","贝克莱","诺玛","艾娃","梅伦海纳","小静","苍穹","伯纳尔","诺维雅","埃米莉","永恒","虹虹","阿萨","伯纳德","奥蒂列特","埃玛","娜迦女皇","傲雪","伯纳尔德","欧尔佳","艾丽卡","一休凯子","扶子","伯特","普鲁登斯","艾丝特","素素","伯莎","普莉斯拉","尤多拉","乔丽","雨滴","布鲁克","伯蒂","波比","尤妮斯","梅尔","momo","伯特伦","罗伯塔","伊文捷琳","诺拉","谢里尔","贝色麦","罗克珊","伊芙","悠悠","贝丝","鲁思","伊夫林","小夏","德博拉","贝西墨","丝柏凌","梵妮","小嫣","贝西","斯泰西","费怡","语嫣","比顿","丝特勒","弗罗拉","天涯","白求恩","托比","弗罗伦丝","阿欣","厄休拉","青青","维隆卡","菲蕾德翠卡","大白","比尔","维多利亚","嘉比里拉","小白","维基","姬玛","白白","比勒尔","维文","珍妮芙","樱花","布莱克","弗雷德姬儿","梧桐","桑席","月影","布卢默","耶达","葛瑞丝","小花","布洛姆菲尔德","依耶芙特","葛莉谢尔达","小兔","布龙菲尔德","蘑菇","布卢尔","关德琳","小丫","布劳","晨曦","布卢姆","哈莉特","如梦","鲍勃","囡囡","博比","赫蒂","海棠","博斯韦尔","婷婷","鲍恩","嘟嘟","波义耳","希尔达","兔兔","鲍曼","希拉瑞莉","糖糖","波伊尔","汉妮","三月","布拉德利","风铃","布雷","艾娜","落落","布鲁斯特","英格丽","薇薇安","布里奇斯","罂粟","布赖特","爱莉丝","妮子","布罗德","丹丹","白朗蒂","维也纳忧伤","勃朗特","艾薇","糖果","菲菲","布朗","婕咪","羽毛","悲伤雅典娜","萝莉","布朗宁","珍妮特","落雪","勃朗宁","珍尼丝","花飞","布鲁斯","爱琴海的忧伤","暗香","布鲁诺","姬儿","夏天","布赖恩","乔伦海宁","小妖","布赖斯","杰克琼","淡淡","巴克","乔安娜","浅浅","巴克耳","小可","微笑","布尔沃","贾思琳","桃子","平凡","布尔韦尔","乔蒂","香香","上帝也会死","布尼安","约瑟芬","小七","伯克","朱蒂斯","漫漫","酱油","朱蒂","华莉丝","颓废","伯恩","朱莉娅","旺妲","伯恩斯","朱莉","温妮","黑色","彭斯","朱丽叶","芝妮雅","巴特勒","伊芳","勃特勒","莎拉","拜伦","若娜","卡拉米","席梦娜","坎普","凯莉","苏菲亚","凯雷","凯里","苏珊","罗拉","苏珊娜","卡莱尔","苏西","卡门","卡内基","死神也会笑","泰贝莎","卡罗琳","莉娜","泰蜜","卡彭特","利昂娜","特莉萨","雷思丽","泰丝","卡丽","列蒂西雅","席拉","李莉斯","泰莉萨","卡罗尔","丽莲","蒂法尼","卡特","莉萨","翠西","莉斯","翠丝特","塞西利亚","杜达","张伯伦","恶魔也会哭","优拉","卓别麟","优娜","查普林","玛琪","查普曼","玛吉","瓦勒莉","查尔斯","梅蜜","维娜","查利","曼蒂","潘妮","玛西亚","菲莉帕","夏洛蒂","玛丽安","菲碧","玛格丽特","菲丽丝","玛丽亚","珀莉","乔叟","马丽娜","切斯特顿","玛乔丽","普莉玛","克罗宁","佩格","穆琳","克洛宁","蓓姬","梅薇思","坎伯兰","帕梅拉","玛可欣","柯姆","潘多拉","梅子时光","戴西","派翠西亚","蒙莉萨","道尔顿","赛拉","丹麦燕奶","佩儿","梅莉","丹尼尔","佩内洛普","米歇尔","丹聂耳","蜜妮安","穆得莉","达尔文","米兰达","戴维","菲妮克丝","蜜莉恩","茉伊拉","迪福","迪莉娅","梦娜","丹尼斯","莫妮卡","杜瓦","穆丽儿","昆西","昆娜","迪尤尔","昆蒂娜","瑞琪儿","瑞伊","狄更斯","蕾娜塔","迪肯斯","蕾妮","迪基","莉达","狄龙","莉娃","多宾","罗莎琳德","多德","罗丝","道尔蒂","鲁思玛丽","陶赫蒂","多利","露比","多恩","莎碧娜","莎莉","陶丽思","莎柏琳娜","卡琳","多丽丝","莎洛姆","多萝西娅","莎曼撤","多萝西","珊多拉","道格拉斯","仙蒂","多伊尔","德莱登","莎芭丝提安","德莱塞","萨琳娜","屈莱顿","沙伦","杜波依斯","希拉","杜勒斯","雪莉","马莎","邓巴","希贝儿","玛蒂娜","邓肯","西格莉德","邓洛普","杜邦","杜德","达特","丝特芬妮","埃迪","艾登","埃奇沃思","伊迪","爱迪生","埃德蒙","爱德华","埃菲","艾泼斯坦","各自珍重","艾森豪威尔","埃兰娜","提琴的呻吟","伊利克特拉","乔汉娜","爱略特","琼娜","埃利奥特","艾略特","范伦汀娜","维拉","埃伦","阿尔娃","艾利斯","维拉妮卡","艾咪","埃尔西","安妮酱","埃墨森","维尔莉特","艾谱莉","艾米丽","维吉妮亚","艾琳娜","维达","埃米","欧内斯特","埃丝特","尤金","温迪","尤菲米娅","赛薇亚拉","伊娃","埃文","依耶塔","埃文思","伊夫","埃维莉娜","伊夫琳","伊齐基尔","丽诺比丽","范妮","若伊","法拉第","法斯特","若拉","福克纳","费利克斯","费尔顿","费迪南德","福开森","弗格森","菲尔德","菲尔丁","芬恩","菲茨杰拉德","弗劳尔","弗林","弗琳","福特","福斯特","福勒","福克斯","弗朗西丝","法兰西斯","弗兰克","富兰克林","弗雷德","弗雷德里克","弗里曼","芬克","小八","加布里埃尔","八酱","加布尔雷思","喵酱","加拉赫","小笨蛋","盖洛普","coco酱","高尔斯沃西","燕尾蝶","加西亚","姑娘","加登","小妞","加德纳","小小","加斯克尔","玲玲","杰弗里","啊绫","乔迪","美人","乔治","妖精","吉本","娜娜","吉布森","吉尔伯特","艾琳莎","詹理斯","贾尔斯","吉尔","季星","格拉德斯通","格莱斯顿","戈德温","蕊","葛德文","戈尔德","高尔德","戈德史密斯","泪","哥尔斯密","戈斯","格雷斯","梦","格雷西","格雷汉姆","格兰汉","格雷厄姆","格兰特","格兰瑟姆","格雷","格林","格雷戈里","格雷沙姆","格罗特","冈特","冈瑟","格斯","哈巴卡克","哈该","哈尔","哈利法克斯","哈密尔敦","汉森尔顿","哈姆雷特","汉森","汉萨","哈代哈迪","哈罗德","哈珀","哈里曼","哈林顿","哈灵顿","汐","哈里森","哈里","哈特","哈维","霍索恩","海登","海伍德","黑兹利特","赫士列特","赫斯特","娜","赫莉","海明威","亨利","亨里埃塔","赫伯特","休利特","希克斯","希尔","霍布斯","霍布森","霍奇","霍奇森","霍姆斯","福尔摩斯","霍尔特","胡德","胡佛","霍普","霍普斯","霍普金","霍勒斯","贺拉斯","凯恩斯","金斯利","玛拉","基普林","蜜尔娜","基特","南希","基托","娜娥迷","基蒂","拉姆","内丽","兰姆","妮可","朗伯","妮可拉","兰伯特","妮娜","兰斯洛特","兰登","拉金","妮蒂亚","拉铁摩尔","劳里","奥丽芙","劳","劳伦斯","劳逊","劳森","李科克","利科克","李克鲁斯","玛丽","利莲","莱顿","伦纳德","梅卡莉安","利奥波德","鲁科","刘易斯","刘易士","莉莉","林肯","林德伯格","林塞","利齐","劳埃德","洛克","伦敦","朗费罗","朗曼","路易","路易斯","路易莎","路易丝","尼达姆","尼赫迈亚","内尔","内利","奈尔孙","纽曼","牛顿","尼古拉斯","尼科斯","尼科尔","尼克","尼克松","诺厄","诺埃尔","娜拉","诺里斯","诺思","诺顿","诺伊斯","奥巴代亚","奥卡西","奥凯西","奥卡姆","奥康纳","奥利弗","奥尼尔","奥尼恩斯","奥兰多","奥斯卡","欧文","帕尔默","潘西","帕克","帕特里奇","佩德","佩特","佩兴斯","帕特里克","保罗","皮科尔","皮尔逊","佩吉","佩恩","皮普斯","佩皮斯","珀金","彼得","佩蒂","菲利蒙","菲利普","皮尔斯","皮古","庇古","皮特曼","波","波利特","波利","波普","蒲柏","庞德","鲍威尔","普赖斯","普里斯特利","普里斯特莱","普里特","帕利策尔","普里策","普兰","普尔曼","奎勒","拉格伦","罗利","拉尔夫","拉曼","冉斯登","拉姆斯登","拉菲尔","瑞利","雷利","雷蒙德","里德","丽贝卡","雷诺兹","罗兹","里斯","理嘉图","李嘉图","理查","理查兹","理查森","罗布","罗宾斯","罗伯特","罗伯逊","罗宾","罗宾森","罗宾逊","洛克菲勒","罗吉尔","罗杰","罗兰","罗密欧","罗斯福","罗莎","罗塞蒂","罗瑟琳","罗斯","罗赛蒂","罗伊","鲁道夫","腊斯克","拉斯金","罗斯金","罗素","拉塞尔","卢瑟福","拉瑟福德","塞恩思伯里","森次巴立","索尔兹伯里","萨莉","萨洛美","萨姆","萨姆森","塞缪尔","桑德","桑迪","萨皮尔","萨拉","萨洛扬","萨罗扬","沙逊","索尔","索耶","萨克斯顿","斯科特","司各脱","斯克利普斯","西尼尔","瑟维斯","莎士比亚","夏普","肖深科的救赎","雪莱","谢利","谢里登","谢立丹","舍伍德","悉尼","锡特尼","赛拉斯","西蒙","辛普森","辛克莱","史沫特莱","斯梅德利","史密斯","斯莫利特","斯摩莱特","斯诺","萨默菲尔德","索莫费尔德","索菲娅","索菲","索锡","骚塞","斯潘塞","斯宾塞","斯彭德","斯普林霍尔","斯蒂尔","斯梯尔","斯坦贝克","斯坦培克","斯特拉","斯蒂芬","史蒂芬","斯蒂芬斯","史蒂文森","史迪威","斯通","斯托","斯特雷奇","斯特朗","司徒雷登","斯图尔特","萨里","萨利","斯威特","斯维夫特","斯威夫特","斯温伯恩","史文朋","西蒙斯","泰特","泰勒","特德","坦普尔","坦尼森","丁尼生","特里","撒克里","西奥多","特里萨","托马斯","汤普森","汤姆森","索罗","梭洛","桑代克","蒂莫西","泰特斯","托拜厄斯","托兰","汤姆","汤姆林森","汤米","托尼","图尔斯","陶特","托因比","特雷西","特里维康","特罗洛普","杜鲁门","特纳","塔特尔","吐温","特温","尤利塞斯","瓦伦丁","范特鲁沙","伏恩","维布伦","凡勃伦","维克托","文森特","瓦奥莱特","弗吉尼亚","沃格特","瓦格纳","沃克","沃克利","华莱土","沃利斯","沃波尔","沃尔什","沃尔特","沃尔顿","沃德","沃纳","沃伦","埃斯瓦尔","埃斯瓦尔德","温斯顿","查莉娅","猎空者","黑百合之吻","凯莎","塞尔达","艾达王","洛奇","幻影之舞","初见你","存在的不明显","国际婚礼","傻拾彡","日久生情","果冻先森","喜欢就好","街角的故事","百善孝当先","水染的天色","冷暖两心知","齐逐","把伤痕当酒窝","心若向阳","冷眼观世界","千言万语","寂寞引领时尚","心意如昔","私奔到月球","九夏光年","人心太拥挤","时间我爱过","一步走半步颠","只为与你厮守","逢场做戏","悲与伤污染","锁链","暖我心脾","最美不过初见","暖神小阿哥","樂此不疲","心跳依旧持续","情陷","抱歉你不配","情与老歌","星月传奇","温柔的败退","莽夫的爱谁懂","骑着去蹭树","怪人心医","落花有意","晗笑半步颠","等着你归来","打不过就装死","感性不性感","挥手寒暄","暧昧到尾","师妹湿胸","学霸模式开启","沉寂后的未央","陪你春夏秋冬","束缚度i","鱼的第8秒","初音未来","贱人请走开","幸福壹直存在","戒不掉思念","回忆的美好","faint情陷","黑骑","埃利诺吉榭尔","一户","爱情眼泪","布吉岛","菲翠卡贝丝","葛莉达卡罗琳","葛佳丝凯瑟琳","庆","乔","梦之","supper"].


get_glad_robot_name(1) ->
"阿博特";


get_glad_robot_name(2) ->
"艾比盖";


get_glad_robot_name(3) ->
"埃达";


get_glad_robot_name(4) ->
"黑骑士";


get_glad_robot_name(5) ->
"萌小乖";


get_glad_robot_name(6) ->
"小乖";


get_glad_robot_name(7) ->
"小强";


get_glad_robot_name(8) ->
"阿贝";


get_glad_robot_name(9) ->
"爱得莱德";


get_glad_robot_name(10) ->
"爱得拉";


get_glad_robot_name(11) ->
"旗木";


get_glad_robot_name(12) ->
"冷峰";


get_glad_robot_name(13) ->
"香远";


get_glad_robot_name(14) ->
"头领";


get_glad_robot_name(15) ->
"男名";


get_glad_robot_name(16) ->
"亚伯拉罕";


get_glad_robot_name(17) ->
"爱尔柏塔";


get_glad_robot_name(18) ->
"阿芙拉";


get_glad_robot_name(19) ->
"漩涡";


get_glad_robot_name(20) ->
"皇族";


get_glad_robot_name(21) ->
"丽影";


get_glad_robot_name(22) ->
"王子";


get_glad_robot_name(23) ->
"埃利诺";


get_glad_robot_name(24) ->
"艾奇逊";


get_glad_robot_name(25) ->
"贝齐";


get_glad_robot_name(26) ->
"阿加莎";


get_glad_robot_name(27) ->
"纳尔";


get_glad_robot_name(28) ->
"古墓";


get_glad_robot_name(29) ->
"莎伦纳";


get_glad_robot_name(30) ->
"骑士";


get_glad_robot_name(31) ->
"阿克曼";


get_glad_robot_name(32) ->
"贝蒂";


get_glad_robot_name(33) ->
"爱葛妮丝";


get_glad_robot_name(34) ->
"专属";


get_glad_robot_name(35) ->
"艾尔莎";


get_glad_robot_name(36) ->
"丫头";


get_glad_robot_name(37) ->
"帅帅";


get_glad_robot_name(38) ->
"萌萌爱";


get_glad_robot_name(39) ->
"亚当";


get_glad_robot_name(40) ->
"比尤莱";


get_glad_robot_name(41) ->
"亚莉克希亚";


get_glad_robot_name(42) ->
"非主流唯爱";


get_glad_robot_name(43) ->
"洛菲达";


get_glad_robot_name(44) ->
"阿木";


get_glad_robot_name(45) ->
"小帅";


get_glad_robot_name(46) ->
"亚当斯";


get_glad_robot_name(47) ->
"布莱兹";


get_glad_robot_name(48) ->
"艾丽斯";


get_glad_robot_name(49) ->
"宇智波";


get_glad_robot_name(50) ->
"银铃";


get_glad_robot_name(51) ->
"绅士";


get_glad_robot_name(52) ->
"艾迪生";


get_glad_robot_name(53) ->
"布伦达";


get_glad_robot_name(54) ->
"爱玛";


get_glad_robot_name(55) ->
"完美";


get_glad_robot_name(56) ->
"非主流";


get_glad_robot_name(57) ->
"小芳";


get_glad_robot_name(58) ->
"佐助";


get_glad_robot_name(59) ->
"阿狄森";


get_glad_robot_name(60) ->
"布里奇特";


get_glad_robot_name(61) ->
"奥尔瑟雅";


get_glad_robot_name(62) ->
"经典";


get_glad_robot_name(63) ->
"芳芳";


get_glad_robot_name(64) ->
"鸣人";


get_glad_robot_name(65) ->
"艾狄生";


get_glad_robot_name(66) ->
"布鲁克诺娃";


get_glad_robot_name(67) ->
"阿尔娃夏诺";


get_glad_robot_name(68) ->
"巅峰";


get_glad_robot_name(69) ->
"冰激凌";


get_glad_robot_name(70) ->
"巴扎克";


get_glad_robot_name(71) ->
"卡卡西";


get_glad_robot_name(72) ->
"阿德拉";


get_glad_robot_name(73) ->
"西莱斯特";


get_glad_robot_name(74) ->
"阿蜜莉雅";


get_glad_robot_name(75) ->
"回忆";


get_glad_robot_name(76) ->
"经典回忆";


get_glad_robot_name(77) ->
"倾城之恋";


get_glad_robot_name(78) ->
"瞎眼盲僧";


get_glad_robot_name(79) ->
"阿德莱德";


get_glad_robot_name(80) ->
"夏洛特诺玛";


get_glad_robot_name(81) ->
"艾咪酱";


get_glad_robot_name(82) ->
"独恋红尘";


get_glad_robot_name(83) ->
"红尘";


get_glad_robot_name(84) ->
"喵喵酱";


get_glad_robot_name(85) ->
"小墨";


get_glad_robot_name(86) ->
"阿道夫";


get_glad_robot_name(87) ->
"谢里尔法";


get_glad_robot_name(88) ->
"阿娜丝塔西夏";


get_glad_robot_name(89) ->
"银月传说";


get_glad_robot_name(90) ->
"永恒经典";


get_glad_robot_name(91) ->
"小笨蛋酱";


get_glad_robot_name(92) ->
"墨尘";


get_glad_robot_name(93) ->
"阿格尼丝";


get_glad_robot_name(94) ->
"克里斯丁";


get_glad_robot_name(95) ->
"安德烈亚";


get_glad_robot_name(96) ->
"单身孤独";


get_glad_robot_name(97) ->
"回忆至爱";


get_glad_robot_name(98) ->
"喵咪酱";


get_glad_robot_name(99) ->
"小林";


get_glad_robot_name(100) ->
"艾伯特";


get_glad_robot_name(101) ->
"克莱娜";


get_glad_robot_name(102) ->
"安妮儿";


get_glad_robot_name(103) ->
"恋孤独";


get_glad_robot_name(104) ->
"独恋";


get_glad_robot_name(105) ->
"燕尾蝶蜂";


get_glad_robot_name(106) ->
"爱情相信眼泪";


get_glad_robot_name(107) ->
"奥尔科特";


get_glad_robot_name(108) ->
"克莱拉那";


get_glad_robot_name(109) ->
"安娜贝利";


get_glad_robot_name(110) ->
"午夜传说";


get_glad_robot_name(111) ->
"传说";


get_glad_robot_name(112) ->
"姑娘不哭";


get_glad_robot_name(113) ->
"小傻瓜";


get_glad_robot_name(114) ->
"奥尔丁顿";


get_glad_robot_name(115) ->
"潼恩斯克";


get_glad_robot_name(116) ->
"安纳贝尔";


get_glad_robot_name(117) ->
"大和";


get_glad_robot_name(118) ->
"可爱";


get_glad_robot_name(119) ->
"小妞酱";


get_glad_robot_name(120) ->
"小雨";


get_glad_robot_name(121) ->
"奥尔德里奇";


get_glad_robot_name(122) ->
"德博拉娜";


get_glad_robot_name(123) ->
"安东妮儿";


get_glad_robot_name(124) ->
"慕容铅华";


get_glad_robot_name(125) ->
"单身";


get_glad_robot_name(126) ->
"幕小小";


get_glad_robot_name(127) ->
"小宇";


get_glad_robot_name(128) ->
"亚历克";


get_glad_robot_name(129) ->
"多洛雷斯";


get_glad_robot_name(130) ->
"艾谱莉娜";


get_glad_robot_name(131) ->
"欧阳闪耀";


get_glad_robot_name(132) ->
"醉恋";


get_glad_robot_name(133) ->
"夏洛特玲玲";


get_glad_robot_name(134) ->
"小羽";


get_glad_robot_name(135) ->
"亚历山大";


get_glad_robot_name(136) ->
"多明尼卡";


get_glad_robot_name(137) ->
"爱勒贝拉";


get_glad_robot_name(138) ->
"西门";


get_glad_robot_name(139) ->
"千语";


get_glad_robot_name(140) ->
"阿绫";


get_glad_robot_name(141) ->
"小渔";


get_glad_robot_name(142) ->
"阿尔弗列德";


get_glad_robot_name(143) ->
"多拉蕾娜";


get_glad_robot_name(144) ->
"爱琳";


get_glad_robot_name(145) ->
"爱琳娜";


get_glad_robot_name(146) ->
"午夜";


get_glad_robot_name(147) ->
"麦当娜";


get_glad_robot_name(148) ->
"小煜";


get_glad_robot_name(149) ->
"艾尔弗雷德";


get_glad_robot_name(150) ->
"桃乐斯丽";


get_glad_robot_name(151) ->
"艾丝翠得";


get_glad_robot_name(152) ->
"夏日倾城";


get_glad_robot_name(153) ->
"倾城";


get_glad_robot_name(154) ->
"妖精恋";


get_glad_robot_name(155) ->
"幕潇雨";


get_glad_robot_name(156) ->
"艾丽丝";


get_glad_robot_name(157) ->
"伊甸苹果";


get_glad_robot_name(158) ->
"亚特兰特";


get_glad_robot_name(159) ->
"诸葛";


get_glad_robot_name(160) ->
"慕容";


get_glad_robot_name(161) ->
"戴安娜";


get_glad_robot_name(162) ->
"小瑜";


get_glad_robot_name(163) ->
"阿丽丝";


get_glad_robot_name(164) ->
"伊迪丝";


get_glad_robot_name(165) ->
"阿西娜";


get_glad_robot_name(166) ->
"哈利";


get_glad_robot_name(167) ->
"欧阳";


get_glad_robot_name(168) ->
"小娜";


get_glad_robot_name(169) ->
"晓宇";


get_glad_robot_name(170) ->
"阿利克";


get_glad_robot_name(171) ->
"伊莲恩";


get_glad_robot_name(172) ->
"奥德丽";


get_glad_robot_name(173) ->
"演绎";


get_glad_robot_name(174) ->
"南宫";


get_glad_robot_name(175) ->
"莎";


get_glad_robot_name(176) ->
"小禹";


get_glad_robot_name(177) ->
"艾尔索普";


get_glad_robot_name(178) ->
"艾琳诺";


get_glad_robot_name(179) ->
"奥劳拉";


get_glad_robot_name(180) ->
"司马";


get_glad_robot_name(181) ->
"夏侯";


get_glad_robot_name(182) ->
"小鱼";


get_glad_robot_name(183) ->
"豆包";


get_glad_robot_name(184) ->
"阿利";


get_glad_robot_name(185) ->
"艾伦";


get_glad_robot_name(186) ->
"芭芭拉";


get_glad_robot_name(187) ->
"纳兰";


get_glad_robot_name(188) ->
"春野";


get_glad_robot_name(189) ->
"潇雨";


get_glad_robot_name(190) ->
"包子";


get_glad_robot_name(191) ->
"阿米利亚";


get_glad_robot_name(192) ->
"艾尔玛";


get_glad_robot_name(193) ->
"碧翠丝";


get_glad_robot_name(194) ->
"自由";


get_glad_robot_name(195) ->
"猫猫";


get_glad_robot_name(196) ->
"豆浆";


get_glad_robot_name(197) ->
"安德森";


get_glad_robot_name(198) ->
"艾西";


get_glad_robot_name(199) ->
"贝琳达";


get_glad_robot_name(200) ->
"浪漫";


get_glad_robot_name(201) ->
"卑弥呼";


get_glad_robot_name(202) ->
"玄子";


get_glad_robot_name(203) ->
"志伟";


get_glad_robot_name(204) ->
"安德鲁";


get_glad_robot_name(205) ->
"埃尔韦拉";


get_glad_robot_name(206) ->
"贝拉";


get_glad_robot_name(207) ->
"守护";


get_glad_robot_name(208) ->
"彩虹";


get_glad_robot_name(209) ->
"国宝";


get_glad_robot_name(210) ->
"小辉";


get_glad_robot_name(211) ->
"安";


get_glad_robot_name(212) ->
"费滋";


get_glad_robot_name(213) ->
"柏妮丝";


get_glad_robot_name(214) ->
"华丽";


get_glad_robot_name(215) ->
"熊猫";


get_glad_robot_name(216) ->
"小二";


get_glad_robot_name(217) ->
"安娜";


get_glad_robot_name(218) ->
"弗朗西斯";


get_glad_robot_name(219) ->
"柏莎";


get_glad_robot_name(220) ->
"王者";


get_glad_robot_name(221) ->
"蕊蕊";


get_glad_robot_name(222) ->
"瑞萌萌";


get_glad_robot_name(223) ->
"安妮伦纳";


get_glad_robot_name(224) ->
"弗莉达";


get_glad_robot_name(225) ->
"百丽儿";


get_glad_robot_name(226) ->
"龙之";


get_glad_robot_name(227) ->
"小蕊";


get_glad_robot_name(228) ->
"小瑞";


get_glad_robot_name(229) ->
"安东尼";


get_glad_robot_name(230) ->
"菲德翠卡贝丝";


get_glad_robot_name(231) ->
"左岸";


get_glad_robot_name(232) ->
"七夜";


get_glad_robot_name(233) ->
"墨墨";


get_glad_robot_name(234) ->
"安托瓦妮特";


get_glad_robot_name(235) ->
"盖尔";


get_glad_robot_name(236) ->
"贝芙";


get_glad_robot_name(237) ->
"阿尔";


get_glad_robot_name(238) ->
"笑笑";


get_glad_robot_name(239) ->
"阿修罗";


get_glad_robot_name(240) ->
"安东尼娅";


get_glad_robot_name(241) ->
"乔治亚";


get_glad_robot_name(242) ->
"布兰琪";


get_glad_robot_name(243) ->
"挚爱";


get_glad_robot_name(244) ->
"泪眼";


get_glad_robot_name(245) ->
"匪徒";


get_glad_robot_name(246) ->
"阿拉贝拉";


get_glad_robot_name(247) ->
"杰拉尔丁";


get_glad_robot_name(248) ->
"卡米拉";


get_glad_robot_name(249) ->
"天道";


get_glad_robot_name(250) ->
"星星";


get_glad_robot_name(251) ->
"汏少爺";


get_glad_robot_name(252) ->
"阿奇博尔德";


get_glad_robot_name(253) ->
"吉榭尔";


get_glad_robot_name(254) ->
"坎蒂丝";


get_glad_robot_name(255) ->
"红人";


get_glad_robot_name(256) ->
"淑女";


get_glad_robot_name(257) ->
"花满楼";


get_glad_robot_name(258) ->
"阿姆斯特朗";


get_glad_robot_name(259) ->
"葛罗瑞亚";


get_glad_robot_name(260) ->
"卡拉";


get_glad_robot_name(261) ->
"star";


get_glad_robot_name(262) ->
"梦醒";


get_glad_robot_name(263) ->
"榮耀";


get_glad_robot_name(264) ->
"阿诺德";


get_glad_robot_name(265) ->
"格拉迪斯";


get_glad_robot_name(266) ->
"卡萝";


get_glad_robot_name(267) ->
"笑傲";


get_glad_robot_name(268) ->
"小梦";


get_glad_robot_name(269) ->
"誑磝";


get_glad_robot_name(270) ->
"阿瑟";


get_glad_robot_name(271) ->
"达卡罗琳";


get_glad_robot_name(272) ->
"神圣";


get_glad_robot_name(273) ->
"晓梦";


get_glad_robot_name(274) ->
"輝煌";


get_glad_robot_name(275) ->
"阿特利";


get_glad_robot_name(276) ->
"葛佳丝塔芙";


get_glad_robot_name(277) ->
"大爱";


get_glad_robot_name(278) ->
"妖娆";


get_glad_robot_name(279) ->
"茉莉";


get_glad_robot_name(280) ->
"神气";


get_glad_robot_name(281) ->
"奥古斯丁";


get_glad_robot_name(282) ->
"汉纳";


get_glad_robot_name(283) ->
"凯丝";


get_glad_robot_name(284) ->
"天使";


get_glad_robot_name(285) ->
"牡丹";


get_glad_robot_name(286) ->
"先生";


get_glad_robot_name(287) ->
"奥古斯塔斯";


get_glad_robot_name(288) ->
"海柔尔";


get_glad_robot_name(289) ->
"塞西莉亚";


get_glad_robot_name(290) ->
"温柔";


get_glad_robot_name(291) ->
"姗姗";


get_glad_robot_name(292) ->
"浪子";


get_glad_robot_name(293) ->
"奥斯汀";


get_glad_robot_name(294) ->
"赫瑟尔";


get_glad_robot_name(295) ->
"夏洛特";


get_glad_robot_name(296) ->
"灵魂";


get_glad_robot_name(297) ->
"小珊";


get_glad_robot_name(298) ->
"空空";


get_glad_robot_name(299) ->
"赫达";


get_glad_robot_name(300) ->
"绮莉";


get_glad_robot_name(301) ->
"无情";


get_glad_robot_name(302) ->
"卡卡";


get_glad_robot_name(303) ->
"白壁德";


get_glad_robot_name(304) ->
"海伦";


get_glad_robot_name(305) ->
"克洛怡";


get_glad_robot_name(306) ->
"潇洒";


get_glad_robot_name(307) ->
"咪咪";


get_glad_robot_name(308) ->
"清景";


get_glad_robot_name(309) ->
"巴比";


get_glad_robot_name(310) ->
"海洛伊丝";


get_glad_robot_name(311) ->
"克莱儿";


get_glad_robot_name(312) ->
"无忧";


get_glad_robot_name(313) ->
"蜜蜜";


get_glad_robot_name(314) ->
"晓林";


get_glad_robot_name(315) ->
"巴比特";


get_glad_robot_name(316) ->
"胡尔达";


get_glad_robot_name(317) ->
"克莱拉";


get_glad_robot_name(318) ->
"繁华";


get_glad_robot_name(319) ->
"小蜜";


get_glad_robot_name(320) ->
"葛莉谢尔";


get_glad_robot_name(321) ->
"巴赫";


get_glad_robot_name(322) ->
"克莱曼婷";


get_glad_robot_name(323) ->
"柔情";


get_glad_robot_name(324) ->
"小秘";


get_glad_robot_name(325) ->
"阿信";


get_glad_robot_name(326) ->
"培根";


get_glad_robot_name(327) ->
"康斯坦丝";


get_glad_robot_name(328) ->
"绝版";


get_glad_robot_name(329) ->
"莫莫";


get_glad_robot_name(330) ->
"波特";


get_glad_robot_name(331) ->
"鲍德温";


get_glad_robot_name(332) ->
"伊莎蓓尔";


get_glad_robot_name(333) ->
"科拉";


get_glad_robot_name(334) ->
"寂寞";


get_glad_robot_name(335) ->
"沫沫";


get_glad_robot_name(336) ->
"草雉";


get_glad_robot_name(337) ->
"巴纳德";


get_glad_robot_name(338) ->
"杰奎琳";


get_glad_robot_name(339) ->
"卡洛儿";


get_glad_robot_name(340) ->
"幻想";


get_glad_robot_name(341) ->
"么么";


get_glad_robot_name(342) ->
"巴神";


get_glad_robot_name(343) ->
"巴尼";


get_glad_robot_name(344) ->
"萌乔巴";


get_glad_robot_name(345) ->
"可妮莉雅";


get_glad_robot_name(346) ->
"旋律";


get_glad_robot_name(347) ->
"笨笨";


get_glad_robot_name(348) ->
"巴雷特";


get_glad_robot_name(349) ->
"琼酱";


get_glad_robot_name(350) ->
"黛西";


get_glad_robot_name(351) ->
"优雅";


get_glad_robot_name(352) ->
"美子";


get_glad_robot_name(353) ->
"飞飞";


get_glad_robot_name(354) ->
"希伯来";


get_glad_robot_name(355) ->
"黛儿";


get_glad_robot_name(356) ->
"精彩";


get_glad_robot_name(357) ->
"雯雯";


get_glad_robot_name(358) ->
"浮云";


get_glad_robot_name(359) ->
"巴里";


get_glad_robot_name(360) ->
"乔伊";


get_glad_robot_name(361) ->
"黛娜";


get_glad_robot_name(362) ->
"辉煌";


get_glad_robot_name(363) ->
"小雯";


get_glad_robot_name(364) ->
"仙人";


get_glad_robot_name(365) ->
"巴特";


get_glad_robot_name(366) ->
"乔伊斯";


get_glad_robot_name(367) ->
"黛芙妮";


get_glad_robot_name(368) ->
"荣耀";


get_glad_robot_name(369) ->
"晓雯";


get_glad_robot_name(370) ->
"东东";


get_glad_robot_name(371) ->
"巴塞洛缪";


get_glad_robot_name(372) ->
"朱恩";


get_glad_robot_name(373) ->
"达莲娜";


get_glad_robot_name(374) ->
"梦之星";


get_glad_robot_name(375) ->
"乐乐";


get_glad_robot_name(376) ->
"天宇";


get_glad_robot_name(377) ->
"巴特利特";


get_glad_robot_name(378) ->
"卡玛";


get_glad_robot_name(379) ->
"潼恩";


get_glad_robot_name(380) ->
"寻梦";


get_glad_robot_name(381) ->
"小仙";


get_glad_robot_name(382) ->
"灰狼";


get_glad_robot_name(383) ->
"巴顿";


get_glad_robot_name(384) ->
"凯伦";


get_glad_robot_name(385) ->
"黛碧";


get_glad_robot_name(386) ->
"精英";


get_glad_robot_name(387) ->
"仙儿";


get_glad_robot_name(388) ->
"光光";


get_glad_robot_name(389) ->
"拜耳";


get_glad_robot_name(390) ->
"凯伊";


get_glad_robot_name(391) ->
"迪得莉";


get_glad_robot_name(392) ->
"凯瑟琳";


get_glad_robot_name(393) ->
"格格";


get_glad_robot_name(394) ->
"阳阳";


get_glad_robot_name(395) ->
"鲍尔";


get_glad_robot_name(396) ->
"金百莉";


get_glad_robot_name(397) ->
"迪丽雅";


get_glad_robot_name(398) ->
"记忆";


get_glad_robot_name(399) ->
"小倩";


get_glad_robot_name(400) ->
"冷风";


get_glad_robot_name(401) ->
"蒲福";


get_glad_robot_name(402) ->
"吉蒂";


get_glad_robot_name(403) ->
"丹尼丝";


get_glad_robot_name(404) ->
"伤心";


get_glad_robot_name(405) ->
"倩倩";


get_glad_robot_name(406) ->
"竹子";


get_glad_robot_name(407) ->
"比尔德";


get_glad_robot_name(408) ->
"克里斯廷";


get_glad_robot_name(409) ->
"黛安娜";


get_glad_robot_name(410) ->
"迷糊";


get_glad_robot_name(411) ->
"小茜";


get_glad_robot_name(412) ->
"牙牙";


get_glad_robot_name(413) ->
"博福特";


get_glad_robot_name(414) ->
"罗瑞尔";


get_glad_robot_name(415) ->
"善良";


get_glad_robot_name(416) ->
"小神";


get_glad_robot_name(417) ->
"比彻";


get_glad_robot_name(418) ->
"罗伦";


get_glad_robot_name(419) ->
"唐娜";


get_glad_robot_name(420) ->
"安妮";


get_glad_robot_name(421) ->
"公主";


get_glad_robot_name(422) ->
"泡泡";


get_glad_robot_name(423) ->
"贝克";


get_glad_robot_name(424) ->
"李克贝安";


get_glad_robot_name(425) ->
"多拉";


get_glad_robot_name(426) ->
"比利";


get_glad_robot_name(427) ->
"小诺";


get_glad_robot_name(428) ->
"战神";


get_glad_robot_name(429) ->
"贝基";


get_glad_robot_name(430) ->
"多琳";


get_glad_robot_name(431) ->
"琼斯";


get_glad_robot_name(432) ->
"小";


get_glad_robot_name(433) ->
"使者";


get_glad_robot_name(434) ->
"比尔博姆";


get_glad_robot_name(435) ->
"林赛";


get_glad_robot_name(436) ->
"多莉丝";


get_glad_robot_name(437) ->
"卡尔";


get_glad_robot_name(438) ->
"多多";


get_glad_robot_name(439) ->
"小龙";


get_glad_robot_name(440) ->
"贝尔";


get_glad_robot_name(441) ->
"洛兰";


get_glad_robot_name(442) ->
"桃乐斯";


get_glad_robot_name(443) ->
"查理";


get_glad_robot_name(444) ->
"朝汐";


get_glad_robot_name(445) ->
"胖胖";


get_glad_robot_name(446) ->
"贝拉米";


get_glad_robot_name(447) ->
"璐易丝";


get_glad_robot_name(448) ->
"尔莎";


get_glad_robot_name(449) ->
"嘉利";


get_glad_robot_name(450) ->
"羊羊";


get_glad_robot_name(451) ->
"闹闹";


get_glad_robot_name(452) ->
"莉迪亚";


get_glad_robot_name(453) ->
"伊甸";


get_glad_robot_name(454) ->
"丘奇";


get_glad_robot_name(455) ->
"安娜贝尔";


get_glad_robot_name(456) ->
"鬼鬼";


get_glad_robot_name(457) ->
"毛毛";


get_glad_robot_name(458) ->
"贝洛克";


get_glad_robot_name(459) ->
"玛佩尔";


get_glad_robot_name(460) ->
"丹妮萝莉";


get_glad_robot_name(461) ->
"小鬼";


get_glad_robot_name(462) ->
"大飞";


get_glad_robot_name(463) ->
"本海伦";


get_glad_robot_name(464) ->
"玛德琳";


get_glad_robot_name(465) ->
"艾德文娜";


get_glad_robot_name(466) ->
"杜威";


get_glad_robot_name(467) ->
"雪舞";


get_glad_robot_name(468) ->
"皇帝";


get_glad_robot_name(469) ->
"本尼迪克特";


get_glad_robot_name(470) ->
"穆得";


get_glad_robot_name(471) ->
"艾琳";


get_glad_robot_name(472) ->
"迪克";


get_glad_robot_name(473) ->
"琪琪";


get_glad_robot_name(474) ->
"春哥";


get_glad_robot_name(475) ->
"本杰明";


get_glad_robot_name(476) ->
"塞尔特";


get_glad_robot_name(477) ->
"道尔";


get_glad_robot_name(478) ->
"酷酷";


get_glad_robot_name(479) ->
"贝内特";


get_glad_robot_name(480) ->
"麦格";


get_glad_robot_name(481) ->
"伊丽莎白";


get_glad_robot_name(482) ->
"盖伊";


get_glad_robot_name(483) ->
"小姐";


get_glad_robot_name(484) ->
"圈圈";


get_glad_robot_name(485) ->
"本森";


get_glad_robot_name(486) ->
"梅根";


get_glad_robot_name(487) ->
"埃拉";


get_glad_robot_name(488) ->
"娜娜酱";


get_glad_robot_name(489) ->
"麦兜";


get_glad_robot_name(490) ->
"本瑟姆";


get_glad_robot_name(491) ->
"玛希";


get_glad_robot_name(492) ->
"休斯顿艾琳";


get_glad_robot_name(493) ->
"丹尼尔卡特";


get_glad_robot_name(494) ->
"心儿";


get_glad_robot_name(495) ->
"熊熊";


get_glad_robot_name(496) ->
"伯克利";


get_glad_robot_name(497) ->
"玛莉提丝";


get_glad_robot_name(498) ->
"爱尔莎";


get_glad_robot_name(499) ->
"伊凡";


get_glad_robot_name(500) ->
"欣儿";


get_glad_robot_name(501) ->
"夜夜";


get_glad_robot_name(502) ->
"边沁";


get_glad_robot_name(503) ->
"纳塔利";


get_glad_robot_name(504) ->
"乔克里拉";


get_glad_robot_name(505) ->
"馨儿";


get_glad_robot_name(506) ->
"麒麟";


get_glad_robot_name(507) ->
"贝克莱";


get_glad_robot_name(508) ->
"诺玛";


get_glad_robot_name(509) ->
"艾娃";


get_glad_robot_name(510) ->
"梅伦海纳";


get_glad_robot_name(511) ->
"小静";


get_glad_robot_name(512) ->
"苍穹";


get_glad_robot_name(513) ->
"伯纳尔";


get_glad_robot_name(514) ->
"诺维雅";


get_glad_robot_name(515) ->
"埃米莉";


get_glad_robot_name(516) ->
"永恒";


get_glad_robot_name(517) ->
"虹虹";


get_glad_robot_name(518) ->
"阿萨";


get_glad_robot_name(519) ->
"伯纳德";


get_glad_robot_name(520) ->
"奥蒂列特";


get_glad_robot_name(521) ->
"埃玛";


get_glad_robot_name(522) ->
"娜迦女皇";


get_glad_robot_name(523) ->
"傲雪";


get_glad_robot_name(524) ->
"伯纳尔德";


get_glad_robot_name(525) ->
"欧尔佳";


get_glad_robot_name(526) ->
"艾丽卡";


get_glad_robot_name(527) ->
"一休凯子";


get_glad_robot_name(528) ->
"扶子";


get_glad_robot_name(529) ->
"伯特";


get_glad_robot_name(530) ->
"普鲁登斯";


get_glad_robot_name(531) ->
"艾丝特";


get_glad_robot_name(532) ->
"素素";


get_glad_robot_name(533) ->
"伯莎";


get_glad_robot_name(534) ->
"普莉斯拉";


get_glad_robot_name(535) ->
"尤多拉";


get_glad_robot_name(536) ->
"乔丽";


get_glad_robot_name(537) ->
"雨滴";


get_glad_robot_name(538) ->
"布鲁克";


get_glad_robot_name(539) ->
"伯蒂";


get_glad_robot_name(540) ->
"波比";


get_glad_robot_name(541) ->
"尤妮斯";


get_glad_robot_name(542) ->
"梅尔";


get_glad_robot_name(543) ->
"momo";


get_glad_robot_name(544) ->
"伯特伦";


get_glad_robot_name(545) ->
"罗伯塔";


get_glad_robot_name(546) ->
"伊文捷琳";


get_glad_robot_name(547) ->
"诺拉";


get_glad_robot_name(548) ->
"谢里尔";


get_glad_robot_name(549) ->
"贝色麦";


get_glad_robot_name(550) ->
"罗克珊";


get_glad_robot_name(551) ->
"伊芙";


get_glad_robot_name(552) ->
"悠悠";


get_glad_robot_name(553) ->
"贝丝";


get_glad_robot_name(554) ->
"鲁思";


get_glad_robot_name(555) ->
"伊夫林";


get_glad_robot_name(556) ->
"小夏";


get_glad_robot_name(557) ->
"德博拉";


get_glad_robot_name(558) ->
"贝西墨";


get_glad_robot_name(559) ->
"丝柏凌";


get_glad_robot_name(560) ->
"梵妮";


get_glad_robot_name(561) ->
"小嫣";


get_glad_robot_name(562) ->
"贝西";


get_glad_robot_name(563) ->
"斯泰西";


get_glad_robot_name(564) ->
"费怡";


get_glad_robot_name(565) ->
"语嫣";


get_glad_robot_name(566) ->
"比顿";


get_glad_robot_name(567) ->
"丝特勒";


get_glad_robot_name(568) ->
"弗罗拉";


get_glad_robot_name(569) ->
"天涯";


get_glad_robot_name(570) ->
"白求恩";


get_glad_robot_name(571) ->
"托比";


get_glad_robot_name(572) ->
"弗罗伦丝";


get_glad_robot_name(573) ->
"阿欣";


get_glad_robot_name(574) ->
"厄休拉";


get_glad_robot_name(575) ->
"青青";


get_glad_robot_name(576) ->
"维隆卡";


get_glad_robot_name(577) ->
"菲蕾德翠卡";


get_glad_robot_name(578) ->
"大白";


get_glad_robot_name(579) ->
"比尔";


get_glad_robot_name(580) ->
"维多利亚";


get_glad_robot_name(581) ->
"嘉比里拉";


get_glad_robot_name(582) ->
"小白";


get_glad_robot_name(583) ->
"维基";


get_glad_robot_name(584) ->
"姬玛";


get_glad_robot_name(585) ->
"白白";


get_glad_robot_name(586) ->
"比勒尔";


get_glad_robot_name(587) ->
"维文";


get_glad_robot_name(588) ->
"珍妮芙";


get_glad_robot_name(589) ->
"樱花";


get_glad_robot_name(590) ->
"布莱克";


get_glad_robot_name(591) ->
"弗雷德姬儿";


get_glad_robot_name(592) ->
"梧桐";


get_glad_robot_name(593) ->
"桑席";


get_glad_robot_name(594) ->
"月影";


get_glad_robot_name(595) ->
"布卢默";


get_glad_robot_name(596) ->
"耶达";


get_glad_robot_name(597) ->
"葛瑞丝";


get_glad_robot_name(598) ->
"小花";


get_glad_robot_name(599) ->
"布洛姆菲尔德";


get_glad_robot_name(600) ->
"依耶芙特";


get_glad_robot_name(601) ->
"葛莉谢尔达";


get_glad_robot_name(602) ->
"小兔";


get_glad_robot_name(603) ->
"布龙菲尔德";


get_glad_robot_name(604) ->
"蘑菇";


get_glad_robot_name(605) ->
"布卢尔";


get_glad_robot_name(606) ->
"关德琳";


get_glad_robot_name(607) ->
"小丫";


get_glad_robot_name(608) ->
"布劳";


get_glad_robot_name(609) ->
"晨曦";


get_glad_robot_name(610) ->
"布卢姆";


get_glad_robot_name(611) ->
"哈莉特";


get_glad_robot_name(612) ->
"如梦";


get_glad_robot_name(613) ->
"鲍勃";


get_glad_robot_name(614) ->
"囡囡";


get_glad_robot_name(615) ->
"博比";


get_glad_robot_name(616) ->
"赫蒂";


get_glad_robot_name(617) ->
"海棠";


get_glad_robot_name(618) ->
"博斯韦尔";


get_glad_robot_name(619) ->
"婷婷";


get_glad_robot_name(620) ->
"鲍恩";


get_glad_robot_name(621) ->
"嘟嘟";


get_glad_robot_name(622) ->
"波义耳";


get_glad_robot_name(623) ->
"希尔达";


get_glad_robot_name(624) ->
"兔兔";


get_glad_robot_name(625) ->
"鲍曼";


get_glad_robot_name(626) ->
"希拉瑞莉";


get_glad_robot_name(627) ->
"糖糖";


get_glad_robot_name(628) ->
"波伊尔";


get_glad_robot_name(629) ->
"汉妮";


get_glad_robot_name(630) ->
"三月";


get_glad_robot_name(631) ->
"布拉德利";


get_glad_robot_name(632) ->
"风铃";


get_glad_robot_name(633) ->
"布雷";


get_glad_robot_name(634) ->
"艾娜";


get_glad_robot_name(635) ->
"落落";


get_glad_robot_name(636) ->
"布鲁斯特";


get_glad_robot_name(637) ->
"英格丽";


get_glad_robot_name(638) ->
"薇薇安";


get_glad_robot_name(639) ->
"布里奇斯";


get_glad_robot_name(640) ->
"罂粟";


get_glad_robot_name(641) ->
"布赖特";


get_glad_robot_name(642) ->
"爱莉丝";


get_glad_robot_name(643) ->
"妮子";


get_glad_robot_name(644) ->
"布罗德";


get_glad_robot_name(645) ->
"丹丹";


get_glad_robot_name(646) ->
"白朗蒂";


get_glad_robot_name(647) ->
"维也纳忧伤";


get_glad_robot_name(648) ->
"勃朗特";


get_glad_robot_name(649) ->
"艾薇";


get_glad_robot_name(650) ->
"糖果";


get_glad_robot_name(651) ->
"菲菲";


get_glad_robot_name(652) ->
"布朗";


get_glad_robot_name(653) ->
"婕咪";


get_glad_robot_name(654) ->
"羽毛";


get_glad_robot_name(655) ->
"悲伤雅典娜";


get_glad_robot_name(656) ->
"萝莉";


get_glad_robot_name(657) ->
"布朗宁";


get_glad_robot_name(658) ->
"珍妮特";


get_glad_robot_name(659) ->
"落雪";


get_glad_robot_name(660) ->
"勃朗宁";


get_glad_robot_name(661) ->
"珍尼丝";


get_glad_robot_name(662) ->
"花飞";


get_glad_robot_name(663) ->
"布鲁斯";


get_glad_robot_name(664) ->
"爱琴海的忧伤";


get_glad_robot_name(665) ->
"暗香";


get_glad_robot_name(666) ->
"布鲁诺";


get_glad_robot_name(667) ->
"姬儿";


get_glad_robot_name(668) ->
"夏天";


get_glad_robot_name(669) ->
"布赖恩";


get_glad_robot_name(670) ->
"乔伦海宁";


get_glad_robot_name(671) ->
"小妖";


get_glad_robot_name(672) ->
"布赖斯";


get_glad_robot_name(673) ->
"杰克琼";


get_glad_robot_name(674) ->
"淡淡";


get_glad_robot_name(675) ->
"巴克";


get_glad_robot_name(676) ->
"乔安娜";


get_glad_robot_name(677) ->
"浅浅";


get_glad_robot_name(678) ->
"巴克耳";


get_glad_robot_name(679) ->
"小可";


get_glad_robot_name(680) ->
"微笑";


get_glad_robot_name(681) ->
"布尔沃";


get_glad_robot_name(682) ->
"贾思琳";


get_glad_robot_name(683) ->
"桃子";


get_glad_robot_name(684) ->
"平凡";


get_glad_robot_name(685) ->
"布尔韦尔";


get_glad_robot_name(686) ->
"乔蒂";


get_glad_robot_name(687) ->
"香香";


get_glad_robot_name(688) ->
"上帝也会死";


get_glad_robot_name(689) ->
"布尼安";


get_glad_robot_name(690) ->
"约瑟芬";


get_glad_robot_name(691) ->
"小七";


get_glad_robot_name(692) ->
"伯克";


get_glad_robot_name(693) ->
"朱蒂斯";


get_glad_robot_name(694) ->
"漫漫";


get_glad_robot_name(695) ->
"酱油";


get_glad_robot_name(696) ->
"朱蒂";


get_glad_robot_name(697) ->
"华莉丝";


get_glad_robot_name(698) ->
"颓废";


get_glad_robot_name(699) ->
"伯恩";


get_glad_robot_name(700) ->
"朱莉娅";


get_glad_robot_name(701) ->
"旺妲";


get_glad_robot_name(702) ->
"伯恩斯";


get_glad_robot_name(703) ->
"朱莉";


get_glad_robot_name(704) ->
"温妮";


get_glad_robot_name(705) ->
"黑色";


get_glad_robot_name(706) ->
"彭斯";


get_glad_robot_name(707) ->
"朱丽叶";


get_glad_robot_name(708) ->
"芝妮雅";


get_glad_robot_name(709) ->
"巴特勒";


get_glad_robot_name(710) ->
"伊芳";


get_glad_robot_name(711) ->
"勃特勒";


get_glad_robot_name(712) ->
"莎拉";


get_glad_robot_name(713) ->
"拜伦";


get_glad_robot_name(714) ->
"若娜";


get_glad_robot_name(715) ->
"卡拉米";


get_glad_robot_name(716) ->
"席梦娜";


get_glad_robot_name(717) ->
"坎普";


get_glad_robot_name(718) ->
"凯莉";


get_glad_robot_name(719) ->
"苏菲亚";


get_glad_robot_name(720) ->
"凯雷";


get_glad_robot_name(721) ->
"凯里";


get_glad_robot_name(722) ->
"苏珊";


get_glad_robot_name(723) ->
"罗拉";


get_glad_robot_name(724) ->
"苏珊娜";


get_glad_robot_name(725) ->
"卡莱尔";


get_glad_robot_name(726) ->
"苏西";


get_glad_robot_name(727) ->
"卡门";


get_glad_robot_name(728) ->
"卡内基";


get_glad_robot_name(729) ->
"死神也会笑";


get_glad_robot_name(730) ->
"泰贝莎";


get_glad_robot_name(731) ->
"卡罗琳";


get_glad_robot_name(732) ->
"莉娜";


get_glad_robot_name(733) ->
"泰蜜";


get_glad_robot_name(734) ->
"卡彭特";


get_glad_robot_name(735) ->
"利昂娜";


get_glad_robot_name(736) ->
"特莉萨";


get_glad_robot_name(737) ->
"雷思丽";


get_glad_robot_name(738) ->
"泰丝";


get_glad_robot_name(739) ->
"卡丽";


get_glad_robot_name(740) ->
"列蒂西雅";


get_glad_robot_name(741) ->
"席拉";


get_glad_robot_name(742) ->
"李莉斯";


get_glad_robot_name(743) ->
"泰莉萨";


get_glad_robot_name(744) ->
"卡罗尔";


get_glad_robot_name(745) ->
"丽莲";


get_glad_robot_name(746) ->
"蒂法尼";


get_glad_robot_name(747) ->
"卡特";


get_glad_robot_name(748) ->
"莉萨";


get_glad_robot_name(749) ->
"翠西";


get_glad_robot_name(750) ->
"莉斯";


get_glad_robot_name(751) ->
"翠丝特";


get_glad_robot_name(752) ->
"塞西利亚";


get_glad_robot_name(753) ->
"杜达";


get_glad_robot_name(754) ->
"张伯伦";


get_glad_robot_name(755) ->
"恶魔也会哭";


get_glad_robot_name(756) ->
"优拉";


get_glad_robot_name(757) ->
"卓别麟";


get_glad_robot_name(758) ->
"优娜";


get_glad_robot_name(759) ->
"查普林";


get_glad_robot_name(760) ->
"玛琪";


get_glad_robot_name(761) ->
"查普曼";


get_glad_robot_name(762) ->
"玛吉";


get_glad_robot_name(763) ->
"瓦勒莉";


get_glad_robot_name(764) ->
"查尔斯";


get_glad_robot_name(765) ->
"梅蜜";


get_glad_robot_name(766) ->
"维娜";


get_glad_robot_name(767) ->
"查利";


get_glad_robot_name(768) ->
"曼蒂";


get_glad_robot_name(769) ->
"潘妮";


get_glad_robot_name(770) ->
"玛西亚";


get_glad_robot_name(771) ->
"菲莉帕";


get_glad_robot_name(772) ->
"夏洛蒂";


get_glad_robot_name(773) ->
"玛丽安";


get_glad_robot_name(774) ->
"菲碧";


get_glad_robot_name(775) ->
"玛格丽特";


get_glad_robot_name(776) ->
"菲丽丝";


get_glad_robot_name(777) ->
"玛丽亚";


get_glad_robot_name(778) ->
"珀莉";


get_glad_robot_name(779) ->
"乔叟";


get_glad_robot_name(780) ->
"马丽娜";


get_glad_robot_name(781) ->
"切斯特顿";


get_glad_robot_name(782) ->
"玛乔丽";


get_glad_robot_name(783) ->
"普莉玛";


get_glad_robot_name(784) ->
"克罗宁";


get_glad_robot_name(785) ->
"佩格";


get_glad_robot_name(786) ->
"穆琳";


get_glad_robot_name(787) ->
"克洛宁";


get_glad_robot_name(788) ->
"蓓姬";


get_glad_robot_name(789) ->
"梅薇思";


get_glad_robot_name(790) ->
"坎伯兰";


get_glad_robot_name(791) ->
"帕梅拉";


get_glad_robot_name(792) ->
"玛可欣";


get_glad_robot_name(793) ->
"柯姆";


get_glad_robot_name(794) ->
"潘多拉";


get_glad_robot_name(795) ->
"梅子时光";


get_glad_robot_name(796) ->
"戴西";


get_glad_robot_name(797) ->
"派翠西亚";


get_glad_robot_name(798) ->
"蒙莉萨";


get_glad_robot_name(799) ->
"道尔顿";


get_glad_robot_name(800) ->
"赛拉";


get_glad_robot_name(801) ->
"丹麦燕奶";


get_glad_robot_name(802) ->
"佩儿";


get_glad_robot_name(803) ->
"梅莉";


get_glad_robot_name(804) ->
"丹尼尔";


get_glad_robot_name(805) ->
"佩内洛普";


get_glad_robot_name(806) ->
"米歇尔";


get_glad_robot_name(807) ->
"丹聂耳";


get_glad_robot_name(808) ->
"蜜妮安";


get_glad_robot_name(809) ->
"穆得莉";


get_glad_robot_name(810) ->
"达尔文";


get_glad_robot_name(811) ->
"米兰达";


get_glad_robot_name(812) ->
"戴维";


get_glad_robot_name(813) ->
"菲妮克丝";


get_glad_robot_name(814) ->
"蜜莉恩";


get_glad_robot_name(815) ->
"茉伊拉";


get_glad_robot_name(816) ->
"迪福";


get_glad_robot_name(817) ->
"迪莉娅";


get_glad_robot_name(818) ->
"梦娜";


get_glad_robot_name(819) ->
"丹尼斯";


get_glad_robot_name(820) ->
"莫妮卡";


get_glad_robot_name(821) ->
"杜瓦";


get_glad_robot_name(822) ->
"穆丽儿";


get_glad_robot_name(823) ->
"昆西";


get_glad_robot_name(824) ->
"昆娜";


get_glad_robot_name(825) ->
"迪尤尔";


get_glad_robot_name(826) ->
"昆蒂娜";


get_glad_robot_name(827) ->
"瑞琪儿";


get_glad_robot_name(828) ->
"瑞伊";


get_glad_robot_name(829) ->
"狄更斯";


get_glad_robot_name(830) ->
"蕾娜塔";


get_glad_robot_name(831) ->
"迪肯斯";


get_glad_robot_name(832) ->
"蕾妮";


get_glad_robot_name(833) ->
"迪基";


get_glad_robot_name(834) ->
"莉达";


get_glad_robot_name(835) ->
"狄龙";


get_glad_robot_name(836) ->
"莉娃";


get_glad_robot_name(837) ->
"多宾";


get_glad_robot_name(838) ->
"罗莎琳德";


get_glad_robot_name(839) ->
"多德";


get_glad_robot_name(840) ->
"罗丝";


get_glad_robot_name(841) ->
"道尔蒂";


get_glad_robot_name(842) ->
"鲁思玛丽";


get_glad_robot_name(843) ->
"陶赫蒂";


get_glad_robot_name(844) ->
"多利";


get_glad_robot_name(845) ->
"露比";


get_glad_robot_name(846) ->
"多恩";


get_glad_robot_name(847) ->
"莎碧娜";


get_glad_robot_name(848) ->
"莎莉";


get_glad_robot_name(849) ->
"陶丽思";


get_glad_robot_name(850) ->
"莎柏琳娜";


get_glad_robot_name(851) ->
"卡琳";


get_glad_robot_name(852) ->
"多丽丝";


get_glad_robot_name(853) ->
"莎洛姆";


get_glad_robot_name(854) ->
"多萝西娅";


get_glad_robot_name(855) ->
"莎曼撤";


get_glad_robot_name(856) ->
"多萝西";


get_glad_robot_name(857) ->
"珊多拉";


get_glad_robot_name(858) ->
"道格拉斯";


get_glad_robot_name(859) ->
"仙蒂";


get_glad_robot_name(860) ->
"多伊尔";


get_glad_robot_name(861) ->
"德莱登";


get_glad_robot_name(862) ->
"莎芭丝提安";


get_glad_robot_name(863) ->
"德莱塞";


get_glad_robot_name(864) ->
"萨琳娜";


get_glad_robot_name(865) ->
"屈莱顿";


get_glad_robot_name(866) ->
"沙伦";


get_glad_robot_name(867) ->
"杜波依斯";


get_glad_robot_name(868) ->
"希拉";


get_glad_robot_name(869) ->
"杜勒斯";


get_glad_robot_name(870) ->
"雪莉";


get_glad_robot_name(871) ->
"马莎";


get_glad_robot_name(872) ->
"邓巴";


get_glad_robot_name(873) ->
"希贝儿";


get_glad_robot_name(874) ->
"玛蒂娜";


get_glad_robot_name(875) ->
"邓肯";


get_glad_robot_name(876) ->
"西格莉德";


get_glad_robot_name(877) ->
"邓洛普";


get_glad_robot_name(878) ->
"杜邦";


get_glad_robot_name(879) ->
"杜德";


get_glad_robot_name(880) ->
"达特";


get_glad_robot_name(881) ->
"丝特芬妮";


get_glad_robot_name(882) ->
"埃迪";


get_glad_robot_name(883) ->
"艾登";


get_glad_robot_name(884) ->
"埃奇沃思";


get_glad_robot_name(885) ->
"伊迪";


get_glad_robot_name(886) ->
"爱迪生";


get_glad_robot_name(887) ->
"埃德蒙";


get_glad_robot_name(888) ->
"爱德华";


get_glad_robot_name(889) ->
"埃菲";


get_glad_robot_name(890) ->
"艾泼斯坦";


get_glad_robot_name(891) ->
"各自珍重";


get_glad_robot_name(892) ->
"艾森豪威尔";


get_glad_robot_name(893) ->
"埃兰娜";


get_glad_robot_name(894) ->
"提琴的呻吟";


get_glad_robot_name(895) ->
"伊利克特拉";


get_glad_robot_name(896) ->
"乔汉娜";


get_glad_robot_name(897) ->
"爱略特";


get_glad_robot_name(898) ->
"琼娜";


get_glad_robot_name(899) ->
"埃利奥特";


get_glad_robot_name(900) ->
"艾略特";


get_glad_robot_name(901) ->
"范伦汀娜";


get_glad_robot_name(902) ->
"维拉";


get_glad_robot_name(903) ->
"埃伦";


get_glad_robot_name(904) ->
"阿尔娃";


get_glad_robot_name(905) ->
"艾利斯";


get_glad_robot_name(906) ->
"维拉妮卡";


get_glad_robot_name(907) ->
"艾咪";


get_glad_robot_name(908) ->
"埃尔西";


get_glad_robot_name(909) ->
"安妮酱";


get_glad_robot_name(910) ->
"埃墨森";


get_glad_robot_name(911) ->
"维尔莉特";


get_glad_robot_name(912) ->
"艾谱莉";


get_glad_robot_name(913) ->
"艾米丽";


get_glad_robot_name(914) ->
"维吉妮亚";


get_glad_robot_name(915) ->
"艾琳娜";


get_glad_robot_name(916) ->
"维达";


get_glad_robot_name(917) ->
"埃米";


get_glad_robot_name(918) ->
"欧内斯特";


get_glad_robot_name(919) ->
"埃丝特";


get_glad_robot_name(920) ->
"尤金";


get_glad_robot_name(921) ->
"温迪";


get_glad_robot_name(922) ->
"尤菲米娅";


get_glad_robot_name(923) ->
"赛薇亚拉";


get_glad_robot_name(924) ->
"伊娃";


get_glad_robot_name(925) ->
"埃文";


get_glad_robot_name(926) ->
"依耶塔";


get_glad_robot_name(927) ->
"埃文思";


get_glad_robot_name(928) ->
"伊夫";


get_glad_robot_name(929) ->
"埃维莉娜";


get_glad_robot_name(930) ->
"伊夫琳";


get_glad_robot_name(931) ->
"伊齐基尔";


get_glad_robot_name(932) ->
"丽诺比丽";


get_glad_robot_name(933) ->
"范妮";


get_glad_robot_name(934) ->
"若伊";


get_glad_robot_name(935) ->
"法拉第";


get_glad_robot_name(936) ->
"法斯特";


get_glad_robot_name(937) ->
"若拉";


get_glad_robot_name(938) ->
"福克纳";


get_glad_robot_name(939) ->
"费利克斯";


get_glad_robot_name(940) ->
"费尔顿";


get_glad_robot_name(941) ->
"费迪南德";


get_glad_robot_name(942) ->
"福开森";


get_glad_robot_name(943) ->
"弗格森";


get_glad_robot_name(944) ->
"菲尔德";


get_glad_robot_name(945) ->
"菲尔丁";


get_glad_robot_name(946) ->
"芬恩";


get_glad_robot_name(947) ->
"菲茨杰拉德";


get_glad_robot_name(948) ->
"弗劳尔";


get_glad_robot_name(949) ->
"弗林";


get_glad_robot_name(950) ->
"弗琳";


get_glad_robot_name(951) ->
"福特";


get_glad_robot_name(952) ->
"福斯特";


get_glad_robot_name(953) ->
"福勒";


get_glad_robot_name(954) ->
"福克斯";


get_glad_robot_name(955) ->
"弗朗西丝";


get_glad_robot_name(956) ->
"法兰西斯";


get_glad_robot_name(957) ->
"弗兰克";


get_glad_robot_name(958) ->
"富兰克林";


get_glad_robot_name(959) ->
"弗雷德";


get_glad_robot_name(960) ->
"弗雷德里克";


get_glad_robot_name(961) ->
"弗里曼";


get_glad_robot_name(962) ->
"芬克";


get_glad_robot_name(963) ->
"小八";


get_glad_robot_name(964) ->
"加布里埃尔";


get_glad_robot_name(965) ->
"八酱";


get_glad_robot_name(966) ->
"加布尔雷思";


get_glad_robot_name(967) ->
"喵酱";


get_glad_robot_name(968) ->
"加拉赫";


get_glad_robot_name(969) ->
"小笨蛋";


get_glad_robot_name(970) ->
"盖洛普";


get_glad_robot_name(971) ->
"coco酱";


get_glad_robot_name(972) ->
"高尔斯沃西";


get_glad_robot_name(973) ->
"燕尾蝶";


get_glad_robot_name(974) ->
"加西亚";


get_glad_robot_name(975) ->
"姑娘";


get_glad_robot_name(976) ->
"加登";


get_glad_robot_name(977) ->
"小妞";


get_glad_robot_name(978) ->
"加德纳";


get_glad_robot_name(979) ->
"小小";


get_glad_robot_name(980) ->
"加斯克尔";


get_glad_robot_name(981) ->
"玲玲";


get_glad_robot_name(982) ->
"杰弗里";


get_glad_robot_name(983) ->
"啊绫";


get_glad_robot_name(984) ->
"乔迪";


get_glad_robot_name(985) ->
"美人";


get_glad_robot_name(986) ->
"乔治";


get_glad_robot_name(987) ->
"妖精";


get_glad_robot_name(988) ->
"吉本";


get_glad_robot_name(989) ->
"娜娜";


get_glad_robot_name(990) ->
"吉布森";


get_glad_robot_name(991) ->
"吉尔伯特";


get_glad_robot_name(992) ->
"艾琳莎";


get_glad_robot_name(993) ->
"詹理斯";


get_glad_robot_name(994) ->
"贾尔斯";


get_glad_robot_name(995) ->
"吉尔";


get_glad_robot_name(996) ->
"季星";


get_glad_robot_name(997) ->
"格拉德斯通";


get_glad_robot_name(998) ->
"格莱斯顿";


get_glad_robot_name(999) ->
"戈德温";


get_glad_robot_name(1000) ->
"蕊";


get_glad_robot_name(1001) ->
"葛德文";


get_glad_robot_name(1002) ->
"戈尔德";


get_glad_robot_name(1003) ->
"高尔德";


get_glad_robot_name(1004) ->
"戈德史密斯";


get_glad_robot_name(1005) ->
"泪";


get_glad_robot_name(1006) ->
"哥尔斯密";


get_glad_robot_name(1007) ->
"戈斯";


get_glad_robot_name(1008) ->
"格雷斯";


get_glad_robot_name(1009) ->
"梦";


get_glad_robot_name(1010) ->
"格雷西";


get_glad_robot_name(1011) ->
"格雷汉姆";


get_glad_robot_name(1012) ->
"格兰汉";


get_glad_robot_name(1013) ->
"格雷厄姆";


get_glad_robot_name(1014) ->
"格兰特";


get_glad_robot_name(1015) ->
"格兰瑟姆";


get_glad_robot_name(1016) ->
"格雷";


get_glad_robot_name(1017) ->
"格林";


get_glad_robot_name(1018) ->
"格雷戈里";


get_glad_robot_name(1019) ->
"格雷沙姆";


get_glad_robot_name(1020) ->
"格罗特";


get_glad_robot_name(1021) ->
"冈特";


get_glad_robot_name(1022) ->
"冈瑟";


get_glad_robot_name(1023) ->
"格斯";


get_glad_robot_name(1024) ->
"哈巴卡克";


get_glad_robot_name(1025) ->
"哈该";


get_glad_robot_name(1026) ->
"哈尔";


get_glad_robot_name(1027) ->
"哈利法克斯";


get_glad_robot_name(1028) ->
"哈密尔敦";


get_glad_robot_name(1029) ->
"汉森尔顿";


get_glad_robot_name(1030) ->
"哈姆雷特";


get_glad_robot_name(1031) ->
"汉森";


get_glad_robot_name(1032) ->
"汉萨";


get_glad_robot_name(1033) ->
"哈代哈迪";


get_glad_robot_name(1034) ->
"哈罗德";


get_glad_robot_name(1035) ->
"哈珀";


get_glad_robot_name(1036) ->
"哈里曼";


get_glad_robot_name(1037) ->
"哈林顿";


get_glad_robot_name(1038) ->
"哈灵顿";


get_glad_robot_name(1039) ->
"汐";


get_glad_robot_name(1040) ->
"哈里森";


get_glad_robot_name(1041) ->
"哈里";


get_glad_robot_name(1042) ->
"哈特";


get_glad_robot_name(1043) ->
"哈维";


get_glad_robot_name(1044) ->
"霍索恩";


get_glad_robot_name(1045) ->
"海登";


get_glad_robot_name(1046) ->
"海伍德";


get_glad_robot_name(1047) ->
"黑兹利特";


get_glad_robot_name(1048) ->
"赫士列特";


get_glad_robot_name(1049) ->
"赫斯特";


get_glad_robot_name(1050) ->
"娜";


get_glad_robot_name(1051) ->
"赫莉";


get_glad_robot_name(1052) ->
"海明威";


get_glad_robot_name(1053) ->
"亨利";


get_glad_robot_name(1054) ->
"亨里埃塔";


get_glad_robot_name(1055) ->
"赫伯特";


get_glad_robot_name(1056) ->
"休利特";


get_glad_robot_name(1057) ->
"希克斯";


get_glad_robot_name(1058) ->
"希尔";


get_glad_robot_name(1059) ->
"霍布斯";


get_glad_robot_name(1060) ->
"霍布森";


get_glad_robot_name(1061) ->
"霍奇";


get_glad_robot_name(1062) ->
"霍奇森";


get_glad_robot_name(1063) ->
"霍姆斯";


get_glad_robot_name(1064) ->
"福尔摩斯";


get_glad_robot_name(1065) ->
"霍尔特";


get_glad_robot_name(1066) ->
"胡德";


get_glad_robot_name(1067) ->
"胡佛";


get_glad_robot_name(1068) ->
"霍普";


get_glad_robot_name(1069) ->
"霍普斯";


get_glad_robot_name(1070) ->
"霍普金";


get_glad_robot_name(1071) ->
"霍勒斯";


get_glad_robot_name(1072) ->
"贺拉斯";


get_glad_robot_name(1073) ->
"凯恩斯";


get_glad_robot_name(1074) ->
"金斯利";


get_glad_robot_name(1075) ->
"玛拉";


get_glad_robot_name(1076) ->
"基普林";


get_glad_robot_name(1077) ->
"蜜尔娜";


get_glad_robot_name(1078) ->
"基特";


get_glad_robot_name(1079) ->
"南希";


get_glad_robot_name(1080) ->
"基托";


get_glad_robot_name(1081) ->
"娜娥迷";


get_glad_robot_name(1082) ->
"基蒂";


get_glad_robot_name(1083) ->
"拉姆";


get_glad_robot_name(1084) ->
"内丽";


get_glad_robot_name(1085) ->
"兰姆";


get_glad_robot_name(1086) ->
"妮可";


get_glad_robot_name(1087) ->
"朗伯";


get_glad_robot_name(1088) ->
"妮可拉";


get_glad_robot_name(1089) ->
"兰伯特";


get_glad_robot_name(1090) ->
"妮娜";


get_glad_robot_name(1091) ->
"兰斯洛特";


get_glad_robot_name(1092) ->
"兰登";


get_glad_robot_name(1093) ->
"拉金";


get_glad_robot_name(1094) ->
"妮蒂亚";


get_glad_robot_name(1095) ->
"拉铁摩尔";


get_glad_robot_name(1096) ->
"劳里";


get_glad_robot_name(1097) ->
"奥丽芙";


get_glad_robot_name(1098) ->
"劳";


get_glad_robot_name(1099) ->
"劳伦斯";


get_glad_robot_name(1100) ->
"劳逊";


get_glad_robot_name(1101) ->
"劳森";


get_glad_robot_name(1102) ->
"李科克";


get_glad_robot_name(1103) ->
"利科克";


get_glad_robot_name(1104) ->
"李克鲁斯";


get_glad_robot_name(1105) ->
"玛丽";


get_glad_robot_name(1106) ->
"利莲";


get_glad_robot_name(1107) ->
"莱顿";


get_glad_robot_name(1108) ->
"伦纳德";


get_glad_robot_name(1109) ->
"梅卡莉安";


get_glad_robot_name(1110) ->
"利奥波德";


get_glad_robot_name(1111) ->
"鲁科";


get_glad_robot_name(1112) ->
"刘易斯";


get_glad_robot_name(1113) ->
"刘易士";


get_glad_robot_name(1114) ->
"莉莉";


get_glad_robot_name(1115) ->
"林肯";


get_glad_robot_name(1116) ->
"林德伯格";


get_glad_robot_name(1117) ->
"林塞";


get_glad_robot_name(1118) ->
"利齐";


get_glad_robot_name(1119) ->
"劳埃德";


get_glad_robot_name(1120) ->
"洛克";


get_glad_robot_name(1121) ->
"伦敦";


get_glad_robot_name(1122) ->
"朗费罗";


get_glad_robot_name(1123) ->
"朗曼";


get_glad_robot_name(1124) ->
"路易";


get_glad_robot_name(1125) ->
"路易斯";


get_glad_robot_name(1126) ->
"路易莎";


get_glad_robot_name(1127) ->
"路易丝";


get_glad_robot_name(1128) ->
"尼达姆";


get_glad_robot_name(1129) ->
"尼赫迈亚";


get_glad_robot_name(1130) ->
"内尔";


get_glad_robot_name(1131) ->
"内利";


get_glad_robot_name(1132) ->
"奈尔孙";


get_glad_robot_name(1133) ->
"纽曼";


get_glad_robot_name(1134) ->
"牛顿";


get_glad_robot_name(1135) ->
"尼古拉斯";


get_glad_robot_name(1136) ->
"尼科斯";


get_glad_robot_name(1137) ->
"尼科尔";


get_glad_robot_name(1138) ->
"尼克";


get_glad_robot_name(1139) ->
"尼克松";


get_glad_robot_name(1140) ->
"诺厄";


get_glad_robot_name(1141) ->
"诺埃尔";


get_glad_robot_name(1142) ->
"娜拉";


get_glad_robot_name(1143) ->
"诺里斯";


get_glad_robot_name(1144) ->
"诺思";


get_glad_robot_name(1145) ->
"诺顿";


get_glad_robot_name(1146) ->
"诺伊斯";


get_glad_robot_name(1147) ->
"奥巴代亚";


get_glad_robot_name(1148) ->
"奥卡西";


get_glad_robot_name(1149) ->
"奥凯西";


get_glad_robot_name(1150) ->
"奥卡姆";


get_glad_robot_name(1151) ->
"奥康纳";


get_glad_robot_name(1152) ->
"奥利弗";


get_glad_robot_name(1153) ->
"奥尼尔";


get_glad_robot_name(1154) ->
"奥尼恩斯";


get_glad_robot_name(1155) ->
"奥兰多";


get_glad_robot_name(1156) ->
"奥斯卡";


get_glad_robot_name(1157) ->
"欧文";


get_glad_robot_name(1158) ->
"帕尔默";


get_glad_robot_name(1159) ->
"潘西";


get_glad_robot_name(1160) ->
"帕克";


get_glad_robot_name(1161) ->
"帕特里奇";


get_glad_robot_name(1162) ->
"佩德";


get_glad_robot_name(1163) ->
"佩特";


get_glad_robot_name(1164) ->
"佩兴斯";


get_glad_robot_name(1165) ->
"帕特里克";


get_glad_robot_name(1166) ->
"保罗";


get_glad_robot_name(1167) ->
"皮科尔";


get_glad_robot_name(1168) ->
"皮尔逊";


get_glad_robot_name(1169) ->
"佩吉";


get_glad_robot_name(1170) ->
"佩恩";


get_glad_robot_name(1171) ->
"皮普斯";


get_glad_robot_name(1172) ->
"佩皮斯";


get_glad_robot_name(1173) ->
"珀金";


get_glad_robot_name(1174) ->
"彼得";


get_glad_robot_name(1175) ->
"佩蒂";


get_glad_robot_name(1176) ->
"菲利蒙";


get_glad_robot_name(1177) ->
"菲利普";


get_glad_robot_name(1178) ->
"皮尔斯";


get_glad_robot_name(1179) ->
"皮古";


get_glad_robot_name(1180) ->
"庇古";


get_glad_robot_name(1181) ->
"皮特曼";


get_glad_robot_name(1182) ->
"波";


get_glad_robot_name(1183) ->
"波利特";


get_glad_robot_name(1184) ->
"波利";


get_glad_robot_name(1185) ->
"波普";


get_glad_robot_name(1186) ->
"蒲柏";


get_glad_robot_name(1187) ->
"庞德";


get_glad_robot_name(1188) ->
"鲍威尔";


get_glad_robot_name(1189) ->
"普赖斯";


get_glad_robot_name(1190) ->
"普里斯特利";


get_glad_robot_name(1191) ->
"普里斯特莱";


get_glad_robot_name(1192) ->
"普里特";


get_glad_robot_name(1193) ->
"帕利策尔";


get_glad_robot_name(1194) ->
"普里策";


get_glad_robot_name(1195) ->
"普兰";


get_glad_robot_name(1196) ->
"普尔曼";


get_glad_robot_name(1197) ->
"奎勒";


get_glad_robot_name(1198) ->
"拉格伦";


get_glad_robot_name(1199) ->
"罗利";


get_glad_robot_name(1200) ->
"拉尔夫";


get_glad_robot_name(1201) ->
"拉曼";


get_glad_robot_name(1202) ->
"冉斯登";


get_glad_robot_name(1203) ->
"拉姆斯登";


get_glad_robot_name(1204) ->
"拉菲尔";


get_glad_robot_name(1205) ->
"瑞利";


get_glad_robot_name(1206) ->
"雷利";


get_glad_robot_name(1207) ->
"雷蒙德";


get_glad_robot_name(1208) ->
"里德";


get_glad_robot_name(1209) ->
"丽贝卡";


get_glad_robot_name(1210) ->
"雷诺兹";


get_glad_robot_name(1211) ->
"罗兹";


get_glad_robot_name(1212) ->
"里斯";


get_glad_robot_name(1213) ->
"理嘉图";


get_glad_robot_name(1214) ->
"李嘉图";


get_glad_robot_name(1215) ->
"理查";


get_glad_robot_name(1216) ->
"理查兹";


get_glad_robot_name(1217) ->
"理查森";


get_glad_robot_name(1218) ->
"罗布";


get_glad_robot_name(1219) ->
"罗宾斯";


get_glad_robot_name(1220) ->
"罗伯特";


get_glad_robot_name(1221) ->
"罗伯逊";


get_glad_robot_name(1222) ->
"罗宾";


get_glad_robot_name(1223) ->
"罗宾森";


get_glad_robot_name(1224) ->
"罗宾逊";


get_glad_robot_name(1225) ->
"洛克菲勒";


get_glad_robot_name(1226) ->
"罗吉尔";


get_glad_robot_name(1227) ->
"罗杰";


get_glad_robot_name(1228) ->
"罗兰";


get_glad_robot_name(1229) ->
"罗密欧";


get_glad_robot_name(1230) ->
"罗斯福";


get_glad_robot_name(1231) ->
"罗莎";


get_glad_robot_name(1232) ->
"罗塞蒂";


get_glad_robot_name(1233) ->
"罗瑟琳";


get_glad_robot_name(1234) ->
"罗斯";


get_glad_robot_name(1235) ->
"罗赛蒂";


get_glad_robot_name(1236) ->
"罗伊";


get_glad_robot_name(1237) ->
"鲁道夫";


get_glad_robot_name(1238) ->
"腊斯克";


get_glad_robot_name(1239) ->
"拉斯金";


get_glad_robot_name(1240) ->
"罗斯金";


get_glad_robot_name(1241) ->
"罗素";


get_glad_robot_name(1242) ->
"拉塞尔";


get_glad_robot_name(1243) ->
"卢瑟福";


get_glad_robot_name(1244) ->
"拉瑟福德";


get_glad_robot_name(1245) ->
"塞恩思伯里";


get_glad_robot_name(1246) ->
"森次巴立";


get_glad_robot_name(1247) ->
"索尔兹伯里";


get_glad_robot_name(1248) ->
"萨莉";


get_glad_robot_name(1249) ->
"萨洛美";


get_glad_robot_name(1250) ->
"萨姆";


get_glad_robot_name(1251) ->
"萨姆森";


get_glad_robot_name(1252) ->
"塞缪尔";


get_glad_robot_name(1253) ->
"桑德";


get_glad_robot_name(1254) ->
"桑迪";


get_glad_robot_name(1255) ->
"萨皮尔";


get_glad_robot_name(1256) ->
"萨拉";


get_glad_robot_name(1257) ->
"萨洛扬";


get_glad_robot_name(1258) ->
"萨罗扬";


get_glad_robot_name(1259) ->
"沙逊";


get_glad_robot_name(1260) ->
"索尔";


get_glad_robot_name(1261) ->
"索耶";


get_glad_robot_name(1262) ->
"萨克斯顿";


get_glad_robot_name(1263) ->
"斯科特";


get_glad_robot_name(1264) ->
"司各脱";


get_glad_robot_name(1265) ->
"斯克利普斯";


get_glad_robot_name(1266) ->
"西尼尔";


get_glad_robot_name(1267) ->
"瑟维斯";


get_glad_robot_name(1268) ->
"莎士比亚";


get_glad_robot_name(1269) ->
"夏普";


get_glad_robot_name(1270) ->
"肖深科的救赎";


get_glad_robot_name(1271) ->
"雪莱";


get_glad_robot_name(1272) ->
"谢利";


get_glad_robot_name(1273) ->
"谢里登";


get_glad_robot_name(1274) ->
"谢立丹";


get_glad_robot_name(1275) ->
"舍伍德";


get_glad_robot_name(1276) ->
"悉尼";


get_glad_robot_name(1277) ->
"锡特尼";


get_glad_robot_name(1278) ->
"赛拉斯";


get_glad_robot_name(1279) ->
"西蒙";


get_glad_robot_name(1280) ->
"辛普森";


get_glad_robot_name(1281) ->
"辛克莱";


get_glad_robot_name(1282) ->
"史沫特莱";


get_glad_robot_name(1283) ->
"斯梅德利";


get_glad_robot_name(1284) ->
"史密斯";


get_glad_robot_name(1285) ->
"斯莫利特";


get_glad_robot_name(1286) ->
"斯摩莱特";


get_glad_robot_name(1287) ->
"斯诺";


get_glad_robot_name(1288) ->
"萨默菲尔德";


get_glad_robot_name(1289) ->
"索莫费尔德";


get_glad_robot_name(1290) ->
"索菲娅";


get_glad_robot_name(1291) ->
"索菲";


get_glad_robot_name(1292) ->
"索锡";


get_glad_robot_name(1293) ->
"骚塞";


get_glad_robot_name(1294) ->
"斯潘塞";


get_glad_robot_name(1295) ->
"斯宾塞";


get_glad_robot_name(1296) ->
"斯彭德";


get_glad_robot_name(1297) ->
"斯普林霍尔";


get_glad_robot_name(1298) ->
"斯蒂尔";


get_glad_robot_name(1299) ->
"斯梯尔";


get_glad_robot_name(1300) ->
"斯坦贝克";


get_glad_robot_name(1301) ->
"斯坦培克";


get_glad_robot_name(1302) ->
"斯特拉";


get_glad_robot_name(1303) ->
"斯蒂芬";


get_glad_robot_name(1304) ->
"史蒂芬";


get_glad_robot_name(1305) ->
"斯蒂芬斯";


get_glad_robot_name(1306) ->
"史蒂文森";


get_glad_robot_name(1307) ->
"史迪威";


get_glad_robot_name(1308) ->
"斯通";


get_glad_robot_name(1309) ->
"斯托";


get_glad_robot_name(1310) ->
"斯特雷奇";


get_glad_robot_name(1311) ->
"斯特朗";


get_glad_robot_name(1312) ->
"司徒雷登";


get_glad_robot_name(1313) ->
"斯图尔特";


get_glad_robot_name(1314) ->
"萨里";


get_glad_robot_name(1315) ->
"萨利";


get_glad_robot_name(1316) ->
"斯威特";


get_glad_robot_name(1317) ->
"斯维夫特";


get_glad_robot_name(1318) ->
"斯威夫特";


get_glad_robot_name(1319) ->
"斯温伯恩";


get_glad_robot_name(1320) ->
"史文朋";


get_glad_robot_name(1321) ->
"西蒙斯";


get_glad_robot_name(1322) ->
"泰特";


get_glad_robot_name(1323) ->
"泰勒";


get_glad_robot_name(1324) ->
"特德";


get_glad_robot_name(1325) ->
"坦普尔";


get_glad_robot_name(1326) ->
"坦尼森";


get_glad_robot_name(1327) ->
"丁尼生";


get_glad_robot_name(1328) ->
"特里";


get_glad_robot_name(1329) ->
"撒克里";


get_glad_robot_name(1330) ->
"西奥多";


get_glad_robot_name(1331) ->
"特里萨";


get_glad_robot_name(1332) ->
"托马斯";


get_glad_robot_name(1333) ->
"汤普森";


get_glad_robot_name(1334) ->
"汤姆森";


get_glad_robot_name(1335) ->
"索罗";


get_glad_robot_name(1336) ->
"梭洛";


get_glad_robot_name(1337) ->
"桑代克";


get_glad_robot_name(1338) ->
"蒂莫西";


get_glad_robot_name(1339) ->
"泰特斯";


get_glad_robot_name(1340) ->
"托拜厄斯";


get_glad_robot_name(1341) ->
"托兰";


get_glad_robot_name(1342) ->
"汤姆";


get_glad_robot_name(1343) ->
"汤姆林森";


get_glad_robot_name(1344) ->
"汤米";


get_glad_robot_name(1345) ->
"托尼";


get_glad_robot_name(1346) ->
"图尔斯";


get_glad_robot_name(1347) ->
"陶特";


get_glad_robot_name(1348) ->
"托因比";


get_glad_robot_name(1349) ->
"特雷西";


get_glad_robot_name(1350) ->
"特里维康";


get_glad_robot_name(1351) ->
"特罗洛普";


get_glad_robot_name(1352) ->
"杜鲁门";


get_glad_robot_name(1353) ->
"特纳";


get_glad_robot_name(1354) ->
"塔特尔";


get_glad_robot_name(1355) ->
"吐温";


get_glad_robot_name(1356) ->
"特温";


get_glad_robot_name(1357) ->
"尤利塞斯";


get_glad_robot_name(1358) ->
"瓦伦丁";


get_glad_robot_name(1359) ->
"范特鲁沙";


get_glad_robot_name(1360) ->
"伏恩";


get_glad_robot_name(1361) ->
"维布伦";


get_glad_robot_name(1362) ->
"凡勃伦";


get_glad_robot_name(1363) ->
"维克托";


get_glad_robot_name(1364) ->
"文森特";


get_glad_robot_name(1365) ->
"瓦奥莱特";


get_glad_robot_name(1366) ->
"弗吉尼亚";


get_glad_robot_name(1367) ->
"沃格特";


get_glad_robot_name(1368) ->
"瓦格纳";


get_glad_robot_name(1369) ->
"沃克";


get_glad_robot_name(1370) ->
"沃克利";


get_glad_robot_name(1371) ->
"华莱土";


get_glad_robot_name(1372) ->
"沃利斯";


get_glad_robot_name(1373) ->
"沃波尔";


get_glad_robot_name(1374) ->
"沃尔什";


get_glad_robot_name(1375) ->
"沃尔特";


get_glad_robot_name(1376) ->
"沃尔顿";


get_glad_robot_name(1377) ->
"沃德";


get_glad_robot_name(1378) ->
"沃纳";


get_glad_robot_name(1379) ->
"沃伦";


get_glad_robot_name(1380) ->
"埃斯瓦尔";


get_glad_robot_name(1381) ->
"埃斯瓦尔德";


get_glad_robot_name(1382) ->
"温斯顿";


get_glad_robot_name(1383) ->
"查莉娅";


get_glad_robot_name(1384) ->
"猎空者";


get_glad_robot_name(1385) ->
"黑百合之吻";


get_glad_robot_name(1386) ->
"凯莎";


get_glad_robot_name(1387) ->
"塞尔达";


get_glad_robot_name(1388) ->
"艾达王";


get_glad_robot_name(1389) ->
"洛奇";


get_glad_robot_name(1390) ->
"幻影之舞";


get_glad_robot_name(1391) ->
"初见你";


get_glad_robot_name(1392) ->
"存在的不明显";


get_glad_robot_name(1393) ->
"国际婚礼";


get_glad_robot_name(1394) ->
"傻拾彡";


get_glad_robot_name(1395) ->
"日久生情";


get_glad_robot_name(1396) ->
"果冻先森";


get_glad_robot_name(1397) ->
"喜欢就好";


get_glad_robot_name(1398) ->
"街角的故事";


get_glad_robot_name(1399) ->
"百善孝当先";


get_glad_robot_name(1400) ->
"水染的天色";


get_glad_robot_name(1401) ->
"冷暖两心知";


get_glad_robot_name(1402) ->
"齐逐";


get_glad_robot_name(1403) ->
"把伤痕当酒窝";


get_glad_robot_name(1404) ->
"心若向阳";


get_glad_robot_name(1405) ->
"冷眼观世界";


get_glad_robot_name(1406) ->
"千言万语";


get_glad_robot_name(1407) ->
"寂寞引领时尚";


get_glad_robot_name(1408) ->
"心意如昔";


get_glad_robot_name(1409) ->
"私奔到月球";


get_glad_robot_name(1410) ->
"九夏光年";


get_glad_robot_name(1411) ->
"人心太拥挤";


get_glad_robot_name(1412) ->
"时间我爱过";


get_glad_robot_name(1413) ->
"一步走半步颠";


get_glad_robot_name(1414) ->
"只为与你厮守";


get_glad_robot_name(1415) ->
"逢场做戏";


get_glad_robot_name(1416) ->
"悲与伤污染";


get_glad_robot_name(1417) ->
"锁链";


get_glad_robot_name(1418) ->
"暖我心脾";


get_glad_robot_name(1419) ->
"最美不过初见";


get_glad_robot_name(1420) ->
"暖神小阿哥";


get_glad_robot_name(1421) ->
"樂此不疲";


get_glad_robot_name(1422) ->
"心跳依旧持续";


get_glad_robot_name(1423) ->
"情陷";


get_glad_robot_name(1424) ->
"抱歉你不配";


get_glad_robot_name(1425) ->
"情与老歌";


get_glad_robot_name(1426) ->
"星月传奇";


get_glad_robot_name(1427) ->
"温柔的败退";


get_glad_robot_name(1428) ->
"莽夫的爱谁懂";


get_glad_robot_name(1429) ->
"骑着去蹭树";


get_glad_robot_name(1430) ->
"怪人心医";


get_glad_robot_name(1431) ->
"落花有意";


get_glad_robot_name(1432) ->
"晗笑半步颠";


get_glad_robot_name(1433) ->
"等着你归来";


get_glad_robot_name(1434) ->
"打不过就装死";


get_glad_robot_name(1435) ->
"感性不性感";


get_glad_robot_name(1436) ->
"挥手寒暄";


get_glad_robot_name(1437) ->
"暧昧到尾";


get_glad_robot_name(1438) ->
"师妹湿胸";


get_glad_robot_name(1439) ->
"学霸模式开启";


get_glad_robot_name(1440) ->
"沉寂后的未央";


get_glad_robot_name(1441) ->
"陪你春夏秋冬";


get_glad_robot_name(1442) ->
"束缚度i";


get_glad_robot_name(1443) ->
"鱼的第8秒";


get_glad_robot_name(1444) ->
"初音未来";


get_glad_robot_name(1445) ->
"贱人请走开";


get_glad_robot_name(1446) ->
"幸福壹直存在";


get_glad_robot_name(1447) ->
"戒不掉思念";


get_glad_robot_name(1448) ->
"回忆的美好";


get_glad_robot_name(1449) ->
"faint情陷";


get_glad_robot_name(1450) ->
"贱人请走开";


get_glad_robot_name(1451) ->
"黑骑";


get_glad_robot_name(1452) ->
"埃利诺吉榭尔";


get_glad_robot_name(1453) ->
"一户";


get_glad_robot_name(1454) ->
"爱情眼泪";


get_glad_robot_name(1455) ->
"布吉岛";


get_glad_robot_name(1456) ->
"菲翠卡贝丝";


get_glad_robot_name(1457) ->
"葛莉达卡罗琳";


get_glad_robot_name(1458) ->
"葛佳丝凯瑟琳";


get_glad_robot_name(1459) ->
"庆";


get_glad_robot_name(1460) ->
"乔";


get_glad_robot_name(1461) ->
"梦之";


get_glad_robot_name(1462) ->
"supper";

get_glad_robot_name(_Id) ->
	[].

get_glad_robot(1) ->
	#glad_robot_cfg{sex = 1,role_m = [101002,101003,101004,101005,101006],weapon_m = [102001,102002,102003,102004,102005],mount_m = [703001,703002,703007,703009],partner_m = [201001,201002,201003,201004,201005,201006,201007,201008,201009,201010,201011,201012,201013,201014,201015,201016,201017,201018],wing_m = [104001,104002,104003,104004,104005,104006,104007,104008,104009,104010,104011,104012],head_m = []};

get_glad_robot(2) ->
	#glad_robot_cfg{sex = 2,role_m = [101102,101103,101104,101105,101106],weapon_m = [102101,102102,102103,102104,102105],mount_m = [703001,703002,703007,703009],partner_m = [201001,201002,201003,201004,201005,201006,201007,201008,201009,201010,201011,201012,201013,201014,201015,201016,201017,201018],wing_m = [104001,104002,104003,104004,104005,104006,104007,104008,104009,104010,104011,104012],head_m = []};

get_glad_robot(_Sex) ->
	[].


get_glad_ratio(0) ->
1;


get_glad_ratio(1) ->
1;


get_glad_ratio(2) ->
1;


get_glad_ratio(3) ->
1;


get_glad_ratio(4) ->
1;


get_glad_ratio(5) ->
1;


get_glad_ratio(6) ->
1;


get_glad_ratio(7) ->
1;


get_glad_ratio(8) ->
1;


get_glad_ratio(9) ->
1;


get_glad_ratio(10) ->
1;


get_glad_ratio(11) ->
1;


get_glad_ratio(12) ->
1;


get_glad_ratio(13) ->
1;


get_glad_ratio(14) ->
1;


get_glad_ratio(15) ->
1;


get_glad_ratio(16) ->
1;


get_glad_ratio(17) ->
1;


get_glad_ratio(18) ->
1;


get_glad_ratio(19) ->
1;


get_glad_ratio(20) ->
1;


get_glad_ratio(21) ->
1;


get_glad_ratio(22) ->
1;


get_glad_ratio(23) ->
1;


get_glad_ratio(24) ->
1;


get_glad_ratio(25) ->
1;


get_glad_ratio(26) ->
1;


get_glad_ratio(27) ->
1;


get_glad_ratio(28) ->
1;


get_glad_ratio(29) ->
1;


get_glad_ratio(30) ->
1;


get_glad_ratio(31) ->
1;


get_glad_ratio(32) ->
1;


get_glad_ratio(33) ->
1;


get_glad_ratio(34) ->
1;


get_glad_ratio(35) ->
1;


get_glad_ratio(36) ->
1;


get_glad_ratio(37) ->
1;


get_glad_ratio(38) ->
1;


get_glad_ratio(39) ->
1;


get_glad_ratio(40) ->
1;


get_glad_ratio(41) ->
1;


get_glad_ratio(42) ->
1;


get_glad_ratio(43) ->
1;


get_glad_ratio(44) ->
1;


get_glad_ratio(45) ->
1;


get_glad_ratio(46) ->
1;


get_glad_ratio(47) ->
1;


get_glad_ratio(48) ->
1;


get_glad_ratio(49) ->
1;


get_glad_ratio(50) ->
1;


get_glad_ratio(51) ->
1;


get_glad_ratio(52) ->
1;


get_glad_ratio(53) ->
1;


get_glad_ratio(54) ->
1;


get_glad_ratio(55) ->
1;


get_glad_ratio(56) ->
1;


get_glad_ratio(57) ->
1;


get_glad_ratio(58) ->
1;


get_glad_ratio(59) ->
1;


get_glad_ratio(60) ->
1;


get_glad_ratio(61) ->
1;


get_glad_ratio(62) ->
1;


get_glad_ratio(63) ->
1;


get_glad_ratio(64) ->
1;


get_glad_ratio(65) ->
1;


get_glad_ratio(66) ->
1;


get_glad_ratio(67) ->
1;


get_glad_ratio(68) ->
1;


get_glad_ratio(69) ->
1;


get_glad_ratio(70) ->
1;


get_glad_ratio(71) ->
1;


get_glad_ratio(72) ->
1;


get_glad_ratio(73) ->
1;


get_glad_ratio(74) ->
1;


get_glad_ratio(75) ->
1;


get_glad_ratio(76) ->
1;


get_glad_ratio(77) ->
1;


get_glad_ratio(78) ->
1;


get_glad_ratio(79) ->
1;


get_glad_ratio(80) ->
1;


get_glad_ratio(81) ->
1;


get_glad_ratio(82) ->
1;


get_glad_ratio(83) ->
1;


get_glad_ratio(84) ->
1;


get_glad_ratio(85) ->
1;


get_glad_ratio(86) ->
1;


get_glad_ratio(87) ->
1;


get_glad_ratio(88) ->
1;


get_glad_ratio(89) ->
1;


get_glad_ratio(90) ->
1;


get_glad_ratio(91) ->
1;


get_glad_ratio(92) ->
1;


get_glad_ratio(93) ->
1;


get_glad_ratio(94) ->
1;


get_glad_ratio(95) ->
1;


get_glad_ratio(96) ->
1;


get_glad_ratio(97) ->
1;


get_glad_ratio(98) ->
1;


get_glad_ratio(99) ->
1;


get_glad_ratio(100) ->
1;

get_glad_ratio(_Medal) ->
	[].

get_glad_stage_reward(1,600) ->
	#glad_stage_reward{openday = 1,point = 600,stage_reward = [{3,0,50000},{0,32010151,3}]};

get_glad_stage_reward(1,1200) ->
	#glad_stage_reward{openday = 1,point = 1200,stage_reward = [{3,0,50000},{0,32010151,3}]};

get_glad_stage_reward(1,2400) ->
	#glad_stage_reward{openday = 1,point = 2400,stage_reward = [{3,0,50000},{0,32010152,3}]};

get_glad_stage_reward(1,4800) ->
	#glad_stage_reward{openday = 1,point = 4800,stage_reward = [{3,0,50000},{0,32010151,3}]};

get_glad_stage_reward(1,7200) ->
	#glad_stage_reward{openday = 1,point = 7200,stage_reward = [{3,0,50000},{0,32010152,3}]};

get_glad_stage_reward(1,9600) ->
	#glad_stage_reward{openday = 1,point = 9600,stage_reward = [{3,0,50000},{0,32010151,3}]};

get_glad_stage_reward(1,12000) ->
	#glad_stage_reward{openday = 1,point = 12000,stage_reward = [{3,0,50000},{0,32010151,3}]};

get_glad_stage_reward(1,14000) ->
	#glad_stage_reward{openday = 1,point = 14000,stage_reward = [{3,0,50000},{0,32010152,3}]};

get_glad_stage_reward(1,16000) ->
	#glad_stage_reward{openday = 1,point = 16000,stage_reward = [{3,0,50000},{0,32010153,3}]};

get_glad_stage_reward(8,600) ->
	#glad_stage_reward{openday = 8,point = 600,stage_reward = [{3,0,50000},{0,32010151,3}]};

get_glad_stage_reward(8,1200) ->
	#glad_stage_reward{openday = 8,point = 1200,stage_reward = [{3,0,50000},{0,32010151,3}]};

get_glad_stage_reward(8,2400) ->
	#glad_stage_reward{openday = 8,point = 2400,stage_reward = [{3,0,50000},{0,32010152,3}]};

get_glad_stage_reward(8,4800) ->
	#glad_stage_reward{openday = 8,point = 4800,stage_reward = [{3,0,50000},{0,32010151,3}]};

get_glad_stage_reward(8,7200) ->
	#glad_stage_reward{openday = 8,point = 7200,stage_reward = [{3,0,50000},{0,32010152,3}]};

get_glad_stage_reward(8,9600) ->
	#glad_stage_reward{openday = 8,point = 9600,stage_reward = [{3,0,50000},{0,32010151,3}]};

get_glad_stage_reward(8,12000) ->
	#glad_stage_reward{openday = 8,point = 12000,stage_reward = [{3,0,50000},{0,32010151,3}]};

get_glad_stage_reward(8,14000) ->
	#glad_stage_reward{openday = 8,point = 14000,stage_reward = [{3,0,50000},{0,32010152,3}]};

get_glad_stage_reward(8,16000) ->
	#glad_stage_reward{openday = 8,point = 16000,stage_reward = [{3,0,50000},{0,32010153,3}]};

get_glad_stage_reward(_Openday,_Point) ->
	[].

get_glad_all_stg_openday() ->
[1,8].


get_glad_all_stg_reward(1) ->
[600,1200,2400,4800,7200,9600,12000,14000,16000];


get_glad_all_stg_reward(8) ->
[600,1200,2400,4800,7200,9600,12000,14000,16000];

get_glad_all_stg_reward(_Openday) ->
	[].


get_glad_rank_reward(1) ->
[{2,0,300},{0,17010002,3},{0,17010001,3},{0,32010152,10},{0,32010151,20},{0,17020001,30}];


get_glad_rank_reward(3) ->
[{2,0,200},{0,17010002,2},{0,17010001,2},{0,32010152,8},{0,32010151,16},{0,17020001,24}];


get_glad_rank_reward(6) ->
[{2,0,150},{0,17010002,1},{0,17010001,1},{0,32010152,6},{0,32010151,12},{0,17020001,16}];


get_glad_rank_reward(20) ->
[{2,0,120},{0,17010001,1},{0,32010152,5},{0,32010151,10},{0,17020001,12}];


get_glad_rank_reward(100) ->
[{2,0,60},{0,17010001,1},{0,32010152,3},{0,32010151,6},{0,17020001,10}];


get_glad_rank_reward(200) ->
[{2,0,50},{0,32010152,2},{0,32010151,4},{0,17020001,8}];

get_glad_rank_reward(_Rank) ->
	[].

get_gladiator_rank_reward(_Rank) when _Rank =< 1 ->
	#glad_rank_reward{rank=1,rank_reward=[{2,0,300},{0,17010002,3},{0,17010001,3},{0,32010152,10},{0,32010151,20},{0,17020001,30}]};
get_gladiator_rank_reward(_Rank) when _Rank =< 3 ->
	#glad_rank_reward{rank=3,rank_reward=[{2,0,200},{0,17010002,2},{0,17010001,2},{0,32010152,8},{0,32010151,16},{0,17020001,24}]};
get_gladiator_rank_reward(_Rank) when _Rank =< 6 ->
	#glad_rank_reward{rank=6,rank_reward=[{2,0,150},{0,17010002,1},{0,17010001,1},{0,32010152,6},{0,32010151,12},{0,17020001,16}]};
get_gladiator_rank_reward(_Rank) when _Rank =< 20 ->
	#glad_rank_reward{rank=20,rank_reward=[{2,0,120},{0,17010001,1},{0,32010152,5},{0,32010151,10},{0,17020001,12}]};
get_gladiator_rank_reward(_Rank) when _Rank =< 100 ->
	#glad_rank_reward{rank=100,rank_reward=[{2,0,60},{0,17010001,1},{0,32010152,3},{0,32010151,6},{0,17020001,10}]};
get_gladiator_rank_reward(_Rank) when _Rank =< 200 ->
	#glad_rank_reward{rank=200,rank_reward=[{2,0,50},{0,32010152,2},{0,32010151,4},{0,17020001,8}]};
get_gladiator_rank_reward(_Rank) ->
	[].

get_max_rank_reward() -> 200.

