%%%---------------------------------------
%%% module      : data_title
%%% description : 头衔配置
%%%
%%%---------------------------------------
-module(data_title).
-compile(export_all).
-include("title.hrl").



get_title_cfg(1001,0) ->
	#base_title_cfg{id = 1001,star = 0,name = <<"天境·如月"/utf8>>,cost = [{0,7601001,30}],attr = [{1,800},{2,16000},{15,600},{16,600},{22,150}]};

get_title_cfg(1001,1) ->
	#base_title_cfg{id = 1001,star = 1,name = <<"天境·如月"/utf8>>,cost = [{0,7601001,60}],attr = [{1,1280},{2,25600},{15,960},{16,960},{22,180}]};

get_title_cfg(1001,2) ->
	#base_title_cfg{id = 1001,star = 2,name = <<"天境·如月"/utf8>>,cost = [{0,7601001,90}],attr = [{1,1760},{2,35200},{15,1320},{16,1320},{22,210}]};

get_title_cfg(1001,3) ->
	#base_title_cfg{id = 1001,star = 3,name = <<"天境·如月"/utf8>>,cost = [{0,7601001,150}],attr = [{1,2240},{2,44800},{15,1680},{16,1680},{22,240}]};

get_title_cfg(1001,4) ->
	#base_title_cfg{id = 1001,star = 4,name = <<"天境·如月"/utf8>>,cost = [{0,7601001,240}],attr = [{1,2720},{2,54400},{15,2040},{16,2040},{22,270}]};

get_title_cfg(1001,5) ->
	#base_title_cfg{id = 1001,star = 5,name = <<"天境·如月"/utf8>>,cost = [{0,7601001,240}],attr = [{1,3200},{2,64000},{15,2400},{16,2400},{22,300}]};

get_title_cfg(1002,0) ->
	#base_title_cfg{id = 1002,star = 0,name = <<"天境·弥生"/utf8>>,cost = [{0,7601002,30}],attr = [{1,1000},{2,20000},{15,800},{16,800},{21,150}]};

get_title_cfg(1002,1) ->
	#base_title_cfg{id = 1002,star = 1,name = <<"天境·弥生"/utf8>>,cost = [{0,7601002,60}],attr = [{1,1600},{2,32000},{15,1280},{16,1280},{21,180}]};

get_title_cfg(1002,2) ->
	#base_title_cfg{id = 1002,star = 2,name = <<"天境·弥生"/utf8>>,cost = [{0,7601002,90}],attr = [{1,2200},{2,44000},{15,1760},{16,1760},{21,210}]};

get_title_cfg(1002,3) ->
	#base_title_cfg{id = 1002,star = 3,name = <<"天境·弥生"/utf8>>,cost = [{0,7601002,150}],attr = [{1,2800},{2,56000},{15,2240},{16,2240},{21,240}]};

get_title_cfg(1002,4) ->
	#base_title_cfg{id = 1002,star = 4,name = <<"天境·弥生"/utf8>>,cost = [{0,7601002,240}],attr = [{1,3400},{2,68000},{15,2720},{16,2720},{21,270}]};

get_title_cfg(1002,5) ->
	#base_title_cfg{id = 1002,star = 5,name = <<"天境·弥生"/utf8>>,cost = [{0,7601002,240}],attr = [{1,4000},{2,80000},{15,3200},{16,3200},{21,300}]};

get_title_cfg(1003,0) ->
	#base_title_cfg{id = 1003,star = 0,name = <<"天境·卯月"/utf8>>,cost = [{0,7601003,30}],attr = [{1,1200},{2,24000},{15,900},{16,900},{20,100}]};

get_title_cfg(1003,1) ->
	#base_title_cfg{id = 1003,star = 1,name = <<"天境·卯月"/utf8>>,cost = [{0,7601003,60}],attr = [{1,1920},{2,38400},{15,1440},{16,1440},{20,120}]};

get_title_cfg(1003,2) ->
	#base_title_cfg{id = 1003,star = 2,name = <<"天境·卯月"/utf8>>,cost = [{0,7601003,90}],attr = [{1,2640},{2,52800},{15,1980},{16,1980},{20,140}]};

get_title_cfg(1003,3) ->
	#base_title_cfg{id = 1003,star = 3,name = <<"天境·卯月"/utf8>>,cost = [{0,7601003,150}],attr = [{1,3360},{2,67200},{15,2520},{16,2520},{20,160}]};

get_title_cfg(1003,4) ->
	#base_title_cfg{id = 1003,star = 4,name = <<"天境·卯月"/utf8>>,cost = [{0,7601003,240}],attr = [{1,4080},{2,81600},{15,3060},{16,3060},{20,180}]};

get_title_cfg(1003,5) ->
	#base_title_cfg{id = 1003,star = 5,name = <<"天境·卯月"/utf8>>,cost = [{0,7601003,240}],attr = [{1,4800},{2,96000},{15,3600},{16,3600},{20,200}]};

get_title_cfg(1004,0) ->
	#base_title_cfg{id = 1004,star = 0,name = <<"天境·皋月"/utf8>>,cost = [{0,7601004,30}],attr = [{1,1400},{2,28000},{15,1050},{16,1050},{19,150}]};

get_title_cfg(1004,1) ->
	#base_title_cfg{id = 1004,star = 1,name = <<"天境·皋月"/utf8>>,cost = [{0,7601004,60}],attr = [{1,2240},{2,44800},{15,1680},{16,1680},{19,180}]};

get_title_cfg(1004,2) ->
	#base_title_cfg{id = 1004,star = 2,name = <<"天境·皋月"/utf8>>,cost = [{0,7601004,90}],attr = [{1,3080},{2,61600},{15,2310},{16,2310},{19,210}]};

get_title_cfg(1004,3) ->
	#base_title_cfg{id = 1004,star = 3,name = <<"天境·皋月"/utf8>>,cost = [{0,7601004,150}],attr = [{1,3920},{2,78400},{15,2940},{16,2940},{19,240}]};

get_title_cfg(1004,4) ->
	#base_title_cfg{id = 1004,star = 4,name = <<"天境·皋月"/utf8>>,cost = [{0,7601004,240}],attr = [{1,4760},{2,95200},{15,3570},{16,3570},{19,270}]};

get_title_cfg(1004,5) ->
	#base_title_cfg{id = 1004,star = 5,name = <<"天境·皋月"/utf8>>,cost = [{0,7601004,240}],attr = [{1,5600},{2,112000},{15,4200},{16,4200},{19,300}]};

get_title_cfg(1005,0) ->
	#base_title_cfg{id = 1005,star = 0,name = <<"天境·伏月"/utf8>>,cost = [{0,7601005,30}],attr = [{1,1600},{2,32000},{15,1280},{16,1280},{44,300}]};

get_title_cfg(1005,1) ->
	#base_title_cfg{id = 1005,star = 1,name = <<"天境·伏月"/utf8>>,cost = [{0,7601005,60}],attr = [{1,2560},{2,51200},{15,2048},{16,2048},{44,360}]};

get_title_cfg(1005,2) ->
	#base_title_cfg{id = 1005,star = 2,name = <<"天境·伏月"/utf8>>,cost = [{0,7601005,90}],attr = [{1,3520},{2,70400},{15,2816},{16,2816},{44,420}]};

get_title_cfg(1005,3) ->
	#base_title_cfg{id = 1005,star = 3,name = <<"天境·伏月"/utf8>>,cost = [{0,7601005,150}],attr = [{1,4480},{2,89600},{15,3584},{16,3584},{44,480}]};

get_title_cfg(1005,4) ->
	#base_title_cfg{id = 1005,star = 4,name = <<"天境·伏月"/utf8>>,cost = [{0,7601005,240}],attr = [{1,5440},{2,108800},{15,4352},{16,4352},{44,540}]};

get_title_cfg(1005,5) ->
	#base_title_cfg{id = 1005,star = 5,name = <<"天境·伏月"/utf8>>,cost = [{0,7601005,240}],attr = [{1,6400},{2,128000},{15,5120},{16,5120},{44,600}]};

get_title_cfg(1006,0) ->
	#base_title_cfg{id = 1006,star = 0,name = <<"天境·文月"/utf8>>,cost = [{0,7601006,30}],attr = [{1,1900},{2,38000},{15,1520},{16,1520},{43,400}]};

get_title_cfg(1006,1) ->
	#base_title_cfg{id = 1006,star = 1,name = <<"天境·文月"/utf8>>,cost = [{0,7601006,60}],attr = [{1,3040},{2,60800},{15,2432},{16,2432},{43,480}]};

get_title_cfg(1006,2) ->
	#base_title_cfg{id = 1006,star = 2,name = <<"天境·文月"/utf8>>,cost = [{0,7601006,90}],attr = [{1,4180},{2,83600},{15,3344},{16,3344},{43,560}]};

get_title_cfg(1006,3) ->
	#base_title_cfg{id = 1006,star = 3,name = <<"天境·文月"/utf8>>,cost = [{0,7601006,150}],attr = [{1,5320},{2,106400},{15,4256},{16,4256},{43,640}]};

get_title_cfg(1006,4) ->
	#base_title_cfg{id = 1006,star = 4,name = <<"天境·文月"/utf8>>,cost = [{0,7601006,240}],attr = [{1,6460},{2,129200},{15,5168},{16,5168},{43,720}]};

get_title_cfg(1006,5) ->
	#base_title_cfg{id = 1006,star = 5,name = <<"天境·文月"/utf8>>,cost = [{0,7601006,240}],attr = [{1,7600},{2,152000},{15,6080},{16,6080},{43,800}]};

get_title_cfg(1007,0) ->
	#base_title_cfg{id = 1007,star = 0,name = <<"天境·叶月"/utf8>>,cost = [{0,7601007,30}],attr = [{1,2200},{2,44000},{15,1760},{16,1760},{28,400}]};

get_title_cfg(1007,1) ->
	#base_title_cfg{id = 1007,star = 1,name = <<"天境·叶月"/utf8>>,cost = [{0,7601007,60}],attr = [{1,3520},{2,70400},{15,2816},{16,2816},{28,480}]};

get_title_cfg(1007,2) ->
	#base_title_cfg{id = 1007,star = 2,name = <<"天境·叶月"/utf8>>,cost = [{0,7601007,90}],attr = [{1,4840},{2,96800},{15,3872},{16,3872},{28,560}]};

get_title_cfg(1007,3) ->
	#base_title_cfg{id = 1007,star = 3,name = <<"天境·叶月"/utf8>>,cost = [{0,7601007,150}],attr = [{1,6160},{2,123200},{15,4928},{16,4928},{28,640}]};

get_title_cfg(1007,4) ->
	#base_title_cfg{id = 1007,star = 4,name = <<"天境·叶月"/utf8>>,cost = [{0,7601007,240}],attr = [{1,7480},{2,149600},{15,5984},{16,5984},{28,720}]};

get_title_cfg(1007,5) ->
	#base_title_cfg{id = 1007,star = 5,name = <<"天境·叶月"/utf8>>,cost = [{0,7601007,240}],attr = [{1,8800},{2,176000},{15,7040},{16,7040},{28,800}]};

get_title_cfg(1008,0) ->
	#base_title_cfg{id = 1008,star = 0,name = <<"天境·长月"/utf8>>,cost = [{0,7601008,30}],attr = [{1,2500},{2,50000},{15,2000},{16,2000},{27,500}]};

get_title_cfg(1008,1) ->
	#base_title_cfg{id = 1008,star = 1,name = <<"天境·长月"/utf8>>,cost = [{0,7601008,60}],attr = [{1,4000},{2,80000},{15,3200},{16,3200},{27,600}]};

get_title_cfg(1008,2) ->
	#base_title_cfg{id = 1008,star = 2,name = <<"天境·长月"/utf8>>,cost = [{0,7601008,90}],attr = [{1,5500},{2,110000},{15,4400},{16,4400},{27,700}]};

get_title_cfg(1008,3) ->
	#base_title_cfg{id = 1008,star = 3,name = <<"天境·长月"/utf8>>,cost = [{0,7601008,150}],attr = [{1,7000},{2,140000},{15,5600},{16,5600},{27,800}]};

get_title_cfg(1008,4) ->
	#base_title_cfg{id = 1008,star = 4,name = <<"天境·长月"/utf8>>,cost = [{0,7601008,240}],attr = [{1,8500},{2,170000},{15,6800},{16,6800},{27,900}]};

get_title_cfg(1008,5) ->
	#base_title_cfg{id = 1008,star = 5,name = <<"天境·长月"/utf8>>,cost = [{0,7601008,240}],attr = [{1,10000},{2,200000},{15,8000},{16,8000},{27,1000}]};

get_title_cfg(1009,0) ->
	#base_title_cfg{id = 1009,star = 0,name = <<"天境·霜月"/utf8>>,cost = [{0,7601009,30}],attr = [{1,2800},{2,56000},{15,2240},{16,2240},{14,150}]};

get_title_cfg(1009,1) ->
	#base_title_cfg{id = 1009,star = 1,name = <<"天境·霜月"/utf8>>,cost = [{0,7601009,60}],attr = [{1,4480},{2,89600},{15,3584},{16,3584},{14,180}]};

get_title_cfg(1009,2) ->
	#base_title_cfg{id = 1009,star = 2,name = <<"天境·霜月"/utf8>>,cost = [{0,7601009,90}],attr = [{1,6160},{2,123200},{15,4928},{16,4928},{14,210}]};

get_title_cfg(1009,3) ->
	#base_title_cfg{id = 1009,star = 3,name = <<"天境·霜月"/utf8>>,cost = [{0,7601009,150}],attr = [{1,7840},{2,156800},{15,6272},{16,6272},{14,240}]};

get_title_cfg(1009,4) ->
	#base_title_cfg{id = 1009,star = 4,name = <<"天境·霜月"/utf8>>,cost = [{0,7601009,240}],attr = [{1,9520},{2,190400},{15,7616},{16,7616},{14,270}]};

get_title_cfg(1009,5) ->
	#base_title_cfg{id = 1009,star = 5,name = <<"天境·霜月"/utf8>>,cost = [{0,7601009,240}],attr = [{1,11200},{2,224000},{15,8960},{16,8960},{14,300}]};

get_title_cfg(1010,0) ->
	#base_title_cfg{id = 1010,star = 0,name = <<"天境·师走"/utf8>>,cost = [{0,7601010,30}],attr = [{1,3200},{2,64000},{15,2560},{16,2560},{13,200}]};

get_title_cfg(1010,1) ->
	#base_title_cfg{id = 1010,star = 1,name = <<"天境·师走"/utf8>>,cost = [{0,7601010,60}],attr = [{1,5120},{2,102400},{15,4096},{16,4096},{13,240}]};

get_title_cfg(1010,2) ->
	#base_title_cfg{id = 1010,star = 2,name = <<"天境·师走"/utf8>>,cost = [{0,7601010,90}],attr = [{1,7040},{2,140800},{15,5632},{16,5632},{13,280}]};

get_title_cfg(1010,3) ->
	#base_title_cfg{id = 1010,star = 3,name = <<"天境·师走"/utf8>>,cost = [{0,7601010,150}],attr = [{1,8960},{2,179200},{15,7168},{16,7168},{13,320}]};

get_title_cfg(1010,4) ->
	#base_title_cfg{id = 1010,star = 4,name = <<"天境·师走"/utf8>>,cost = [{0,7601010,240}],attr = [{1,10880},{2,217600},{15,8704},{16,8704},{13,360}]};

get_title_cfg(1010,5) ->
	#base_title_cfg{id = 1010,star = 5,name = <<"天境·师走"/utf8>>,cost = [{0,7601010,240}],attr = [{1,12800},{2,256000},{15,10240},{16,10240},{13,400}]};

get_title_cfg(_Id,_Star) ->
	[].

get_all_title() ->
[1001,1002,1003,1004,1005,1006,1007,1008,1009,1010].


get_value(need_not_send_tv) ->
[1001,1002];


get_value(open_lv) ->
420;

get_value(_Key) ->
	[].

