%%%---------------------------------------
%%% module      : data_module
%%% description : 功能id配置
%%%
%%%---------------------------------------
-module(data_module).
-compile(export_all).




get(0) ->
<<"无"/utf8>>;


get(102) ->
<<"游戏基础"/utf8>>;


get(105) ->
<<"设置"/utf8>>;


get(110) ->
<<"聊天系统"/utf8>>;


get(112) ->
<<"个性装扮"/utf8>>;


get(113) ->
<<"微信"/utf8>>;


get(120) ->
<<"场景系统"/utf8>>;


get(130) ->
<<"角色系统"/utf8>>;


get(132) ->
<<"主线挂机"/utf8>>;


get(133) ->
<<"结界守护"/utf8>>;


get(134) ->
<<"勋章"/utf8>>;


get(135) ->
<<"九魂圣殿"/utf8>>;


get(137) ->
<<"钻石大战"/utf8>>;


get(138) ->
<<"功能开启"/utf8>>;


get(139) ->
<<"圣裁"/utf8>>;


get(140) ->
<<"社交系统"/utf8>>;


get(141) ->
<<"背饰"/utf8>>;


get(142) ->
<<"伙伴（新）"/utf8>>;


get(143) ->
<<"龙珠"/utf8>>;


get(144) ->
<<"战甲"/utf8>>;


get(148) ->
<<"精灵"/utf8>>;


get(149) ->
<<"幻饰"/utf8>>;


get(150) ->
<<"背包物品"/utf8>>;


get(151) ->
<<"交易系统"/utf8>>;


get(152) ->
<<"装备系统"/utf8>>;


get(153) ->
<<"商城系统"/utf8>>;


get(154) ->
<<"拍卖行"/utf8>>;


get(155) ->
<<"圣印功能"/utf8>>;


get(156) ->
<<"邮件推送"/utf8>>;


get(157) ->
<<"活动日历"/utf8>>;


get(158) ->
<<"充值系统"/utf8>>;


get(159) ->
<<"充值活动"/utf8>>;


get(160) ->
<<"外形培养系统"/utf8>>;


get(161) ->
<<"翅膀"/utf8>>;


get(163) ->
<<"头饰"/utf8>>;


get(164) ->
<<"天命觉醒"/utf8>>;


get(165) ->
<<"宠物"/utf8>>;


get(166) ->
<<"爵位"/utf8>>;


get(167) ->
<<"符文"/utf8>>;


get(168) ->
<<"法宝"/utf8>>;


get(169) ->
<<"神兵"/utf8>>;


get(170) ->
<<"聚魂"/utf8>>;


get(171) ->
<<"神器"/utf8>>;


get(172) ->
<<"婚姻"/utf8>>;


get(173) ->
<<"幻兽"/utf8>>;


get(174) ->
<<"中午答题"/utf8>>;


get(175) ->
<<"七天登录"/utf8>>;


get(176) ->
<<"神秘限购"/utf8>>;


get(177) ->
<<"家园"/utf8>>;


get(178) ->
<<"坐骑装备"/utf8>>;


get(179) ->
<<"周一大奖"/utf8>>;


get(180) ->
<<"灵器"/utf8>>;


get(181) ->
<<"龙纹"/utf8>>;


get(182) ->
<<"宝宝"/utf8>>;


get(183) ->
<<"使魔"/utf8>>;


get(185) ->
<<"矿石护送"/utf8>>;


get(186) ->
<<"怒海争霸"/utf8>>;


get(187) ->
<<"海域日常"/utf8>>;


get(188) ->
<<"新版boss首杀"/utf8>>;


get(189) ->
<<"璀璨之海"/utf8>>;


get(190) ->
<<"邮件系统"/utf8>>;


get(191) ->
<<"礼包推送"/utf8>>;


get(192) ->
<<"活动托管"/utf8>>;


get(194) ->
<<"祭典"/utf8>>;


get(200) ->
<<"战斗信息"/utf8>>;


get(202) ->
<<"免战保护"/utf8>>;


get(203) ->
<<"藏宝图"/utf8>>;


get(204) ->
<<"时空裂缝"/utf8>>;


get(206) ->
<<"百鬼夜行"/utf8>>;


get(210) ->
<<"技能系统"/utf8>>;


get(211) ->
<<"远古奥术"/utf8>>;


get(215) ->
<<"聚魂本"/utf8>>;


get(216) ->
<<"守护"/utf8>>;


get(217) ->
<<"属性药剂"/utf8>>;


get(218) ->
<<"圣灵战场"/utf8>>;


get(221) ->
<<"排行榜"/utf8>>;


get(223) ->
<<"花语鲜花周榜"/utf8>>;


get(224) ->
<<"魅力榜活动"/utf8>>;


get(225) ->
<<"开服冲榜"/utf8>>;


get(227) ->
<<"循环冲榜"/utf8>>;


get(232) ->
<<"星宿"/utf8>>;


get(233) ->
<<"神庭"/utf8>>;


get(240) ->
<<"组队系统"/utf8>>;


get(241) ->
<<"众生之门"/utf8>>;


get(279) ->
<<"永恒圣殿"/utf8>>;


get(280) ->
<<"竞技"/utf8>>;


get(281) ->
<<"巅峰竞技"/utf8>>;


get(283) ->
<<"圣域"/utf8>>;


get(284) ->
<<"跨服圣域"/utf8>>;


get(285) ->
<<"午间派对"/utf8>>;


get(286) ->
<<"天启装备"/utf8>>;


get(300) ->
<<"任务系统"/utf8>>;


get(311) ->
<<"活动系统"/utf8>>;


get(331) ->
<<"定制活动"/utf8>>;


get(332) ->
<<"其他系列活动"/utf8>>;


get(333) ->
<<"嗨点"/utf8>>;


get(338) ->
<<"竞榜活动"/utf8>>;


get(339) ->
<<"红包系统"/utf8>>;


get(340) ->
<<"邀请"/utf8>>;


get(342) ->
<<"竞猜"/utf8>>;


get(400) ->
<<"公会系统"/utf8>>;


get(401) ->
<<"公会仓库"/utf8>>;


get(402) ->
<<"公会活动"/utf8>>;


get(403) ->
<<"公会宝箱"/utf8>>;


get(404) ->
<<"公会协助"/utf8>>;


get(405) ->
<<"公会神像"/utf8>>;


get(409) ->
<<"成就系统"/utf8>>;


get(411) ->
<<"称号系统"/utf8>>;


get(413) ->
<<"时装系统"/utf8>>;


get(414) ->
<<"青云夺宝"/utf8>>;


get(415) ->
<<"祈愿"/utf8>>;


get(416) ->
<<"寻宝"/utf8>>;


get(417) ->
<<"福利(签到,冲级,更新,礼包)"/utf8>>;


get(418) ->
<<"魅力海滩"/utf8>>;


get(419) ->
<<"奖励找回"/utf8>>;


get(420) ->
<<"投资活动"/utf8>>;


get(422) ->
<<"星图"/utf8>>;


get(423) ->
<<"天魂"/utf8>>;


get(424) ->
<<"永恒碑谷"/utf8>>;


get(425) ->
<<"冒险之书"/utf8>>;


get(426) ->
<<"改名"/utf8>>;


get(427) ->
<<"天天冒险"/utf8>>;


get(429) ->
<<"神殿觉醒"/utf8>>;


get(437) ->
<<"跨服公会战"/utf8>>;


get(440) ->
<<"降神"/utf8>>;


get(442) ->
<<"怪物图鉴"/utf8>>;


get(450) ->
<<"vip系统"/utf8>>;


get(451) ->
<<"至尊vip"/utf8>>;


get(452) ->
<<"周卡"/utf8>>;


get(460) ->
<<"本服BOSS"/utf8>>;


get(470) ->
<<"幻兽之域"/utf8>>;


get(471) ->
<<"幻饰boss"/utf8>>;


get(480) ->
<<"跨服入侵"/utf8>>;


get(490) ->
<<"惊喜礼包"/utf8>>;


get(500) ->
<<"天使护送"/utf8>>;


get(505) ->
<<"公会战"/utf8>>;


get(506) ->
<<"跨服领地战"/utf8>>;


get(507) ->
<<"个人排行本"/utf8>>;


get(508) ->
<<"周常副本"/utf8>>;


get(510) ->
<<"boss转盘"/utf8>>;


get(512) ->
<<"跨服云购"/utf8>>;


get(600) ->
<<"虚空秘境"/utf8>>;


get(601) ->
<<"跨服服战"/utf8>>;


get(602) ->
<<"三军之战"/utf8>>;


get(603) ->
<<"幻兽入侵"/utf8>>;


get(604) ->
<<"星钻联盟"/utf8>>;


get(605) ->
<<"精灵飞行器（为支持技能属性）"/utf8>>;


get(606) ->
<<"圣灵"/utf8>>;


get(607) ->
<<"圣者殿"/utf8>>;


get(610) ->
<<"副本"/utf8>>;


get(612) ->
<<"等级活动"/utf8>>;


get(618) ->
<<"我要变强"/utf8>>;


get(619) ->
<<"pk记录"/utf8>>;


get(620) ->
<<"失落圣殿"/utf8>>;


get(621) ->
<<"跨服1vN"/utf8>>;


get(622) ->
<<"龙语"/utf8>>;


get(640) ->
<<"抢购商城"/utf8>>;


get(650) ->
<<"跨服3v3"/utf8>>;


get(651) ->
<<"龙语首领"/utf8>>;


get(652) ->
<<"领地夺宝"/utf8>>;


get(653) ->
<<"决斗场"/utf8>>;


get(654) ->
<<"圣印"/utf8>>;

get(_Id) ->
	"".

