%%%---------------------------------------
%%% module      : data_version_upgradebag
%%% description : 版本更新礼包配置
%%%
%%%---------------------------------------
-module(data_version_upgradebag).
-compile(export_all).
-include("version_upgradebag.hrl").



get_version_cfg(1) ->
	#base_version_upgradebag_reward{version_code = 1,color = 0,content = "亲爱的冒险家，为了提供更好的游戏体验。游戏定于<font color=0x639c12>11月5日6:00-7:00</font>进行停机维护，本次更新如下:

##<font color=0xffffff>跨服圣域-阵营模式强势来袭。</font>
@@1.原来跨服圣域的“进阶8服模式“ 将替换为“阵营模式“。
@@2.届时，您所在的服务器将随机与另一个服务器签订盟约强强联手，组成阵营共同对抗其它阵营。

##<font color=0xffffff>圣域夺宝规则进行相应调整。</font>
@@1.要塞占领将依然按照本服参与人数产出相应价值的拍卖品。
@@2.要塞占领拍品和怪物击杀拍品 都将在归属阵营的每个服务器中各自产出一份。
@@3.分红范围依然为本服满足条件者

##<font color=0xffffff>-新增龙语兑换商店</font>
@@1.开启条件：开服50天和角色等级达到540级
@@2.入口：商城-龙语
@@3.龙语秘境击杀精英怪即可掉落龙语碎片，收集龙语碎片即可在龙语商店中兑换龙语装备
@@4.根据身上龙语值，可兑换指定阶数龙语宝箱，最高可兑换15阶龙语宝箱
@@5.集齐对应龙语装备，激活龙语即可获得海量属性加成


##<font color=0xffffff>新增道具-蒙面变身卡</font>
想做好事不留名或者十步杀一人，千里不留行？蒙面变身卡是你的不二之选！
@@1.使用后，在世界BOSS、跨服圣域等场景，其他玩家将无法查看你的真实身份。
@@2.在寻宝、竞猜等运营活动中的角色名称会以“蒙面人”展示。
@@3.一张蒙面变身卡效果持续1小时，使用多张蒙面变身卡可累加蒙面时间。可在BUFF界面取消变身效果。
@@4.部分运营活动将产出蒙面变身卡，敬请期待！

##<font color=0xffffff>新增Boss复活令</font>
@@1.分为世界boss和圣兽岭boss复活令，使用后可让对应场景中任意一只未复活的boss马上复活，需要走到boss出生点处方可使用
@@2.具体产出请留意各大运营活动

##<font color=0xffffff>新增降神-大天使长·加百列</font>
@@1。开启等级：玩家达到400级开启降神系统，可通过主界面【骑宠】进入
@@2。技能·烈震天冲：加百列挥动大天使之剑，对自身圆形范围内的12个怪物和6个玩家造成350%伤害
@@3。技能·裁决神域：加百列以自身为圆心召唤不可侵犯的神域，对进入神域中最多14个怪物和7个玩家造成650%的攻击
@@4。天赋·破血狂攻：变身时无敌1。5s，加百列对敌人造成的伤害10%用于治疗自己，持续5秒，冷却60秒
@@5。天赋·天羽审判：变身时，伤害加深增加15%
@@6。天赋·圣光降临：变身时，加百列攻击时有5%概率召唤圣光裁决，对敌人造成血量上限*10%伤害，仅对玩家生效
@@7。天赋·末世号角：变身时，变身时，大天使加百列技能造成的伤害提升35%

##<font color=0xffffff>功能优化</font>
@@1.优化部分机型适配效果，提高性能

##<font color=0xffffff>bug修复</font>
@@1.粉色图鉴成就无法激活问题
@@2.修复部分道具描述错误问题
@@3.修复部分界面异常问题

##<font color=0xffffff>下周版本预告</font>
@@1。全新人物技能上古禁术即将开启，敬请期待。",name = "更新礼包",rewards = [{100, 37010006, 3},{100,37020001,3},{2,36020001,10}],starttime = 1555862400,endtime = 1572969599,state = 1,is_login_tip = 0,source_list = []};

get_version_cfg(_Versioncode) ->
	[].

