%%%---------------------------------------
%%% module      : data_language
%%% description : 语言配置
%%%
%%%---------------------------------------
-module(data_language).
-compile(export_all).
-include("language.hrl").




get(2) ->
<<"道具自动下架"/utf8>>;


get(3) ->
<<"您寄售的道具<color@{1}>[{2}]</color>已上架{3}小时未售出，系统将其自动下架，请及时查收。"/utf8>>;


get(4) ->
<<"物品寄售成功"/utf8>>;


get(5) ->
<<"您成功出售<color@{1}>[{2}]</color>x{3}，扣除{4}勾玉手续费后您获得{5}勾玉，请及时查收附件。"/utf8>>;


get(6) ->
<<"购买成功"/utf8>>;


get(7) ->
<<"您已成功花费{1}勾玉购买<color@{2}>[{3}]</color>x{4},请及时查收邮件！"/utf8>>;


get(35) ->
<<"充值成功"/utf8>>;


get(36) ->
<<"恭喜您，您于{1}年{2}月{3}日{4}时{5}分充值的{6}勾玉已成功注入。"/utf8>>;


get(37) ->
<<"等级奖励"/utf8>>;


get(38) ->
<<"恭喜你达到{1}级，以下是你的奖励！"/utf8>>;


get(43) ->
<<"魅力海滩"/utf8>>;


get(44) ->
<<"恭喜您！您在魅力海滩活动中魅力值排第<color@0>{1}</color>名，获得以下奖励！"/utf8>>;


get(52) ->
<<"购买{1}"/utf8>>;


get(53) ->
<<"恭喜您成功购买{1}，除充值勾玉外还一次性额外赠送您{2}绑玉。祝您游戏愉快！"/utf8>>;


get(54) ->
<<"恭喜您成为VIP用户"/utf8>>;


get(55) ->
<<"亲爱的阴阳师:恭喜您成为我们的VIP用户，我是您的VIP专属客服。请点击游戏左上角图标-天降宝藏（150级后在福利大厅-天降宝藏），对我进行扫码添加。我们为您准备了丰厚的礼包，并且提供更优质的游戏性能体验，获得更多专属特权！"/utf8>>;


get(89) ->
<<"{1}奖励"/utf8>>;


get(90) ->
<<"在掉线期间，您通过了{1}，获得以下奖励，请接收！"/utf8>>;


get(91) ->
<<"亲爱的阴阳师：在掉线期间，你所在的队伍通过了{1}，获得以下奖励，请接收！"/utf8>>;


get(92) ->
<<"亲爱的阴阳师：由于您的背包空间不足，您在{1}获得以下奖励暂时以邮件形式保存，请尽快清理背包！"/utf8>>;


get(131) ->
<<"改名通知"/utf8>>;


get(132) ->
<<"亲爱的阴阳师，您的好友{1}现已更名为{2}，请继续保持联系哦！
点击主界面左上角角色头像可进入【设置】界面,通过角色名称右侧小图标即可修改名字."/utf8>>;


get(133) ->
<<"亲爱的阴阳师，您的仇人{1}现已更名为{2}，请继续保持追寻其下落！"/utf8>>;


get(134) ->
<<"红名值提醒"/utf8>>;


get(135) ->
<<"亲爱的阴阳师，由于您在野外场景不小心击杀了{1}，增加了1点红名值，红名状态下野外挂机被击杀将损失20绑玉。您可以在人物战斗模式旁边的buff列表中查看当前红名值信息。"/utf8>>;


get(145) ->
<<"任务奖励"/utf8>>;


get(146) ->
<<"亲爱的阴阳师，您的背包已满，现在我们将任务的奖励通过邮件发送给你，请及时查收。"/utf8>>;


get(147) ->
<<"充值活动"/utf8>>;


get(148) ->
<<"您的背包不足。"/utf8>>;


get(151) ->
<<"被gm或指导员禁言!禁言时长为{1}分钟"/utf8>>;


get(152) ->
<<"违反规则,40级下与非好友私聊次数超过30条!禁言时长为{1}分钟"/utf8>>;


get(153) ->
<<"违反规则,40级下私聊好友超过20个!禁言时长为{1}分钟"/utf8>>;


get(154) ->
<<"被举报超过10次!禁言时长为{1}分钟"/utf8>>;


get(155) ->
<<"gm或指导员手动解除禁言!"/utf8>>;


get(156) ->
<<"自动解除禁言!"/utf8>>;


get(157) ->
<<"gm或新手指导员"/utf8>>;


get(158) ->
<<"自动"/utf8>>;


get(179) ->
<<"神秘人"/utf8>>;


get(180) ->
<<"系统"/utf8>>;


get(181) ->
<<"野怪"/utf8>>;


get(182) ->
<<"守卫"/utf8>>;


get(183) ->
<<"永夜"/utf8>>;


get(184) ->
<<"离线挂机自动买活"/utf8>>;


get(185) ->
<<"您在本次挂机过程中被击败了{1}次，最近一次击败您的为{2}！通过自动买活功能消耗了{3}绑玉和{4}勾玉，保证了您的挂机收益！"/utf8>>;


get(186) ->
<<"称号移除通知"/utf8>>;


get(187) ->
<<"亲爱的阴阳师，您的称号《{1}》因为过期或者被玩家替代等原因被系统移除了，请您据悉！"/utf8>>;


get(201) ->
<<"被击败通知"/utf8>>;


get(202) ->
<<"您在野外被<color@5>[{1}]</color>所击败,自动买活消耗了<color@1>{2}绑玉和{3}勾玉</color>，此仇不共戴天，日后遇上定要叫其付出代价！（可在【设置】—【挂机设置】中关闭自动买活）"/utf8>>;


get(203) ->
<<"背包空间不足"/utf8>>;


get(204) ->
<<"由于您的背包空间不足，无法放入背包的物品以邮件的形式发送给您，请尽快领取附件并整理背包！"/utf8>>;


get(205) ->
<<"共鸣材料返还"/utf8>>;


get(206) ->
<<"由于更换装备导致共鸣解散，现返还您全部打造材料"/utf8>>;


get(207) ->
<<"副本掉落自动拾取"/utf8>>;


get(208) ->
<<"您的副本掉落由于背包空间不足，现由邮件发送与您："/utf8>>;


get(209) ->
<<"贵族过期，宝石卸下"/utf8>>;


get(210) ->
<<"亲爱的阴阳师，您的贵族特权已过期，通过贵族特权解锁的宝石孔已重新锁住。由于您背包已满，现通过附件归还您已镶嵌的宝石，请在附件查收。"/utf8>>;


get(211) ->
<<"排位赛排名突破奖励"/utf8>>;


get(212) ->
<<"亲爱的阴阳师，您在排位赛中的最佳名次突破至<color@0>{1}</color>名，这是您的奖励，请再接再厉!"/utf8>>;


get(213) ->
<<"结社晚宴奖励"/utf8>>;


get(214) ->
<<"亲爱的阴阳师，您于{1}月{2}日晚参加的结社晚宴，一共获得{3}经验值与{4}结社贡献值，上线时已自动发放！"/utf8>>;


get(215) ->
<<"求婚未成功通知"/utf8>>;


get(216) ->
<<"亲爱的阴阳师，很遗憾，对方希望再考虑一下！"/utf8>>;


get(217) ->
<<"求婚超时通知"/utf8>>;


get(218) ->
<<"亲爱的阴阳师，很遗憾，您的求婚对象在指定时间内没有做出回复！"/utf8>>;


get(219) ->
<<"距离下一波大妖突袭还有{1}秒"/utf8>>;


get(220) ->
<<"求婚未成功通知"/utf8>>;


get(221) ->
<<"亲爱的阴阳师，很遗憾，对方希望再考虑一下！"/utf8>>;


get(222) ->
<<"婚礼奖励"/utf8>>;


get(223) ->
<<"亲爱的阴阳师，恭喜您踏入婚姻的殿堂，开始新的人生旅程！特奉上一份结婚礼物作为对您的祝福，请查收附件！"/utf8>>;


get(224) ->
<<"离婚失败通知"/utf8>>;


get(225) ->
<<"亲爱的阴阳师，很遗憾因为某些特殊原因，您暂时无法离婚，请与游戏管理员联系。"/utf8>>;


get(226) ->
<<"伴侣专属礼物"/utf8>>;


get(227) ->
<<"时间在变，容颜在变，只有我对你的情不变，<color@1>{1}</color>给你送上一份<color@3>{2}</color>，真是太甜蜜了！  <color@0><a@showlove>我也要送</a></color>"/utf8>>;


get(228) ->
<<"婚礼预订失败通知"/utf8>>;


get(229) ->
<<"亲爱的阴阳师，很遗憾因为某些特殊原因，您无法预定该场婚礼，这是您消耗的勾玉或物品，请查收。"/utf8>>;


get(230) ->
<<"购买邀请函失败通知"/utf8>>;


get(231) ->
<<"亲爱的阴阳师，很遗憾因为某些特殊原因，您无法购买邀请函，这是您消耗的勾玉，请查收。"/utf8>>;


get(232) ->
<<"婚礼气氛值奖励"/utf8>>;


get(233) ->
<<"亲爱的阴阳师，这是<color@1>{1}</color>和<color@1>{2}</color>的婚礼气氛值奖励，由于您的背包已满，现通过邮件发放给您，请查收！"/utf8>>;


get(234) ->
<<"巅峰竞技赛季奖励发放"/utf8>>;


get(235) ->
<<"亲爱的{1}，您上赛季达到{2}段位{3}星，现发放赛季奖励如下："/utf8>>;


get(238) ->
<<"连胜奖励"/utf8>>;


get(239) ->
<<"会长将本结社的连胜奖励分配给了您，请继续为结社荣耀而战！"/utf8>>;


get(240) ->
<<"终结奖励"/utf8>>;


get(241) ->
<<"会长将本结社的终结奖励分配给了您，请继续为结社荣耀而战！"/utf8>>;


get(242) ->
<<"御魂塔每日奖励"/utf8>>;


get(243) ->
<<"这是您离线期间的御魂塔累积的每日奖励（通关层数越高，奖励越多）"/utf8>>;


get(244) ->
<<"巅峰竞技奖励"/utf8>>;


get(245) ->
<<"最强结社奖励"/utf8>>;


get(246) ->
<<"由于您的背包已满，故特将您应得的最强结社战斗奖励奉上，请及时清理背包"/utf8>>;


get(247) ->
<<"由于您的背包已满，故特将您应得的挑战奖励奉上，请及时清理背包"/utf8>>;


get(248) ->
<<"智慧达人经验"/utf8>>;


get(249) ->
<<"亲爱阴阳师，您在答题结束后，有经验未领取哦！要记得及时领取哦！"/utf8>>;


get(250) ->
<<"智慧达人排名奖励"/utf8>>;


get(251) ->
<<"亲爱阴阳师，恭喜您在智慧达人活动中积分排名第<color@0>{1}</color>，这是您的奖励，请查收!"/utf8>>;


get(252) ->
<<"装备寻宝"/utf8>>;


get(253) ->
<<"巅峰寻宝"/utf8>>;


get(254) ->
<<"至尊寻宝"/utf8>>;


get(255) ->
<<"资源找回奖励"/utf8>>;


get(256) ->
<<"由于您的背包已满，故特将您应得的资源找回奖励奉上，请及时清理背包"/utf8>>;


get(257) ->
<<"未发放的连胜奖励"/utf8>>;


get(258) ->
<<"您的结社之前有未发放的最强结社连胜奖励，特发此邮件奉上。"/utf8>>;


get(259) ->
<<"未发放的终结奖励"/utf8>>;


get(260) ->
<<"您的结社之前有未发放的终结奖励，特发此邮件奉上。"/utf8>>;


get(261) ->
<<"婚礼返还通知"/utf8>>;


get(262) ->
<<"亲爱的阴阳师，您和{1}的{2}由于游戏更新的原因无法正常完成，现补偿您在这次婚礼的消耗和婚礼预约的次数！"/utf8>>;


get(263) ->
<<"亲爱的阴阳师，您和{1}的{2}由于合服的原因无法正常完成，现补偿您在这次婚礼的消耗和婚礼预约的次数！"/utf8>>;


get(273) ->
<<"投票中断返还"/utf8>>;


get(274) ->
<<"由于队伍投票的中断，现返还您投票时的消耗"/utf8>>;


get(275) ->
<<"护送巫女完成奖励"/utf8>>;


get(276) ->
<<"亲爱的阴阳师，恭喜您成功完成护送巫女任务，这是您的奖励，请注意查收哦。"/utf8>>;


get(277) ->
<<"护送公主完成奖励"/utf8>>;


get(278) ->
<<"亲爱的阴阳师，恭喜您成功完成护送巫女任务，这是您的奖励，请注意查收哦。"/utf8>>;


get(279) ->
<<"{1}冲榜奖励"/utf8>>;


get(280) ->
<<"恭喜您在<color@3>{1}</color>冲榜活动中获得第<color@3>{2}</color>名，这是您的奖励！"/utf8>>;


get(281) ->
<<"冲榜目标奖励"/utf8>>;


get(282) ->
<<"冲榜目标奖励"/utf8>>;


get(283) ->
<<"{1}月{2}日"/utf8>>;


get(284) ->
<<"诛邪战场每日奖励"/utf8>>;


get(285) ->
<<"您未主动领取{1}的诛邪战场奖励，特在此将奖励补发给您，下次记得去领奖啊！"/utf8>>;


get(286) ->
<<"魅力榜奖励"/utf8>>;


get(287) ->
<<"恭喜您在本次魅力榜活动中获得<color@0>{1}</color>名，这是您的奖励！"/utf8>>;


get(288) ->
<<"婚礼榜奖励"/utf8>>;


get(289) ->
<<"恭喜您在本次婚礼榜活动中获得<color@0>{1}</color>名，这是您的奖励！"/utf8>>;


get(290) ->
<<"每日累充{1}勾玉礼包"/utf8>>;


get(291) ->
<<"亲爱的阴阳师，您{1}有一份每日累充{2}勾玉的礼包忘记领取了，请查收！"/utf8>>;


get(292) ->
<<"累计{1}天充值{2}勾玉奖励"/utf8>>;


get(293) ->
<<"亲爱的阴阳师，您有一份累计{1}天充值{2}勾玉的奖励忘记领取了，请查收！"/utf8>>;


get(294) ->
<<"竞技场排名奖励"/utf8>>;


get(295) ->
<<"奉上您的竞技场每日排名奖励，请再接再厉！"/utf8>>;


get(296) ->
<<"排位赛战斗奖励"/utf8>>;


get(297) ->
<<"恭喜您获得排位赛战斗奖励，由于您背包空间不足，现邮件发放物品附件！"/utf8>>;


get(298) ->
<<"称号移除通知"/utf8>>;


get(299) ->
<<"亲爱的阴阳师，因为合并服务器的原因重置了最强结社赛事，您的称号《{1}》被系统移除，请您据悉！"/utf8>>;


get(302) ->
<<"全民偶像奖励"/utf8>>;


get(303) ->
<<"恭喜您在全民偶像活动中获得【全民男神】第<color@0>{1}</color>名，这是您的奖励！"/utf8>>;


get(304) ->
<<"御魂召唤"/utf8>>;


get(305) ->
<<"恭喜您在全民偶像活动中获得【全民女神】第<color@0>{1}</color>名，这是您的奖励！"/utf8>>;


get(308) ->
<<"称号回收通知"/utf8>>;


get(309) ->
<<"亲爱的阴阳师，您的称号《{1}》因为离婚被系统回收了，请您据悉！"/utf8>>;


get(310) ->
<<"称号重复获得通知"/utf8>>;


get(311) ->
<<"亲爱的阴阳师，由于《{1}》称号您已激活，重复获得该称号返回您{2}金币，请查收！"/utf8>>;


get(312) ->
<<"最强王者资格赛排名奖励"/utf8>>;


get(313) ->
<<"亲爱的阴阳师，恭喜您在最强王者资格赛中取得第{1}名的成绩！以下是你的奖励，请及时领取！"/utf8>>;


get(314) ->
<<"王者之巅竞猜失败"/utf8>>;


get(315) ->
<<"很遗憾，您在王者之巅竞猜中差了一点运气并没有猜中"/utf8>>;


get(316) ->
<<"王者之巅竞猜成功"/utf8>>;


get(317) ->
<<"真是好运啊，您在王者之巅竞猜中运气爆棚竞猜成功！获得了绑玉奖励"/utf8>>;


get(318) ->
<<"擂台赛对战奖励"/utf8>>;


get(319) ->
<<"亲爱的阴阳师，您的对手畏惧与您可怕的实力，选择了弃权，现把第{1}轮的胜利奖励发放给您,注意查收哟~"/utf8>>;


get(320) ->
<<"亲爱的阴阳师，因为擂主在战斗前提前离开了战场，您和您的队友们获得胜利，现把第{1}轮的胜利奖励发放给您，注意查收哟~"/utf8>>;


get(321) ->
<<"最强王者排名奖励"/utf8>>;


get(322) ->
<<"恭喜您在此次的最强王者中取得第{1}名的好成绩，以下是您获得的奖励，请及时领取附件。"/utf8>>;


get(323) ->
<<"战区合并"/utf8>>;


get(324) ->
<<"亲爱的阴阳师，因为您当前的所在的80~92级战区人数不足，已合并至92级以上战区，祝您游戏愉快！"/utf8>>;


get(325) ->
<<"王者之巅活动取消"/utf8>>;


get(326) ->
<<"因为本次活动参与人数少于30人，本次王者之巅活动取消，期待您的下次参与"/utf8>>;


get(327) ->
<<"全服竞拍奖励"/utf8>>;


get(328) ->
<<"亲爱的阴阳师，恭喜您所在的服务器阴阳师<color@4>{1}</color>成功拍得了<color@4>{2}</color>，特送来恭贺奖励，记得注意查收哟"/utf8>>;


get(329) ->
<<"王者之巅竞拍"/utf8>>;


get(330) ->
<<"亲爱的阴阳师：您参与竞拍物品<color@4>{1}</color>失败，其它阴阳师比你出价高，现将竞拍资金返还！"/utf8>>;


get(332) ->
<<"亲爱的阴阳师：恭喜您，成功获得拍卖物品<color@4>{1}</color>！"/utf8>>;


get(333) ->
<<"王者竞拍竞价被超"/utf8>>;


get(334) ->
<<"您在王者竞拍中的竞价被他人超过，快去加价反超吧！"/utf8>>;


get(335) ->
<<"【决斗场】积分排名结算"/utf8>>;


get(336) ->
<<"恭喜您在【决斗场】本周积分榜中获得<color@2>第{1}名</color>的好成绩，特为您献上丰厚的奖励，请注意查收！"/utf8>>;


get(337) ->
<<"【决斗场】积分阶段奖励"/utf8>>;


get(338) ->
<<"因您没有及时领取【决斗场】积分阶段奖励，现通过邮件补发，请注意查收！"/utf8>>;


get(339) ->
<<"活动报名奖励"/utf8>>;


get(340) ->
<<"<color@4>{1}</color>活动结束！这是您的报名奖励，请注意查收！"/utf8>>;


get(341) ->
<<"活动结算"/utf8>>;


get(342) ->
<<"<color@4>{1}</color>活动结束！由于您参与的时间较少，无法获得活动奖励，请下次准时参加哦！"/utf8>>;


get(28401) ->
<<"要塞占领战利品分红"/utf8>>;


get(28402) ->
<<"以下为您在本次异域夺宝中,要塞占领产出的拍卖品分红.请查收!
参与人数越多,要塞占领产出越丰富哦!快召集小伙伴们来一起参与吧~"/utf8>>;


get(28403) ->
<<"击杀怪物战利品分红"/utf8>>;


get(28404) ->
<<"以下为您在本次异域夺宝中击杀城堡和异域怪物产出的拍卖品分红.请查收!
击杀BOSS越多,拍卖品产出越丰厚哦!快召集小伙伴们来一起参与吧~"/utf8>>;


get(1020001) ->
<<"删档付费返还大礼"/utf8>>;


get(1020002) ->
<<"感谢您对我们游戏的支持和喜爱,由于您是我们删档封测元老用户,我们准备了丰厚的返还大礼回馈!您在删档测试期间充<color@0>{1}勾玉</color>,现给予您<color@0>{2}%</color>勾玉返还和<color@0>{3}%</color>绑定勾玉返还，敬请查收!"/utf8>>;


get(1020003) ->
<<"端午节高端玩家礼包"/utf8>>;


get(1020004) ->
<<"尊敬的阴阳师大人：
我们可以不知道粽子够不够香，也可以不知道菖蒲和艾叶够不够青翠，但是不可以不知道今年我们同您在游戏中的点点滴滴。这一年，您在游戏中累计充值超过了5000元，您带来的支持超过了90%的玩家。我们特此为您准备了节日特殊礼包，希望能让您看到我们的回应，并在今后继续带给您更好的游戏体验。"/utf8>>;


get(1020005) ->
<<"礼包卡兑换成功"/utf8>>;


get(1020006) ->
<<"我们非常高兴能为您奉上我们特别准备的游戏大礼包！希望您在我们的游戏中体验快乐，感受激情，挥洒热血！"/utf8>>;


get(1020007) ->
<<"活动奖励"/utf8>>;


get(1020008) ->
<<"亲爱的阴阳师：因为特殊原因导致无法及时发送奖励，现以通过邮件的形式补发。"/utf8>>;


get(1020009) ->
<<"礼包领取"/utf8>>;


get(1020010) ->
<<"您的礼包奖励已发送，请查收"/utf8>>;


get(1100001) ->
<<"5分钟内，世界发送聊天总条数超过33条，自动禁言{1}分钟"/utf8>>;


get(1100002) ->
<<"5分钟内，连续向超过3个不同充值玩家或者5个任意玩家，发起私聊，禁言{1}分钟"/utf8>>;


get(1130001) ->
<<"微端首次登录奖励"/utf8>>;


get(1130002) ->
<<"欢迎首次使用微端登录，请领取微端登录奖励"/utf8>>;


get(1300006) ->
<<"称号转换"/utf8>>;


get(1300007) ->
<<"亲爱的阴阳师，您的称号《{1}》由于变性变更为《{2}》，请您据悉"/utf8>>;


get(1320001) ->
<<"挂机奖励寻回"/utf8>>;


get(1320002) ->
<<"亲爱的阴阳师，我找到一个属于您的包裹，请您签收。
【PS：请记得及时清理您的背包哦^_^】"/utf8>>;


get(1320003) ->
<<"离线跨天额外奖励"/utf8>>;


get(1320004) ->
<<"尊敬的阴阳师，由于您的进度落后大部分阴阳师，特赠送您离线跨天额外奖励，增强实力！"/utf8>>;


get(1340001) ->
<<"境界功能改版补偿"/utf8>>;


get(1340002) ->
<<"境界功能全新版本上线.系统自动为你回收了旧物品,并补偿给您新的晋升道具!祝您游戏愉快!"/utf8>>;


get(1370001) ->
<<"勾玉大战参赛资格取消"/utf8>>;


get(1370002) ->
<<"亲爱的阴阳师，很抱歉地通知您，由于在勾玉大战开赛前期，您的战力跌出全战区前4096名，故此丧失比赛资格，现将门票退还给您，期待您日后有机会参赛！"/utf8>>;


get(1370003) ->
<<"勾玉大战取消"/utf8>>;


get(1370004) ->
<<"亲爱的阴阳师，我们很遗憾的通知您，由于本战区的报名人数未能达到勾玉大战的最低要求本次勾玉大战被迫取消。祝您游戏愉快！"/utf8>>;


get(1370005) ->
<<"勾玉大战竞猜"/utf8>>;


get(1370006) ->
<<"很遗憾，您在勾玉大战竞猜中差了一点运气并没有猜中"/utf8>>;


get(1370007) ->
<<"真是好运啊，您在勾玉大战竞猜中运气爆棚竞猜成功！获得了绑玉奖励"/utf8>>;


get(1370008) ->
<<"勾玉大战排名奖励"/utf8>>;


get(1370009) ->
<<"亲爱的阴阳师，您在勾玉大战中骁勇善战，势不可挡，成功夺得 跨服1~65级战区 第{1}名！本宝宝特意奉上排名奖励，敬请查收哦"/utf8>>;


get(1370010) ->
<<"亲爱的阴阳师，您在勾玉大战中骁勇善战，势不可挡，成功夺得 跨服66~75级战区 第{1}名！本宝宝特意奉上排名奖励，敬请查收哦"/utf8>>;


get(1370011) ->
<<"亲爱的阴阳师，您在勾玉大战中骁勇善战，势不可挡，成功夺得 跨服76~85级战区 第{1}名！本宝宝特意奉上排名奖励，敬请查收哦"/utf8>>;


get(1370012) ->
<<"亲爱的阴阳师，您在勾玉大战中骁勇善战，势不可挡，成功夺得 跨服86级以上战区 第{1}名！本宝宝特意奉上排名奖励，敬请查收哦"/utf8>>;


get(1370013) ->
<<"勾玉大战门票"/utf8>>;


get(1370014) ->
<<"亲爱的阴阳师，你今天豪气的充了一笔小钱。我们为您准备了一个勾玉大战的门票，记得参加哦！"/utf8>>;


get(1390001) ->
<<"圣裁补偿"/utf8>>;


get(1390002) ->
<<"亲爱的玩家，【人物】-【圣裁】中的异化利刃升级改成消耗[利刃精元]道具，根据玩家当前的经验值现补发等量的道具，请注意查收！"/utf8>>;


get(1500001) ->
<<"神装背包空间不足"/utf8>>;


get(1500002) ->
<<"由于您的背包空间不足，【{1}】剩余的物品将以邮件的形式发送给您，请尽快领取附件并整理背包！"/utf8>>;


get(1500003) ->
<<"奖励内容"/utf8>>;


get(1500004) ->
<<"由于您当前未成功领取奖励，【{1}】的物品将以邮件的形式发送给您，请尽快领取附件并整理背包！"/utf8>>;


get(1500005) ->
<<"影装背包空间不足"/utf8>>;


get(1500006) ->
<<"亲爱的玩家，因影装背包空间不足，获得的影装通过邮件发送，请及时领取附件（可通过【背包】-【影装】分解低阶影装防止空间不足哦！）"/utf8>>;


get(1500007) ->
<<"神祭合成失败返还"/utf8>>;


get(1500008) ->
<<"由于某些原因神祭合成失败，返还合成消耗的道具，请尽快领取附件并整理背包！"/utf8>>;


get(1500009) ->
<<"{1}背包空间不足"/utf8>>;


get(1500010) ->
<<"由于您的【{1}背包】中物品数量超过{2}件，已贴心地自动为你将{3}和蓝色及以下{4}装备分解为{5}强化资源,请知悉."/utf8>>;


get(1500011) ->
<<"由于您的【{1}背包】中物品数量超过{2}件，已贴心地自动为你将{3}和紫色及以下{4}装备分解为{5}强化资源,请知悉."/utf8>>;


get(1500012) ->
<<"由于您的【{1}背包】中物品数量超过{2}件，已贴心地自动为你将{3}分解为{4}强化资源,请知悉."/utf8>>;


get(1500013) ->
<<"消耗返还"/utf8>>;


get(1500014) ->
<<"由于某些特殊原因本次操作失败，将消耗资源返还给您，请注意查收！"/utf8>>;


get(1500015) ->
<<"自动熔炼通知"/utf8>>;


get(1500016) ->
<<"由于背包不足，这次邮件包含的紫色以及以下的装备已被自动熔炼~"/utf8>>;


get(1510001) ->
<<"求购成功"/utf8>>;


get(1510002) ->
<<"您在市场中成功求购获得{1}个{2}，请注意查收附件。"/utf8>>;


get(1510003) ->
<<"撤销求购"/utf8>>;


get(1510004) ->
<<"求购撤销成功，已全额返还保管费，请及时查收附件！"/utf8>>;


get(1510005) ->
<<"出售成功"/utf8>>;


get(1510006) ->
<<"您成功出售<color@{1}>[{2}]</color>x{3}，扣除{4}勾玉手续费后您获得{5}勾玉，请及时查收附件。"/utf8>>;


get(1510007) ->
<<"求购过期"/utf8>>;


get(1510008) ->
<<"你求购的{1}*{2}已过期，已全额返还保管费，请注意查收附件。"/utf8>>;


get(1510009) ->
<<"跨服市场开启通知"/utf8>>;


get(1510010) ->
<<"市场将于{1}天后开启跨服交易的功能，本服市场的所有上架物品将于开启当日0点全部下架，之后上架的商品将可以跨服交易"/utf8>>;


get(1520005) ->
<<"宝石卸下"/utf8>>;


get(1520006) ->
<<"亲爱的阴阳师，您的背包空间不足，请清理后领取已卸下的宝石。"/utf8>>;


get(1520007) ->
<<"由于共鸣系统优化，现返还您全部打造材料"/utf8>>;


get(1540001) ->
<<"竞拍成功"/utf8>>;


get(1540002) ->
<<"亲爱的阴阳师：恭喜您，成功获得拍卖物品{1}！"/utf8>>;


get(1540003) ->
<<"竞拍失败"/utf8>>;


get(1540004) ->
<<"亲爱的阴阳师：您参与竞拍物品{1}失败，其它人比你出价高，现将资金返还！"/utf8>>;


get(1540005) ->
<<"拍卖分红"/utf8>>;


get(1540006) ->
<<"亲爱的阴阳师：恭喜您，在{1}活动中获得拍卖物品分红!"/utf8>>;


get(1540007) ->
<<"亲爱的阴阳师：您参与竞拍物品{1}失败，其它人比你出价高，竞拍资金已返还到您的背包！"/utf8>>;


get(1540008) ->
<<"个人拍卖"/utf8>>;


get(1540009) ->
<<"亲爱的阴阳师：您的拍卖物{1}在本次拍卖中并没人看中，现将您的宝物归还给你，请查收！"/utf8>>;


get(1540010) ->
<<"亲爱的阴阳师：您的拍卖物{1}在拍卖会中被人购买了，现将您的所得给您，同时扣除了手续费哟！"/utf8>>;


get(1540011) ->
<<"归还拍卖物品"/utf8>>;


get(1540012) ->
<<"亲爱的阴阳师：恭喜您，成功获得拍卖物品{1}！(今日还剩{2}/{3})"/utf8>>;


get(1540013) ->
<<"亲爱的阴阳师：恭喜您，成功获得拍卖物品{1}！(本周还剩{2}/{3})"/utf8>>;


get(1550001) ->
<<"增加精力失败"/utf8>>;


get(1550002) ->
<<"由于您已被传出圣殿，因此来不及增加精力，现将消耗返还与您。"/utf8>>;


get(1600001) ->
<<"坐骑"/utf8>>;


get(1600002) ->
<<"侍魂"/utf8>>;


get(1600003) ->
<<"羽翼"/utf8>>;


get(1600004) ->
<<"御守"/utf8>>;


get(1600005) ->
<<"神兵"/utf8>>;


get(1600006) ->
<<"飞骑"/utf8>>;


get(1600007) ->
<<"法阵"/utf8>>;


get(1600012) ->
<<"背饰"/utf8>>;


get(1670001) ->
<<"御魂每日奖励"/utf8>>;


get(1670002) ->
<<"奉上您未领取的御魂副本每日奖励，层数越高，奖励越好哟！"/utf8>>;


get(1720001) ->
<<"新郎"/utf8>>;


get(1720002) ->
<<"新娘"/utf8>>;


get(1720003) ->
<<"婚礼取消通知"/utf8>>;


get(1720004) ->
<<"很抱歉，由于结婚双方未能及时入场，<color@1>{1}</color>和<color@1>{2}</color>的婚礼取消了。祝您游戏愉快！"/utf8>>;


get(1720005) ->
<<"结婚失败返还"/utf8>>;


get(1720006) ->
<<"结婚失败，费用返还"/utf8>>;


get(1720007) ->
<<"求婚成功奖励"/utf8>>;


get(1720008) ->
<<"亲爱的阴阳师，这是结婚的建立，请查收！"/utf8>>;


get(1720009) ->
<<"礼包奖励"/utf8>>;


get(1720010) ->
<<"亲爱的阴阳师，请查收真爱礼包的奖励返还"/utf8>>;


get(1720011) ->
<<"购买礼包失败"/utf8>>;


get(1720012) ->
<<"由于系统原因，购买礼包失败，购买的花费还原，请查收！"/utf8>>;


get(1720013) ->
<<"请求离婚"/utf8>>;


get(1720014) ->
<<"玩家{1}拒绝了你的离婚请求"/utf8>>;


get(1720015) ->
<<"{1}为宴会主人燃放了{2}!气氛值增加{3}"/utf8>>;


get(1720016) ->
<<"婚礼邀请"/utf8>>;


get(1720017) ->
<<"尊贵的阴阳师，{1}诚挚邀请您参加将于{2}月{3}日{4}时{5}分举行的婚礼宴会，记得准时参加别迟到哦~"/utf8>>;


get(1720018) ->
<<"结婚戒指返还"/utf8>>;


get(1720019) ->
<<"尊敬的阴阳师，因为您当前已经解锁结婚戒指功能，所消耗的{1}*{2}，已自动返还为{3}*{4}给您，注意查收哦~"/utf8>>;


get(1720020) ->
<<"婚礼预约邮件"/utf8>>;


get(1720021) ->
<<"阴阳师大人，恭喜您已成功预约{1}月{2}日{3}时{4}分的婚宴，记得准时参加哦~"/utf8>>;


get(1720023) ->
<<"阴阳师大人，您的好友{1}，将于{2}月{3}日{4}时{5}分举办婚礼，快去向他索要一份请帖并送上对TA的祝福吧~"/utf8>>;


get(1720024) ->
<<"阴阳师大人，您结社的{1}，将于{2}月{3}日{4}时{5}分举办婚礼，快去向他索要一份请帖并送上对TA的祝福吧~"/utf8>>;


get(1720025) ->
<<"离婚恩爱值道具返还"/utf8>>;


get(1720026) ->
<<"阴阳师大人，您已成功解除婚约，婚约期间的所累计的恩爱值现以按一定比例以道具方式返还给您，记得查收哟！"/utf8>>;


get(1770001) ->
<<"购买房子失败返还"/utf8>>;


get(1770002) ->
<<"由于服务器的原因，本次购买房子没能成功，这是您的花费，请查收！"/utf8>>;


get(1770003) ->
<<"购买房子失败返还"/utf8>>;


get(1770004) ->
<<"由于服务器的原因，本次购买房子没能成功，这是您的花费，请查收！"/utf8>>;


get(1770005) ->
<<"婚房平分购买通知"/utf8>>;


get(1770006) ->
<<"很遗憾，您的对象希望再考虑一下，这是您的花费，请查收！"/utf8>>;


get(1770007) ->
<<"婚房平分购买通知"/utf8>>;


get(1770008) ->
<<"很遗憾，您的对象希望再考虑一下，这是您的花费，请查收！"/utf8>>;


get(1770009) ->
<<"婚房规模升级通知"/utf8>>;


get(1770010) ->
<<"由于服务器的原因，本次房子规模升级没能成功，这是您的花费，请查收！"/utf8>>;


get(1770011) ->
<<"婚房规模平分升级通知"/utf8>>;


get(1770012) ->
<<"由于服务器的原因，本次房子规模升级没能成功，这是您的花费，请查收！"/utf8>>;


get(1770013) ->
<<"婚房规模平分升级通知"/utf8>>;


get(1770014) ->
<<"很遗憾，您的对象希望再考虑一下，这是您的花费，请查收！"/utf8>>;


get(1770015) ->
<<"婚房规模平分升级通知"/utf8>>;


get(1770016) ->
<<"很遗憾，您的对象希望再考虑一下，这是您的花费，请查收！"/utf8>>;


get(1770017) ->
<<"婚房通知"/utf8>>;


get(1770018) ->
<<"恭喜您找到了您的另一半，由于双方只有一人拥有家园，所以将用{1}的家园作为你们的婚房。祝您们生活愉快！"/utf8>>;


get(1770019) ->
<<"婚房通知"/utf8>>;


get(1770020) ->
<<"恭喜您找到了您的另一半，由于双方都拥有家园，所以将暂时用{1}的家园作为你们的婚房，你们可以重新选择。祝您们生活愉快！"/utf8>>;


get(1770021) ->
<<"家园变更通知"/utf8>>;


get(1770022) ->
<<"很遗憾你们的感情结束了。由于家园为婚后购置，所以将回收该家园，并返还双方婚姻期间消耗的资源。请查收！"/utf8>>;


get(1770023) ->
<<"家园变更通知"/utf8>>;


get(1770024) ->
<<"很遗憾你们的感情结束了。由于双方结婚时只有一人有家园，所以离婚后家园归{1}所有，返还双方婚姻期间消耗的资源。请查收！"/utf8>>;


get(1770025) ->
<<"家园变更通知"/utf8>>;


get(1770026) ->
<<"很遗憾你们的感情结束了。由于双方结婚时都拥有家园，所以离婚后家园回归到婚前状态，返还双方婚姻期间消耗的资源。请查收！"/utf8>>;


get(1770027) ->
<<"婚房选择通知"/utf8>>;


get(1770028) ->
<<"由于您超时未回复对方的请求，所以视为您同意他的选择。祝您游戏愉快！"/utf8>>;


get(1770029) ->
<<"送礼物失败返还"/utf8>>;


get(1770030) ->
<<"送礼物失败返还"/utf8>>;


get(1770031) ->
<<"合服家园处理通知"/utf8>>;


get(1770032) ->
<<"您好！由于合服后有多位玩家房子的小区和门牌号与您一样，现将资源返还给您，请查收！家具会为您保留，重新购置房子后可继续摆放哦！"/utf8>>;


get(1770033) ->
<<"平分请求取消通知"/utf8>>;


get(1770034) ->
<<"您好！由于合服后该房子已有主人，或有多位玩家房子的小区和门牌号与您一样，所以，平分购房或平分提升规模无法继续，现将资源返还给您，请查收！"/utf8>>;


get(1770035) ->
<<"合服婚房处理通知"/utf8>>;


get(1770036) ->
<<"您好！由于合服后有多位玩家房子的小区和门牌号与你们婚房的一样，现将另一间房子解锁且作为婚房。家具会为您保留，在新房子可继续摆放哦！"/utf8>>;


get(1770037) ->
<<"合服庭院返还"/utf8>>;


get(1770038) ->
<<"合服庭院返还"/utf8>>;


get(1770039) ->
<<"选房产出返还"/utf8>>;


get(1770040) ->
<<"选房产出返还"/utf8>>;


get(1770101) ->
<<"欢迎你来参观我的家！"/utf8>>;


get(1790001) ->
<<"特"/utf8>>;


get(1790002) ->
<<"一"/utf8>>;


get(1820001) ->
<<"点赞榜奖励"/utf8>>;


get(1820002) ->
<<"恭喜你在宝宝点赞榜中获得第{1}名,获得以下奖励,请查收！"/utf8>>;


get(1850001) ->
<<"掠夺水晶奖励"/utf8>>;


get(1850002) ->
<<"您参与掠夺的【{1}】已经严重受损，为您奉上您掠夺到的奖励，本次活动还可以获得【{2}】次掠夺奖励."/utf8>>;


get(1850003) ->
<<"水晶护送奖励"/utf8>>;


get(1850004) ->
<<"您参与的【{1}】的【{2}】已经成功抵达目的地，为您奉上您的护送奖励！"/utf8>>;


get(1850005) ->
<<"很遗憾，您护送的【{1}】已经【严重受损】，以下是您的的奖励，请接收。"/utf8>>;


get(1850006) ->
<<"水晶护送积分排行榜奖励"/utf8>>;


get(1850007) ->
<<"您所在的结社在本次水晶护送积分排行榜中，获得【第{1}名】的好成绩，为您奉上您的奖励，请再接再厉！"/utf8>>;


get(1850008) ->
<<"尊敬的阴阳师，海域霸主将本次海域霸主战的连胜奖励分配给了您，请继续为海域之王的荣耀而战！"/utf8>>;


get(1860001) ->
<<"四海争霸海域争霸战奖励"/utf8>>;


get(1860002) ->
<<"尊敬的阴阳师，恭喜您在本次海域争霸战夺得第{1}名，以下是您的排名奖励及参与奖励注意查收"/utf8>>;


get(1860003) ->
<<"四海争霸海王争夺战奖励"/utf8>>;


get(1860004) ->
<<"尊敬的阴阳师，恭喜您在本次海王争夺战夺得第{1}名，以下是您的排名奖励及参与奖励注意查收"/utf8>>;


get(1860005) ->
<<"海域霸主奖励"/utf8>>;


get(1860006) ->
<<"尊敬的阴阳师，恭喜你成功带领您所在的海域势力夺得了本次霸主战的霸主地位，以下是您的专属海王霸主奖励注意查收哟~"/utf8>>;


get(1860007) ->
<<"海域霸主连胜奖励"/utf8>>;


get(1860008) ->
<<"尊敬的阴阳师，海域霸主将本次海域霸主战的连胜奖励分配给了您，请继续为海域之王的荣耀而战！"/utf8>>;


get(1860009) ->
<<"海域争霸每日奖励"/utf8>>;


get(1860010) ->
<<"由于某些原因，您在领取每日奖励时掉线了，因此邮件补发，请注意查收！"/utf8>>;


get(1860011) ->
<<"四海争霸重置"/utf8>>;


get(1860012) ->
<<"尊敬的阴阳师，新一轮的四海争霸赛季已经正式开启，赛季重启时，将会重置各个海域的数据，各位阴阳师可重新选择一方势力加入争夺海域统治"/utf8>>;


get(1860013) ->
<<"四海争霸异常"/utf8>>;


get(1860014) ->
<<"尊敬的各位阴阳师，由于四海争霸异常导致部分玩家无法正常进入游戏，现通过邮件发放异常补偿奖励"/utf8>>;


get(1870001) ->
<<"搬砖排名结算"/utf8>>;


get(1870002) ->
<<"恭喜你在本海域搬砖排名第{1}，为表彰你作出的贡献特意奉上奖励，请继续努力！"/utf8>>;


get(1870003) ->
<<"恭喜你在全海域搬砖排名第{1}，为表彰你作出的贡献特意奉上奖励，请继续努力！"/utf8>>;


get(1890001) ->
<<"巡航奖励发放"/utf8>>;


get(1890002) ->
<<"亲爱的阴阳师,您有一份未及时领取的巡航奖励,现在以邮件形式为您补发,请注意及时领取~"/utf8>>;


get(1920001) ->
<<"活动托管"/utf8>>;


get(1920002) ->
<<"活动托管奖励"/utf8>>;


get(1920003) ->
<<"托管币换算绑玉"/utf8>>;


get(1920004) ->
<<"托管币换算绑玉获得{1}绑玉"/utf8>>;


get(1920005) ->
<<"九魂妖塔活动托管结束，托管时间{1}分钟，消耗托管值{2}点。"/utf8>>;


get(1920006) ->
<<"午间派对活动托管结束，托管时间{1}分钟，消耗托管值{2}点。"/utf8>>;


get(1920007) ->
<<"勾玉大战活动托管结束，托管时间{1}分钟，消耗托管值{2}点。"/utf8>>;


get(1920008) ->
<<"结社晚宴活动托管结束，托管时间{1}分钟，消耗托管值{2}点。活动消耗{3}勾玉、{4}绑玉。"/utf8>>;


get(1920009) ->
<<"巅峰竞技活动托管结束，托管时间{1}分钟，消耗托管值{2}点。活动消耗{3}勾玉、{4}绑玉。"/utf8>>;


get(1920010) ->
<<"异域夺宝活动托管结束，快去看看包里有什么极品装备吧！托管时间{1}分钟，消耗托管值{2}点。"/utf8>>;


get(1920011) ->
<<"尊神战场活动托管结束，托管时间{1}分钟，消耗托管值{2}点。"/utf8>>;


get(1920012) ->
<<"最强结社活动托管结束，托管时间{1}分钟，消耗托管值{2}点。"/utf8>>;


get(1940001) ->
<<"祭典赛季未领取奖励"/utf8>>;


get(1940002) ->
<<"以下为您的祭典赛季未领取奖励，请查收"/utf8>>;


get(2030001) ->
<<"神秘"/utf8>>;


get(2030002) ->
<<"传说"/utf8>>;


get(2040001) ->
<<"时空结界领地结算"/utf8>>;


get(2040002) ->
<<"尊敬的阴阳师，您当前所在服务器在本次活动中成功占领以下据点：社点{1}个、神社点{2}个、大社点{3}个、宫点{4}个、神宫点{5}个。以下是您的奖励记得注意查收哟~"/utf8>>;


get(2040003) ->
<<"时空结界排名奖励"/utf8>>;


get(2040004) ->
<<"尊敬的阴阳师，恭喜您在本次活动中排名第{1},以下是您的奖励内容记得注意查收哟~"/utf8>>;


get(2040005) ->
<<"时空结界每日目标奖励"/utf8>>;


get(2040006) ->
<<"尊敬的阴阳师，您有未领取的每日目标奖励，现已通过邮件补发记得查收哟~"/utf8>>;


get(2040007) ->
<<"时空结界赛季目标奖励"/utf8>>;


get(2040008) ->
<<"尊敬的阴阳师，您有未领取的本服赛季目标奖励，现已通过邮件补发记得查收哟~"/utf8>>;


get(2060001) ->
<<"百鬼夜行boss伤害排行奖励"/utf8>>;


get(2060002) ->
<<"恭喜您的队伍在百鬼夜行中击杀boss，伤害排名第{1}，奖励已发送到邮件附件中。"/utf8>>;


get(2060003) ->
<<"百鬼夜行boss尾刀奖励"/utf8>>;


get(2060004) ->
<<"恭喜您的队伍在百鬼夜行中最后一击击败boss，尾刀奖励已发送到邮件附件中。"/utf8>>;


get(2150000) ->
<<"源力副本"/utf8>>;


get(2150001) ->
<<"尊敬的冒险家，您有一份遗失的奖励待领取哦，敬请查收"/utf8>>;


get(2200001) ->
<<"开服冲榜"/utf8>>;


get(2200002) ->
<<"开服冲榜排行榜奖励"/utf8>>;


get(2200003) ->
<<"开服冲榜目标奖励"/utf8>>;


get(2210001) ->
<<"魅力周榜奖励"/utf8>>;


get(2210002) ->
<<"亲爱的阴阳师，您在魅力周榜中的名次达到<color@0>{1}</color>名，这是您的奖励，请查收！"/utf8>>;


get(2210005) ->
<<"魅力周榜结社奖励"/utf8>>;


get(2210006) ->
<<"亲爱的阴阳师，<color@1>{1}</color>魅力周榜中拿下第<color@0>1</color>名，这是其所属结社成员的奖励，请查收！"/utf8>>;


get(2210007) ->
<<"家园人气榜奖励"/utf8>>;


get(2210008) ->
<<"亲爱的阴阳师，您在家园人气榜中的名次达到<color@0>{1}</color>名，这是您的奖励，请查收！"/utf8>>;


get(2210009) ->
<<"助战激励"/utf8>>;


get(2210010) ->
<<"为了协助您更好提升战力，系统根据您的活跃表现给您送上补给，记得查收喔~"/utf8>>;


get(2240001) ->
<<"全民男神"/utf8>>;


get(2240002) ->
<<"全民女神"/utf8>>;


get(2250001) ->
<<"开服冲榜"/utf8>>;


get(2250002) ->
<<"尊敬的阴阳师，你有未领取的冲榜奖励内容，请注意查收哦！"/utf8>>;


get(2250003) ->
<<"尊敬的阴阳师，你有未领取的冲榜目标奖励内容，请注意查收哦！"/utf8>>;


get(2270001) ->
<<"循环冲榜：{1}排名奖励"/utf8>>;


get(2270002) ->
<<"恭喜您在<color@3>{1}</color>循环冲榜活动中获得第<color@3>{2}</color>名，这是您的奖励！"/utf8>>;


get(2270003) ->
<<"循环冲榜目标奖励"/utf8>>;


get(2270004) ->
<<"尊敬的阴阳师，在循环冲榜活动中，你有未领取的冲榜目标奖励内容，请注意查收哦！"/utf8>>;


get(2320001) ->
<<"合成资源返还"/utf8>>;


get(2320002) ->
<<"由于系统异常导致本次合成失败，现将合成资源返还，请及时领取！"/utf8>>;


get(2330001) ->
<<"神社奖励补发"/utf8>>;


get(2330002) ->
<<"亲爱的阴阳师，你在神祈提升橙色水晶后遗留了阶段奖励忘记领取，现通过邮件补发，请注意查收！"/utf8>>;


get(2790001) ->
<<"【天启之源】"/utf8>>;


get(2790002) ->
<<"您在天启之源中参与击杀{1}伤害排名第{2}，以下是您的奖励，请及时收取。"/utf8>>;


get(2810001) ->
<<"巅峰竞技赛季结算"/utf8>>;


get(2810002) ->
<<"您在本赛季的巅峰竞技中披荆斩棘,最终获得了第{1}名!特此奉上您本赛季的结算奖励,请再接再厉!"/utf8>>;


get(2810003) ->
<<"由于您本赛季匹配次数不足20次，无法获得赛季奖励"/utf8>>;


get(2830001) ->
<<"结社获得异域归属"/utf8>>;


get(2830002) ->
<<"恭喜您的结社{1}成功进入本服结社战力排名前3，获得{2}的归属。
拥有异域归属的结社中个人战力排名前十的成员可获得强力异域称号，不但是荣誉的象征更是战力的加持！加紧提升战力争取获得异域称号吧！<color@1><a@open_fun@88>前往查看</a></color>"/utf8>>;


get(2830003) ->
<<"异域称号失去通知"/utf8>>;


get(2830004) ->
<<"由于您在新一轮结社成员个人战力排名中排名第{1}（10名开外），所以失去了异域称号{2}。请再接再厉，争取再拿异域荣耀！（结社成员个人战力排名每间隔1小时刷新一次，前10成员可获得当前结社所占领的异域称号）<color@1><a@open_fun@88>查看详情</a></color>"/utf8>>;


get(2830005) ->
<<"恭喜获得异域称号"/utf8>>;


get(2830006) ->
<<"恭喜您在新一轮结社成员个人战力排名中排名第{1}，获得了异域称号{2}！（结社成员个人战力排名每间隔1小时刷新一次，前10成员可获得当前结社所占领的异域称号）<color@1><a@open_fun@88>查看详情</a></color>"/utf8>>;


get(2830007) ->
<<"由于您退出当前结社，导致您失去了在当前结社中拥有的异域称号{1}！"/utf8>>;


get(2830008) ->
<<"异域BOSS伤害MVP奖励"/utf8>>;


get(2830009) ->
<<"您在击杀异域BOSS的时候，对该BOSS造成伤害最高，特此奉上以下奖励！"/utf8>>;


get(2830010) ->
<<"参与击杀异域BOSS奖励"/utf8>>;


get(2830011) ->
<<"感谢您参与击杀异域BOSS，特此奉上参与奖励！
今天已经获得{1}次，还能获得{2}次。"/utf8>>;


get(2830012) ->
<<"由于您所在的结社失去异域归属权，所以失去了异域称号{1}。请再接再厉，争取异域荣耀！（每天23时，战力前三结社可获得异域归属）"/utf8>>;


get(2840001) ->
<<"怪物击杀战利品结算通知"/utf8>>;


get(2840002) ->
<<"由于您在本轮异域夺宝期间,贡献值低于{1},遗憾地失去了大妖击杀战利品的分红资格.下次继续努力!温馨提示:对怪物造成伤害或击杀其它阵营玩家可获得贡献值！"/utf8>>;


get(3310001) ->
<<"{1}{2}服的{3}"/utf8>>;


get(3310002) ->
<<"限时云购开奖通知"/utf8>>;


get(3310003) ->
<<"限时云购中奖通知"/utf8>>;


get(3310004) ->
<<"本期限时云购的中奖者是{1}， 恭喜您获得幸运女神的眷顾拿下大奖，爆棚的运气真是羡煞旁人！"/utf8>>;


get(3310005) ->
<<"本期限时云购的中奖者是{1}， 很遗憾您没有中奖，请再接再厉，也许下一位幸运之子就是您！"/utf8>>;


get(3310006) ->
<<"砸蛋累计奖励"/utf8>>;


get(3310007) ->
<<"亲您有一份快递未领取，请点击查收，下次请记得哦"/utf8>>;


get(3310008) ->
<<"砸蛋奖励"/utf8>>;


get(3310009) ->
<<"{1}活动奖励"/utf8>>;


get(3310010) ->
<<"由于您的背包空间不足，现将{1}活动的奖励以邮件方式发送给您。"/utf8>>;


get(3310011) ->
<<"您获得{1}的奖励如下："/utf8>>;


get(3310012) ->
<<"情定三世，完美恋人！"/utf8>>;


get(3310013) ->
<<"你与<color@1>{1}</color>的爱情感动天地，特在此奖励你们俩<color@3>“情定三世”称号</color>，在上苍的见证下继续幸福吧！"/utf8>>;


get(3310014) ->
<<"大妖首杀奖励"/utf8>>;


get(3310015) ->
<<"您的{1}首杀奖励忘记领取啦，请在附件查收。"/utf8>>;


get(3310016) ->
<<"全民狂欢活动奖励送还"/utf8>>;


get(3310017) ->
<<"你在全民狂欢活动中积极活跃的身姿成功引起了我的注意，但你浪完之后竟然忘记领取你的狂欢奖励，我只好派我的私家信使把它们给你送回来了，别再忘记领奖了，我的私家信使可不会每次都为你服务"/utf8>>;


get(3310018) ->
<<"{1}全服礼包"/utf8>>;


get(3310019) ->
<<"全服提交<a@goods@{1}></a>数量达到<color@0>{2}</color>，触发全服礼包，请在附件中查收奖励。"/utf8>>;


get(3310020) ->
<<"充值排行奖励"/utf8>>;


get(3310021) ->
<<"亲爱的阴阳师，恭喜您在充值排名活动中，腰缠万贯荣获充值排行榜获得第<color@5>{1}</color>名，万人膜拜，特给您送上排名奖励，敬请查收附件！"/utf8>>;


get(3310022) ->
<<"0元豪礼"/utf8>>;


get(3310023) ->
<<"亲爱的阴阳师，您有一份勾玉豪礼未领取，现通过邮件发放，请查收。"/utf8>>;


get(3310024) ->
<<"亲爱的阴阳师，您好，充值排行榜活动期间，恭喜您符合充值排行榜参与奖励条件，特为您奉上参与奖励，请查收附件，祝您游戏愉快！"/utf8>>;


get(3310025) ->
<<"跨服云购购买失败"/utf8>>;


get(3310026) ->
<<"亲爱的阴阳师，由于抢购的人数过多，您在跨服云购抢购的商品失败，现将本次抢购消耗的道具返还给您。"/utf8>>;


get(3310027) ->
<<"消费排行奖励"/utf8>>;


get(3310028) ->
<<"亲爱的阴阳师，恭喜您在消费排名活动中，腰缠万贯荣获充值排行榜获得第<color@5>{1}</color>名，万人膜拜，特给您送上排名奖励，敬请查收附件！"/utf8>>;


get(3310030) ->
<<"幸运翻牌奖励"/utf8>>;


get(3310031) ->
<<"亲爱的阴阳师，由于您的背包已满，现将您在幸运翻牌中获得的奖励通过邮件发送给您，请查收！"/utf8>>;


get(3310032) ->
<<"很遗憾本期云购无人中奖，请再接再厉，也许下一位幸运之子就是您！"/utf8>>;


get(3310033) ->
<<"最强结社活动结算"/utf8>>;


get(3310034) ->
<<"亲爱的阴阳师，恭喜你所在的{1}结社成为了本次活动的最强结社，真的是可喜可贺，特为你献上丰厚的奖励，请注意查收！"/utf8>>;


get(3310035) ->
<<"亲爱的阴阳师，很遗憾你所在的{1}结社在本次活动中未能夺得最强结社，请继续加油不要气馁，特为你献上丰厚的奖励，注意查收！"/utf8>>;


get(3310036) ->
<<"登录有礼奖励补发"/utf8>>;


get(3310037) ->
<<"亲爱的阴阳师，您在登录有礼活动中有尚未领取奖励，请查收"/utf8>>;


get(3310038) ->
<<"充值有礼奖励补发"/utf8>>;


get(3310039) ->
<<"亲爱的阴阳师，您在充值有礼活动中有尚未领取奖励，请查收"/utf8>>;


get(3310040) ->
<<"节日排行榜奖励"/utf8>>;


get(3310041) ->
<<"亲爱的阴阳师，您在节日消费排行榜活动中排行第{1},请查收奖励"/utf8>>;


get(3310042) ->
<<"许愿树奖励补发"/utf8>>;


get(3310043) ->
<<"亲爱的阴阳师，你在许愿树活动中遗留了奖励忘记领取，下次请记得领取噢~"/utf8>>;


get(3310044) ->
<<"限时云购开售通知"/utf8>>;


get(3310045) ->
<<"各位阴阳师，新的一批云购开启了，大家可以速速前往参与，手快有手慢无啊"/utf8>>;


get(3310046) ->
<<"跨服消费排行榜"/utf8>>;


get(3310047) ->
<<"亲爱的阴阳师，您在跨服消费排行榜活动中排行第{1}，这是您的奖励，请注意查收"/utf8>>;


get(3310048) ->
<<"坐骑转盘补发"/utf8>>;


get(3310049) ->
<<"亲爱的阴阳师，你在坐骑转盘中遗留了奖励忘记领取，下次请记得领取噢~"/utf8>>;


get(3310050) ->
<<"赛博夺宝奖励补发"/utf8>>;


get(3310051) ->
<<"亲爱的阴阳师，你在赛博夺宝活动中遗留了奖励忘记领取，下次请记得领取哦~"/utf8>>;


get(3310052) ->
<<"跨服节日消费排行榜"/utf8>>;


get(3310053) ->
<<"跨服节日消费排行榜参与奖励"/utf8>>;


get(3310055) ->
<<"惊喜扭蛋累计奖励"/utf8>>;


get(3310056) ->
<<"超级投资奖励补发"/utf8>>;


get(3310057) ->
<<"亲爱的阴阳师，你在超级投资活动中遗留了奖励忘记领取，下次请记得领取哦~"/utf8>>;


get(3310058) ->
<<"关注好礼领取"/utf8>>;


get(3310059) ->
<<"亲爱的阴阳师，感谢您关注了官方公众号。这是您的关注好礼，请查收"/utf8>>;


get(3310060) ->
<<"至尊探宝奖励发放"/utf8>>;


get(3310061) ->
<<"尊敬的阴阳师，您在至尊探宝活动中有未领取的累计奖励，现通过邮件发放给您，请您注意查收。感谢您对我们的支持，祝您游戏愉快~！"/utf8>>;


get(3310062) ->
<<"封测参与达成奖励"/utf8>>;


get(3310063) ->
<<"感谢御灵师参与删档封测，这是您在该次删档测试中获得的“封测参与数达成奖励”请注意查收，祝您公测游戏愉快，欢迎探索九州！"/utf8>>;


get(3310064) ->
<<"活动消耗资源返还"/utf8>>;


get(3310065) ->
<<"亲爱的阴阳师，由于异常原因，您在活动中抽奖失败，给您返还消耗的资源。"/utf8>>;


get(3310066) ->
<<"亲爱的阴阳师，您好，消费排行榜活动期间，恭喜您符合消费排行榜参与奖励条件，特为您奉上参与奖励，请查收附件，祝您游戏愉快！"/utf8>>;


get(3310067) ->
<<"超级投资奖励补发"/utf8>>;


get(3310068) ->
<<"亲爱的阴阳师，你在超级投资活动中遗留了奖励忘记领取，下次请记得领取哦~"/utf8>>;


get(3310069) ->
<<"首杀活动邮件"/utf8>>;


get(3310070) ->
<<"亲爱的阴阳师，恭喜您完成了首杀活动，客服将在7个工作日内联系您，感谢您对游戏的支持，祝您游戏愉快！"/utf8>>;


get(3310071) ->
<<"充值与消费榜第一奖励"/utf8>>;


get(3310072) ->
<<"亲爱的阴阳师，恭喜您充值榜与消费榜同时获得了第一，现在发放绝版称号：梦幻主宰，请您查收，感谢您对游戏的支持，祝您游戏愉快~！"/utf8>>;


get(3310073) ->
<<"未领取的活动抽奖券"/utf8>>;


get(3310074) ->
<<"亲爱的阴阳师，您没有及时领取的抽奖券现已发送给您，请查收!"/utf8>>;


get(3310075) ->
<<"消费排行奖励"/utf8>>;


get(3310076) ->
<<"由于众多壕无人性的大佬围追堵截，很遗憾您未能上榜，不过慈善基金会还是偷偷地为您准备一份安慰奖，祝您笑口常开！"/utf8>>;


get(3310077) ->
<<"累计消费补还"/utf8>>;


get(3310078) ->
<<"亲爱的阴阳师，由于累计消费奖励领取出现了意料之外的错误，导致奖励没有及时到账，现将奖励拱手奉上，给您造成不便，敬请原谅！"/utf8>>;


get(3310079) ->
<<"契约挑战活动"/utf8>>;


get(3310080) ->
<<"亲爱的阴阳师，由于您契约挑战有奖励未领取，现补发给您，请您查收！"/utf8>>;


get(3310081) ->
<<"小程序授权礼包"/utf8>>;


get(3310082) ->
<<"授权可获奖励，奖励通过邮件获得"/utf8>>;


get(3310083) ->
<<"xx"/utf8>>;


get(3310084) ->
<<"xx"/utf8>>;


get(3310085) ->
<<"xx"/utf8>>;


get(3310086) ->
<<"xx"/utf8>>;


get(3310087) ->
<<"{1}榜单奖励"/utf8>>;


get(3310088) ->
<<"恭喜您获得排行榜第{1}名，以下是您获得的排行榜奖励"/utf8>>;


get(3310089) ->
<<"删档测试充值返利"/utf8>>;


get(3310090) ->
<<"每次相遇都是久别重逢，欢迎再次进入神奈之里，感谢您在删档测试中对游戏的支持，根据记录，您在删档测试中的充值{1}勾玉，我们已为您准备好了相应勾玉返利，合计{2}勾玉。请查收。"/utf8>>;


get(3310091) ->
<<"$0 Giftpack"/utf8>>;


get(3310092) ->
<<"Dear, This is your $0 Giftpack. Please received it."/utf8>>;


get(3310093) ->
<<"特惠夺宝奖励"/utf8>>;


get(3310094) ->
<<"尊敬的阴阳师，这是您在特惠夺宝活动中未领取的奖励，请您查收"/utf8>>;


get(3310095) ->
<<"登录大礼包（第{1}天）"/utf8>>;


get(3310096) ->
<<"尊敬的阴阳师，谢谢您游玩我们的游戏，这是第{1}天的登录大礼包，请查收"/utf8>>;


get(3310097) ->
<<"超值儲値返利"/utf8>>;


get(3310098) ->
<<"親愛的阴阳师，這是您參與超值回饋活動活動的獎勵，請您注意查收！"/utf8>>;


get(3310099) ->
<<"连续充值"/utf8>>;


get(3310100) ->
<<"连续充值未领取奖励"/utf8>>;


get(3310101) ->
<<"等级弹窗"/utf8>>;


get(3310102) ->
<<"等级弹窗"/utf8>>;


get(3310103) ->
<<"累充奖励补发"/utf8>>;


get(3310104) ->
<<"亲爱的阴阳师，您在累充活动中有尚未领取的奖励，请查收~"/utf8>>;


get(3310105) ->
<<"{1}个人排名奖励"/utf8>>;


get(3310106) ->
<<"恭喜您在{1}中获得第{2}名，请查收奖励"/utf8>>;


get(3310107) ->
<<"{1}区服排名奖励"/utf8>>;


get(3310108) ->
<<"恭喜本服在{1}中获得第{2}名，请查收奖励"/utf8>>;


get(3310109) ->
<<"{1}积分奖励"/utf8>>;


get(3310110) ->
<<"您在{1}中有未领取的积分奖励，请查收奖励"/utf8>>;


get(3310111) ->
<<"登录预约奖励"/utf8>>;


get(3310112) ->
<<"恭喜您获得预约奖励"/utf8>>;


get(3310113) ->
<<"100级预约奖励"/utf8>>;


get(3310114) ->
<<"恭喜您获得100级预约奖励"/utf8>>;


get(3310115) ->
<<"累充有礼稀有奖励补发"/utf8>>;


get(3310116) ->
<<"亲爱的阴阳师，您在累充有礼活动中有尚未领取的稀有奖励，请查收~"/utf8>>;


get(3310117) ->
<<"公测限定称号奖励"/utf8>>;


get(3310118) ->
<<"尊敬的阴阳师，您好~感谢参与游戏公测，特为您送上公测限定称号，快来开始您的新旅程吧~"/utf8>>;


get(3310119) ->
<<"循环冲榜累充奖励补发"/utf8>>;


get(3310120) ->
<<"尊敬的阴阳师，您在循环冲榜的累充活动中有未领取的累充奖励，请查收~"/utf8>>;


get(3310121) ->
<<"循环冲榜单笔充值活动奖励补发"/utf8>>;


get(3310122) ->
<<"尊敬的阴阳师，您在循环冲榜的单笔充值活动中有未领取的累充奖励，请查收~"/utf8>>;


get(3310201) ->
<<"登录邮件测试1"/utf8>>;


get(3310202) ->
<<"登录邮件测试1通用全部奖励"/utf8>>;


get(3310203) ->
<<"登录邮件测试2"/utf8>>;


get(3310204) ->
<<"登录邮件测试2分性别奖励"/utf8>>;


get(3310205) ->
<<"登录邮件测试3"/utf8>>;


get(3310206) ->
<<"登录邮件测试3分世界等级奖励"/utf8>>;


get(3310207) ->
<<"限时累充活动补发"/utf8>>;


get(3310208) ->
<<"尊敬的御灵师，您在限时累充活动中有尚未领取的奖励，请查收~"/utf8>>;


get(3320001) ->
<<"神兵租借"/utf8>>;


get(3320002) ->
<<"提醒：您租借的神兵使用时间已结束。"/utf8>>;


get(3320003) ->
<<"封测充值返利"/utf8>>;


get(3320004) ->
<<"尊敬的御灵师，感谢您在游戏公测后重新回到我们的游戏中，这是您封测时参与封测充值返利活动的奖励。返利奖励将分为{1}天返还，今天是返还第{2}天。请您注意查收。感谢您对我们的支持，祝您游戏愉快！"/utf8>>;


get(3320005) ->
<<"{1}奖励"/utf8>>;


get(3320006) ->
<<"{1}奖励，请查收！"/utf8>>;


get(3320007) ->
<<"跨服团购"/utf8>>;


get(3320008) ->
<<"亲爱的阴阳师，由于您在跨服团购参团{1}件[{2}x{3}]后没及时交付尾款，现返还与订购价等额绑定勾玉给您，请您查收，感谢您对游戏的支持，祝您游戏愉!"/utf8>>;


get(3330001) ->
<<"嗨点活动"/utf8>>;


get(3380001) ->
<<"{1}排名奖励"/utf8>>;


get(3380002) ->
<<"恭喜您在{1}活动中排名第{2}，请查收奖励"/utf8>>;


get(3380003) ->
<<"竞榜额外奖励"/utf8>>;


get(3380004) ->
<<"您的妖灵为您在{1}竞榜中获得了额外的奖励，请注意查收！"/utf8>>;


get(3390001) ->
<<"vip红包过期"/utf8>>;


get(3390002) ->
<<"您在结社派送的VIP勾玉红包已过期，系统自动将红包剩余的勾玉进行返还！"/utf8>>;


get(3420001) ->
<<"绿茵竞猜单场奖励"/utf8>>;


get(3420002) ->
<<"恭喜您猜对了单场比赛{1}的结果，这是您的奖励！请收下吧！"/utf8>>;


get(3420003) ->
<<"绿茵竞猜冠军奖励"/utf8>>;


get(3420004) ->
<<"恭喜您猜对了最终冠军的归属，这是您的奖励！请收下吧！"/utf8>>;


get(3600001) ->
<<"伟大的神明啊，让我来为您恢复那流逝的生命吧！"/utf8>>;


get(3600002) ->
<<"神明啊，请让我成为您的力量，击败这傲慢无知的人类！"/utf8>>;


get(3600003) ->
<<"发现异常，即将进行封印!"/utf8>>;


get(3601001) ->
<<"妖鬼万物，响应那位大人的召唤吧！"/utf8>>;


get(3601002) ->
<<"信者永生……"/utf8>>;


get(4000001) ->
<<"职位变动"/utf8>>;


get(4000002) ->
<<"最新消息，您在结社的职位变成了{1}，祝您游戏愉快。"/utf8>>;


get(4000003) ->
<<"欢迎你加入结社！每日完成结社任务打大妖拿装备；多余装备捐仓库，积分换装备；与结社成员组团打大妖，保障又高效！"/utf8>>;


get(4000004) ->
<<"结社管家"/utf8>>;


get(4000005) ->
<<"最新结社公告"/utf8>>;


get(4000006) ->
<<"欢迎加入结社"/utf8>>;


get(4000007) ->
<<"欢迎来到{1}这个大家庭，今后的日子大家一同为结社的未来奋斗吧！"/utf8>>;


get(4000008) ->
<<"结社职位任命通知"/utf8>>;


get(4000009) ->
<<"您已成为结社{1}的会长，希望你能带领所有成员共创结社辉煌"/utf8>>;


get(4000010) ->
<<"{1}将结社{2}的会长之职转让于你希望你能带领所有成员共创结社辉煌"/utf8>>;


get(4000011) ->
<<"结社升级了"/utf8>>;


get(4000012) ->
<<"可喜可贺！在结社所有成员的努力下，结社已经达到{1}级！结社成员上限达到{2}个，解锁结社技能{3}！"/utf8>>;


get(4000013) ->
<<"您被踢出结社了"/utf8>>;


get(4000014) ->
<<"很抱歉，您被踢出结社了，您的结社技能依旧保留现有等级，祝您早日找到更好的归属！"/utf8>>;


get(4000015) ->
<<"结社解散了"/utf8>>;


get(4000016) ->
<<"很抱歉，由于结社活所有成员均离线超过48小时，无人打理，被结社管理中心强制解散。祝您早日找到更好的归属！"/utf8>>;


get(4000017) ->
<<"很抱歉，由于结社人数少于5人，被结社管理中心强制解散了，祝您早日找到更好的归属！"/utf8>>;


get(4000018) ->
<<"结社改名通知"/utf8>>;


get(4000019) ->
<<"您的结社已经改名为{1}"/utf8>>;


get(4000020) ->
<<"结社公告修改"/utf8>>;


get(4000021) ->
<<"很抱歉，因本结社的公告内容不符合相关规定，已被结社管理中心强制修改，请勿发布违规内容，祝您游戏愉快"/utf8>>;


get(4000022) ->
<<"很抱歉，由于本结社涉嫌进行违规行为，被结社管理中心强制解散了，祝您早日找到更好的归属！"/utf8>>;


get(4000023) ->
<<"警告!结社人数不足"/utf8>>;


get(4000024) ->
<<"结社人数不足5人，将在即刻起24小时之后自动解散，请尽快招募成员！"/utf8>>;


get(4000025) ->
<<"恭喜！结社人数达标！"/utf8>>;


get(4000026) ->
<<"恭喜！结社成员人数已达到5人，结社已从自动解散流程中恢复，请继续享受您的冒险旅程吧！"/utf8>>;


get(4000027) ->
<<"很抱歉，因本结社的名字不符合相关规定，已被结社管理中心强制修改，请勿起违规名称，和谐游戏"/utf8>>;


get(4000028) ->
<<"结社头衔变更"/utf8>>;


get(4000029) ->
<<"亲爱的玩家，你上一周所得善缘为{1}未达到{2}点,结社头衔自动降为{3}"/utf8>>;


get(4000030) ->
<<"结社合并"/utf8>>;


get(4000031) ->
<<"【{1}】将于【{2}】加入本结社，让我们欢迎他们的到来"/utf8>>;


get(4000032) ->
<<"本结社将于【{1}】加入【{2}】"/utf8>>;


get(4000033) ->
<<"【{1}】会长拒绝了您的结社合并请求"/utf8>>;


get(4000034) ->
<<"合并结社结束，【{1}】已经成功并入本结社"/utf8>>;


get(4000035) ->
<<"欢迎加入【{1}】结社"/utf8>>;


get(4020001) ->
<<"召唤BOSS奖励"/utf8>>;


get(4020002) ->
<<"以下是您在结社晚宴中使用召唤卡召唤BOSS获得的专属奖励，请及时领取。"/utf8>>;


get(4020003) ->
<<"{1}奖励"/utf8>>;


get(4020004) ->
<<"您在本次结社活动获得了第{1}名，特此奉上奖励~"/utf8>>;


get(4140001) ->
<<"呜海遗珠累积采集{1}次奖励"/utf8>>;


get(4140002) ->
<<"恭喜您在呜海遗珠中达成了累积采集{1}次奖励，请查收！"/utf8>>;


get(4160001) ->
<<"宝宝寻宝"/utf8>>;


get(4160002) ->
<<"装备/巅峰寻宝资源返还"/utf8>>;


get(4160003) ->
<<"亲爱的阴阳师，由于异常原因，您在装备/巅峰寻宝中寻宝失败，给您返还寻宝资源如下。"/utf8>>;


get(4170001) ->
<<"每日签到累计奖励"/utf8>>;


get(4170002) ->
<<"为您找回了一些在上一个签到周期中未领取的累计签到奖励~"/utf8>>;


get(4170003) ->
<<"1st Monthiversary"/utf8>>;


get(4170004) ->
<<"Here are the rewards to celebrate the 1st Monthiversary of Starlight Isle. Your support is much appreciated! For more benefits and events, keep track of our Facebook page!"/utf8>>;


get(4200001) ->
<<"月卡每日奖励"/utf8>>;


get(4200002) ->
<<"亲爱的阴阳师，您当前共有{1}天的月卡每日奖励未领取，现一次补发给您，请注意查收！"/utf8>>;


get(4260001) ->
<<"合服角色名重复冲突"/utf8>>;


get(4260002) ->
<<"尊敬的阴阳师大人，由于合服后您的角色名有冲突，已系统为您修改名字，特为您献上一张改名卡，可以自行重新修改角色名。"/utf8>>;


get(4370001) ->
<<"海域争霸战斗奖励"/utf8>>;


get(4370002) ->
<<"基于您与结社战友们在海域争霸战中的骁勇表现，特颁发如下奖励，以资鼓励"/utf8>>;


get(4370003) ->
<<"宣战成功通知"/utf8>>;


get(4370004) ->
<<"您所在结社发起的海域争霸宣战成功，获得进攻对应海域的资格，战斗将在21:30正式开始，为了领海而战！"/utf8>>;


get(4370005) ->
<<"宣战失败通知"/utf8>>;


get(4370006) ->
<<"您所在结社发起的宣战由于出价低于其他结社，遗憾落选本次进攻资格，出价资金已原数返还，特此告知，期待下次海域争霸得见贵结社的英姿！"/utf8>>;


get(4370007) ->
<<"海域争霸赛季奖励"/utf8>>;


get(4370008) ->
<<"您所在结社在本季海域争霸中一展雄风、威名远扬，作为结社的一份子，特发放赛季奖励以资鼓励，下个赛季海上再见！"/utf8>>;


get(4370009) ->
<<"宣战竞价提醒"/utf8>>;


get(4370010) ->
<<"亲爱的会长大人，您在海域争霸中的宣战出价被其他结社超越，当前出价排名无法获得该据点的进攻资格，请注意及时提高出价！"/utf8>>;


get(4500001) ->
<<"vip专享礼包重置说明"/utf8>>;


get(4500002) ->
<<"尊敬的阴阳师，本次更新对vip专享礼包奖励（vip界面-特权福利）进行了优化调整。系统检测到您已购买vip专享礼包，为方便您可以获取心仪的奖励，系统已对您的礼包购买状态进行重置，祝您游戏愉快~"/utf8>>;


get(4520001) ->
<<"周卡礼包刷新"/utf8>>;


get(4520002) ->
<<"您当天的周卡礼包可领取数量已刷新，未领取的礼包已通过邮件发送，请查收。"/utf8>>;


get(4520003) ->
<<"培养线回退说明"/utf8>>;


get(4520004) ->
<<"尊敬的玩家您好，由于上个版本更新后周卡礼包结算机制出现了恶性bug，系统检测到您获得了超额的周卡礼包。为保证游戏公平性，现已将您版本更新后对培养线的部分提升进行回退处理，如有不便之处敬请谅解。"/utf8>>;


get(4600001) ->
<<"世界boss排名奖励"/utf8>>;


get(4600002) ->
<<"亲爱的阴阳师，您在世界boss{1}击杀活动中伤害第{2}，我们为您准备了丰厚的奖励，记得查收哦~"/utf8>>;


get(4600003) ->
<<"最后一击奖励"/utf8>>;


get(4600004) ->
<<"亲爱的阴阳师，您在世界boss{1}击杀活动中成功夺得最后一击奖励，请注意查收哦~"/utf8>>;


get(4600005) ->
<<"背包已满"/utf8>>;


get(4600006) ->
<<"请及时处理背包，以下是您在秘境BOSS中获得的神装，请及时查收附件。"/utf8>>;


get(4600007) ->
<<"背包已满"/utf8>>;


get(4600008) ->
<<"请及时处理背包，以下是您在蛮荒BOSS中获得的神装，请及时查收附件。"/utf8>>;


get(4600009) ->
<<"秘境BOSS阶段奖励"/utf8>>;


get(4600010) ->
<<"亲爱的阴阳师大人! 发现了一份您忘记领取的秘境BOSS阶段奖励,请注意查收,下次记得领取奖励哦!"/utf8>>;


get(4700001) ->
<<"悬赏击杀榜结算奖励"/utf8>>;


get(4700002) ->
<<"您在上一期的悬赏击杀榜中排名第{1}名.为了表彰您作出的杰出贡献,特此奉上奖励!(只有前20名才有奖励哦~)
如果有称号奖励,将为你自动激活!"/utf8>>;


get(4700003) ->
<<"悬赏BOSS榜结算奖励"/utf8>>;


get(4700004) ->
<<"您在上一期的悬赏BOSS榜中排名第{1}名.为了表彰您作出的杰出贡献,特此奉上奖励!(只有前20名才有奖励哦~)
如果有称号奖励,将为你自动激活!"/utf8>>;


get(4700005) ->
<<"悬赏总积分榜结算奖励"/utf8>>;


get(4700006) ->
<<"您在上一期的悬赏总积分榜中排名第{1}名.为了表彰您作出的杰出贡献,特此奉上奖励!(只有前20名才有奖励哦~)
如果有称号奖励,将为你自动激活!"/utf8>>;


get(4710001) ->
<<"怨灵封印归属奖励"/utf8>>;


get(4710002) ->
<<"恭喜你在怨灵封印活动中成功获得boss归属，以下是您的奖励内容，请注意查收哦~"/utf8>>;


get(4710003) ->
<<"怨灵封印参与奖励"/utf8>>;


get(4710004) ->
<<"怨灵封印活动已正式结束，以下是您的参与奖励内容，请注意查收哦~"/utf8>>;


get(4710005) ->
<<"面具"/utf8>>;


get(4710006) ->
<<"嵌玉"/utf8>>;


get(4710007) ->
<<"腰坠"/utf8>>;


get(4710008) ->
<<"耳饰"/utf8>>;


get(4710009) ->
<<"符石"/utf8>>;


get(4710010) ->
<<"纹印"/utf8>>;


get(5050001) ->
<<"霸主奖励"/utf8>>;


get(5050002) ->
<<"尊敬的会长大人，在本次最强结社战中，您所在的结社成功夺得本次争霸战的霸主地位，祝贺您！以下是您的专属奖励，请查收！"/utf8>>;


get(5050003) ->
<<"连胜终结奖励"/utf8>>;


get(5050004) ->
<<"尊敬的阴阳师，在本次最强结社战中，你的杰出表现获得了结社会长的认可特将本次结社连胜终结奖励赐予你，以兹鼓励，望继续努力哟~以下是您的奖励，请查收"/utf8>>;


get(5050005) ->
<<"终结奖励分配结果"/utf8>>;


get(5050006) ->
<<"尊敬的阴阳师，恭喜您所在的结社成功终止了{1}结社的{2}连胜，为鼓励各位成员本次连胜终结奖励被会长赠与了{3}玩家，各位勇士继续努力哟~"/utf8>>;


get(5050007) ->
<<"争霸战连胜奖励"/utf8>>;


get(5050008) ->
<<"尊敬的阴阳师，在本次最强结社战中，你的杰出表现获得了结社会长的认可特将本次结社连胜奖励赐予你，以兹鼓励，望继续努力哟~以下是您的奖励，请查收"/utf8>>;


get(5050009) ->
<<"争霸战奖励分配结果"/utf8>>;


get(5050010) ->
<<"尊敬的阴阳师，恭喜您所在的结社获得{1}连胜，为鼓励各位成员本次连胜奖励被会长赠与了{2}玩家，各位勇士继续努力哟~"/utf8>>;


get(5050011) ->
<<"争霸战个人排名奖励"/utf8>>;


get(5050012) ->
<<"尊敬的阴阳师，在本次最强结社战中，你的表现位列第{1}名。祝您在下一次的争霸战中能更上一层楼！以下是您的奖励，请查收"/utf8>>;


get(5050013) ->
<<"争霸战个人积分奖励"/utf8>>;


get(5050014) ->
<<"尊敬的阴阳师，在最强结社战中，你英勇奋战，所得积分自动兑换，奖励如下，请查收。"/utf8>>;


get(5050015) ->
<<"结社战buff"/utf8>>;


get(5050016) ->
<<"尊敬的阴阳师，由于您所在的结社失去争霸战的霸主地位，会长专属的BUFF奖励已被回收"/utf8>>;


get(5060001) ->
<<"霸主奖励"/utf8>>;


get(5060002) ->
<<"尊敬的会长大人，在本次结社领地战中，您所在的结社成功占领本次领地战的巅峰王城，祝贺您！以下是您的专属奖励，请查收！"/utf8>>;


get(5060003) ->
<<"连胜终结奖励"/utf8>>;


get(5060004) ->
<<"尊敬的阴阳师，在本次结社领地战中，你的杰出表现获得了结社会长的认可特将本次结社连胜终结奖励赐予你，以兹鼓励，望继续努力哟~以下是您的奖励，请查收"/utf8>>;


get(5060005) ->
<<"终结奖励分配结果"/utf8>>;


get(5060006) ->
<<"尊敬的阴阳师，恭喜您所在的结社成功终止了{1}结社的{2}连胜，为鼓励各位成员本次连胜终结奖励被会长赠与了{3}玩家，各位勇士继续努力哟~"/utf8>>;


get(5060007) ->
<<"领地战连胜奖励"/utf8>>;


get(5060008) ->
<<"尊敬的冒险家，在本次结社领地战中，你的杰出表现获得了结社会长的认可特将本次结社连胜奖励赐予你，以兹鼓励，望继续努力哟~以下是您的奖励，请查收"/utf8>>;


get(5060009) ->
<<"争霸战奖励分配结果"/utf8>>;


get(5060010) ->
<<"尊敬的阴阳师，恭喜您所在的结社获得{1}连胜，为鼓励各位成员本次连胜奖励被会长赠与了{2}玩家，各位勇士继续努力哟~"/utf8>>;


get(5060011) ->
<<"领地对战奖励"/utf8>>;


get(5060012) ->
<<"尊敬的阴阳师，恭喜你所在的结社{1}领地争夺中，成功击败了{2}结社，以下是您的奖励，记得查收哟~"/utf8>>;


get(5060013) ->
<<"尊敬的阴阳师，很遗憾在{1}领地争夺中，您的结社为未能击败{2}结社，以下是您的奖励，记得查收哟~"/utf8>>;


get(5060014) ->
<<"结社领地战"/utf8>>;


get(5060015) ->
<<"尊敬的阴阳师，恭喜您所在的结社成功获得结社领地战的争夺权利，各位会长可以对心仪的领地进行宣战了，正式领地战将于今晚{1}正式开启，记得准时入场参战哦~"/utf8>>;


get(5060016) ->
<<"结社领地buff"/utf8>>;


get(5060017) ->
<<"尊敬的阴阳师，由于您所在的结社失去争霸战的霸主地位，会长专属的BUFF奖励已被回收"/utf8>>;


get(5060018) ->
<<"尊敬的阴阳师，恭喜你所在的结社{1}领地争夺中获胜，以下是您的奖励，记得查收哟~"/utf8>>;


get(5070001) ->
<<"神王试炼擂主奖励"/utf8>>;


get(5070002) ->
<<"因为您在神王试炼中的优异表现,成为了第{1}层的擂主,神王赐予了您以下奖励,请再接再厉!"/utf8>>;


get(5080001) ->
<<"周本排行奖励"/utf8>>;


get(5080002) ->
<<"在{1}副本获得第{2}名，请查收奖励！"/utf8>>;


get(5120001) ->
<<"跨服云购大奖"/utf8>>;


get(5120002) ->
<<"亲爱的阴阳师，恭喜您在跨服云购活动中喜中大奖，以下是您的奖励请注意查收"/utf8>>;


get(5120003) ->
<<"跨服云购阶段奖励"/utf8>>;


get(5120004) ->
<<"尊敬的冒险家，您本次的跨服云购有未领取的云购礼盒忘记领了哦，这是您的奖励，记得注意查收哟！"/utf8>>;


get(5140001) ->
<<"主角光环奖励"/utf8>>;


get(5140002) ->
<<"尊敬的阴阳师您好，由于您之前主角光环存在已激活奖励未领取，系统通过邮件为你补发奖励。请您查收，祝您游戏愉快"/utf8>>;


get(6000001) ->
<<"虚空秘境奖励"/utf8>>;


get(6010001) ->
<<"跨服服战约战通知"/utf8>>;


get(6010002) ->
<<"您已被选为本服的约战人，有资格代表本服去和其他服约战，不要辜负这份荣耀，带着你的盟友去闹个天翻地覆吧！"/utf8>>;


get(6010003) ->
<<"跨服服战入选通知"/utf8>>;


get(6010004) ->
<<"您已成功入选本次跨服服战，服战第一轮于21:00举行，第二轮于21:25举行，请准时入场！"/utf8>>;


get(6010005) ->
<<"跨服服战落选通知"/utf8>>;


get(6010006) ->
<<"由于参赛名额有限，您遗憾落选本届服战，请继续努力升战，期待下次服战有你的身影！"/utf8>>;


get(6010007) ->
<<"跨服服战战斗奖励"/utf8>>;


get(6010008) ->
<<"基于您在跨服服战中骁勇的表现，帝国特颁发如下奖励，以资鼓励"/utf8>>;


get(6010009) ->
<<"跨服服战赛季奖励"/utf8>>;


get(6010010) ->
<<"您所在的服务器在本赛季服战中威名远播，作为服内的的一份子，特颁发赛季奖励以资鼓励"/utf8>>;


get(6010011) ->
<<"约战失败"/utf8>>;


get(6010012) ->
<<"您之前代表本服约战的对手—{1}，被他人截胡约走，已返还本次约战消耗的积分，请尽快再度约战对手！"/utf8>>;


get(6010013) ->
<<"跨服服战正式打响！"/utf8>>;


get(6010014) ->
<<"本服已开启参加跨服服战的入口，每周日晚21:00~21:45，在跨服服战中与本服其他勇士一起浴血奋战，击败其他服的对手，勇夺第一服宝座吧！详情请在【世界服】--【跨服服战】界面查看"/utf8>>;


get(6020001) ->
<<"三军之战积分目标奖励"/utf8>>;


get(6020002) ->
<<"您的背包已满，故特将三军之战积分目标奖励发送给您，请查收！"/utf8>>;


get(6020003) ->
<<"三军之战排名奖励"/utf8>>;


get(6020004) ->
<<"您的背包已满，故特将三军之战排名奖励发送给您，请查收！"/utf8>>;


get(6040001) ->
<<"星钻联赛参赛资格取消"/utf8>>;


get(6040002) ->
<<"亲爱的阴阳师，我们很遗憾的通知您，在星钻联赛报名结束时，您的战力不小心跌出了跨服前512名，丧失了参赛资格，现将门票退还给您，期待您的下次参与"/utf8>>;


get(6040003) ->
<<"星钻联赛取消"/utf8>>;


get(6040004) ->
<<"亲爱的阴阳师，我们很遗憾的通知您，由于本届的报名人数未能达到星钻联赛的最低要求，联赛被迫取消，现将门票退还给您。祝您游戏愉快！"/utf8>>;


get(6040005) ->
<<"“星钻联赛”淘汰奖励"/utf8>>;


get(6040006) ->
<<"您在【{1}】因未入场而被淘汰，特将奖励发放给你，下次千万不要擅自离场啊！"/utf8>>;


get(6040007) ->
<<"“星钻联赛”竞猜奖励发放"/utf8>>;


get(6040008) ->
<<"我们的工作人员在打扫场地的时候发现了您在“星钻联赛”中斩获但未带走的竞猜奖励，将其送回，大侠下次记得领取奖励"/utf8>>;


get(6060001) ->
<<"圣灵幻形到期通知"/utf8>>;


get(6060002) ->
<<"亲爱的阴阳师，您的圣灵幻形{1}因为时间到期，已恢复未激活状态，请您据悉！"/utf8>>;


get(6100001) ->
<<"亲爱的玩家：您在{1}获得以下物品尚未拾取，暂时以邮件形式保存！"/utf8>>;


get(6100002) ->
<<"守护礼包"/utf8>>;


get(6100003) ->
<<"守护礼包每日0点刷新，以下是您未领取的礼包奖励，请及时领取附件。"/utf8>>;


get(6100004) ->
<<"异域夺宝伤害排名结算"/utf8>>;


get(6100005) ->
<<"恭喜您在异域夺宝活动中对怪物造成伤害排第{1}名，特为您奉上丰厚的奖励，请注意查收"/utf8>>;


get(6100006) ->
<<"神纹副本掉落奖励"/utf8>>;


get(6100007) ->
<<"您当前的队伍战力已满足{1}波数通关要求，自动为您跳过相应波数，相关怪物击杀奖励以通过邮件发放，注意查收哦~"/utf8>>;


get(6100008) ->
<<"妖灵副本首通奖励更新"/utf8>>;


get(6100009) ->
<<"亲爱的阴阳师：妖灵副本的首通奖励现在更新啦！由于您之前已经通关部分妖灵副本，现将相关首通奖励通过邮件发送给您，请及时领取附件！"/utf8>>;


get(6100010) ->
<<"装备副本补偿"/utf8>>;


get(6100011) ->
<<"善良的村民发现了您今日的装备副本掉落,特在此物归原主,奖励可能会迟到,但从不缺席!"/utf8>>;


get(6103601) ->
<<"3.5秒后让我们同归于尽吧！"/utf8>>;


get(6103602) ->
<<"我即将为女王大人增加攻击！"/utf8>>;


get(6103603) ->
<<"我即将为女王大人恢复血量！"/utf8>>;


get(6103604) ->
<<"7秒后全屏伤害（临时提示语）"/utf8>>;


get(6103605) ->
<<"{1}关卡大奖补发"/utf8>>;


get(6103606) ->
<<"亲爱的阴阳师：您在{1}中未领取的关卡大奖未领取，现将您的宝物归还给你，请查收！"/utf8>>;


get(6103699) ->
<<"循环测试！！！"/utf8>>;


get(6210001) ->
<<"最强王者守擂赛"/utf8>>;


get(6210002) ->
<<"恭喜您在最强王者资格赛中以第{1}名的惊艳成绩毫无压力的成为下一轮的[守擂者]！请准时参加！"/utf8>>;


get(6210003) ->
<<"恭喜您在最强王者资格赛中取得第{1}名的优异成绩！您将以[挑战者身份]参与守擂赛阶段，请准时参加！"/utf8>>;


get(6210004) ->
<<"跨服1V{1}结算奖励"/utf8>>;


get(6210005) ->
<<"恭喜您成功通过1V{1}，以下是您获得的奖励，请及时领取附件。"/utf8>>;


get(6210006) ->
<<"很遗憾您未能成功通过1V{1},以下是您获得的奖励，请及时领取附件。"/utf8>>;


get(6210007) ->
<<"跨服1V{1}挑战者胜利奖励"/utf8>>;


get(6210008) ->
<<"恭喜你在跨服1V{1}擂台赛中作为挑战者成功战胜擂主，以下是您获得的奖励，请及时领取附件。"/utf8>>;


get(6210009) ->
<<"跨服1V{1}挑战者失败奖励"/utf8>>;


get(6210010) ->
<<"很遗憾，你在跨服1V{1}擂台赛中作为挑战者未能成功战胜擂主，以下是您获得的奖励，请及时领取附件。"/utf8>>;


get(6210011) ->
<<"1VN竞猜奖励"/utf8>>;


get(6210012) ->
<<"最强王者即将开启，以下是您上一届未领取的奖励，请及时领取。"/utf8>>;


get(6210013) ->
<<"最强王者活动取消"/utf8>>;


get(6210014) ->
<<"因为本次活动参与人数少于{1}人，本次最强王者活动取消，期待您的下次参与"/utf8>>;


get(6500001) ->
<<"跨服3V3赛季奖励"/utf8>>;


get(6500002) ->
<<"恭喜您在跨服3V3赛季排行中获得第<color@0>{1}</color>名，请在附件中查收奖励。"/utf8>>;


get(6500003) ->
<<"跨服3V3结算奖励"/utf8>>;


get(6500004) ->
<<"您在3V3比赛结算时不在线，您的队伍在这局比赛中<color@0>胜利</color>了，请在附件中查收奖励。"/utf8>>;


get(6500005) ->
<<"跨服3V3结算奖励"/utf8>>;


get(6500006) ->
<<"您在3V3比赛结算时不在线，您的队伍在这句比赛中<color@4>失败</color>了，请在附件中查收奖励。"/utf8>>;


get(6500007) ->
<<"尊敬的，冒险家本次跨服3v3比赛已经结算了，以下是您本赛季的奖励内容，请注意查收哦~"/utf8>>;


get(6500008) ->
<<"很遗憾，您被踢出{1}战队，重新加入战队后方可继续3v3征程，祝您早日找到更好的归属！"/utf8>>;


get(6500009) ->
<<"3v3战队"/utf8>>;


get(6500010) ->
<<"您已被玩家{1}任命为{2}战队的会长，希望你能带领所有队员走向最终的冠军王座"/utf8>>;


get(6500011) ->
<<"3v3冠军赛"/utf8>>;


get(6500012) ->
<<"尊敬的阴阳师，恭贺您所在的战队成功成为本赛季3v3冠军赛的{1}，以下是您的战队专属奖励，请注意查收哦~"/utf8>>;


get(6500013) ->
<<"{1}赛轮空"/utf8>>;


get(6500014) ->
<<"恭喜您的战队在{1}赛获得轮空资格，可直接晋级下一轮比赛。"/utf8>>;


get(6500015) ->
<<"3v3冠军赛邀请"/utf8>>;


get(6500016) ->
<<"恭贺您所在的战队成功获得3v3冠军争夺赛入围资格，冠军赛将于今晚21：00准时举行，记得准时入场哦"/utf8>>;


get(6500017) ->
<<"3v3赛季重置"/utf8>>;


get(6500018) ->
<<"尊敬的阴阳师，新一轮的3v3战队赛季已经正式开启，赛季重启时，所有战队的段位均会回到初始段位，祝您在新的赛季中能够取得更好的成绩！"/utf8>>;


get(6500019) ->
<<"8强"/utf8>>;


get(6500020) ->
<<"4强"/utf8>>;


get(6500021) ->
<<"半决"/utf8>>;


get(6500022) ->
<<"冠军"/utf8>>;


get(6500023) ->
<<"16强"/utf8>>;


get(6510001) ->
<<"分区补偿"/utf8>>;


get(6510002) ->
<<"由于您在分区的时候中{1}失效，我们将会把您的损失补偿给您，请注意查收"/utf8>>;


get(18800001) ->
<<"首杀活动奖励领取"/utf8>>;


get(18800002) ->
<<"这是您在首杀活动中的奖励，请查收"/utf8>>;


get(18800003) ->
<<"首杀活动全服归属奖励"/utf8>>;


get(18800004) ->
<<"尊敬的阴阳师，这是您未领取首杀活动的全服归属奖励，请查收"/utf8>>;


get(31010020) ->
<<"哈！活着的傻瓜，乖乖当我的午餐吧"/utf8>>;


get(31010021) ->
<<"仆人们，来我身边！"/utf8>>;


get(31010022) ->
<<"让你们看看在极寒中存活的我有多强！"/utf8>>;


get(31010023) ->
<<"雪爪顺劈！"/utf8>>;


get(31010024) ->
<<"啊~新鲜的燃料~！"/utf8>>;


get(31010025) ->
<<"让火焰吞噬你！"/utf8>>;


get(31010026) ->
<<"我的利刃饥渴难耐！"/utf8>>;


get(31010027) ->
<<"看来今天又可以举行一场盛大的祭典了！"/utf8>>;


get(31010028) ->
<<"仆人们，协助我完成祭典吧！"/utf8>>;


get(31010029) ->
<<"滚出我的森林！"/utf8>>;


get(31010030) ->
<<"感受森林的怒火！"/utf8>>;


get(31070020) ->
<<"在这冰天雪地中，只有保持怒火才能战胜严寒！"/utf8>>;


get(31070021) ->
<<"我的怒火无法平息！"/utf8>>;


get(31080020) ->
<<"让火焰净化一切！"/utf8>>;


get(31080021) ->
<<"死吧，虫子！"/utf8>>;


get(31090020) ->
<<"肉饼才是最美味的食物！"/utf8>>;


get(31090021) ->
<<"碾碎你们！"/utf8>>;


get(51510001) ->
<<"我要<color='#ff8a3c'>糖</color>，我要吃<color='#ff8a3c'>糖</color>！！！"/utf8>>;


get(51510002) ->
<<"给我<color='#ff8a3c'>饼干</color>我就溜！！！"/utf8>>;


get(51510003) ->
<<"有<color='#ff8a3c'>香蕉</color>就什么都好说！！！"/utf8>>;


get(51510004) ->
<<"我们的感情，<color='#ff8a3c'>天长地久</color>！"/utf8>>;


get(51510005) ->
<<"执子之手，<color='#ff8a3c'>相濡以沫</color>！"/utf8>>;


get(51510006) ->
<<"只想与你<color='#ff8a3c'>如胶似漆</color>！"/utf8>>;


get(51510007) ->
<<"小哥哥，小姐姐，你们只有<color='#ff8a3c'>其中一个人</color>能够对我造成伤害喔！"/utf8>>;

get(_Id) ->
	"".

get(0,1) ->
	#language{module_id = 0,id = 1,type = 2,subtype = 10,tip = 1,content = <<"获得 {1} x {2}"/utf8>>};

get(0,2) ->
	#language{module_id = 0,id = 2,type = 2,subtype = 10,tip = 1,content = <<"获得 <a@goods5@{1}></a> x {2}"/utf8>>};

get(0,7) ->
	#language{module_id = 0,id = 7,type = 1,subtype = 10,tip = 0,content = <<"{1}功能异常关闭中，请耐心等待后续通知！"/utf8>>};

get(0,8) ->
	#language{module_id = 0,id = 8,type = 1,subtype = 10,tip = 0,content = <<"{1}功能异常已修复，现在已经开启"/utf8>>};

get(0,9) ->
	#language{module_id = 0,id = 9,type = 6,subtype = 0,tip = 0,content = <<"测试一下特定场景传闻"/utf8>>};

get(130,1) ->
	#language{module_id = 130,id = 1,type = 1,subtype = 1,tip = 0,content = <<"玩家<color@2>{1}</color>改名为<color@0><a@player@{2}@{3}></a></color>"/utf8>>};

get(130,2) ->
	#language{module_id = 130,id = 2,type = 1,subtype = 10,tip = 0,content = <<"恭喜<color@2>{1}</color>通过<color@2>{2}转</color>历练，成功转职为<color@3>{3}</color>，战力得到大幅飙升！"/utf8>>};

get(130,3) ->
	#language{module_id = 130,id = 3,type = 1,subtype = 10,tip = 0,content = <<"忘了那个TA，<color@2>{1}</color>玩家把<a@goods@{2}></a>一饮而尽，将职业更改成<color@3>{3}</color>"/utf8>>};

get(132,1) ->
	#language{module_id = 132,id = 1,type = 1,subtype = 10,tip = 0,content = <<"一道闪瞎人的金光出现，<color@2><a@player@{1}@{2}></a></color>定睛一看，发现挂机的时候获得了<a@goods3@{3}@{4}@{5}></a>！"/utf8>>};

get(132,2) ->
	#language{module_id = 132,id = 2,type = 1,subtype = 10,tip = 0,content = <<"一道闪瞎人的金光出现，<color@2><a@player@{1}@{2}></a></color>定睛一看，发现挂机的时候获得了<color@4>绑玉</color>*{3}！"/utf8>>};

get(134,1) ->
	#language{module_id = 134,id = 1,type = 1,subtype = 10,tip = 0,content = <<"恭喜<color@2><a@player@{1}@{2}></a></color>玩家成功激活<color@3><a@title@{3}@{4}></a></color>，独特的造型彰显高贵的身份"/utf8>>};

get(134,2) ->
	#language{module_id = 134,id = 2,type = 1,subtype = 10,tip = 0,content = <<"玩家<color@2><a@player@{1}@{2}></a></color>突飞猛进，成功达到[<color@4>{3}</color>]，独特的造型彰显高贵的身份！"/utf8>>};

get(135,1) ->
	#language{module_id = 135,id = 1,type = 1,subtype = 10,tip = 0,content = <<"<color@2>{1}</color>玩家手起刀落，击杀了{2}，现在秘宝归我了！"/utf8>>};

get(135,2) ->
	#language{module_id = 135,id = 2,type = 1,subtype = 10,tip = 0,content = <<"<color@2>{1}</color>玩家唯快不破，成为本次首位登顶的玩家！"/utf8>>};

get(135,3) ->
	#language{module_id = 135,id = 3,type = 1,subtype = 10,tip = 0,content = <<"一道华丽光晕闪过，顶层秘宝出现在了第九层圣殿中央！拾得者可获得丰厚奖励！"/utf8>>};

get(135,4) ->
	#language{module_id = 135,id = 4,type = 1,subtype = 10,tip = 0,content = <<"<color@2>{1}</color>身姿矫健，眼疾手快， 一个探手便将九魂秘宝收入囊中！"/utf8>>};

get(135,5) ->
	#language{module_id = 135,id = 5,type = 1,subtype = 10,tip = 0,content = <<"<color@2>{1}</color>玩家武力威猛，轻取{2}连杀！"/utf8>>};

get(135,6) ->
	#language{module_id = 135,id = 6,type = 6,subtype = 10,tip = 0,content = <<"九魂妖塔已正式开启，一将功成万骨枯，证明自己的时刻到了！"/utf8>>};

get(135,7) ->
	#language{module_id = 135,id = 7,type = 1,subtype = 10,tip = 0,content = <<"秘宝结算时间已到，<color@2>{1}</color>玩家持有秘宝，已获得顶层秘宝{2}奖励！"/utf8>>};

get(137,1) ->
	#language{module_id = 137,id = 1,type = 1,subtype = 10,tip = 0,content = <<"各位阴阳师，勾玉擂台已经开启！海量绑玉等你来拿！不论胜负，拿到手软！老铁，嗨起来！<color@3><a@open_fun@64>立即前往</a></color>"/utf8>>};

get(137,2) ->
	#language{module_id = 137,id = 2,type = 6,subtype = 10,tip = 0,content = <<"号外号外！勾玉擂台海选赛第<color@1>{1}</color>场已经结束了,总共<color@1>{2}</color>人晋级，共获<color@3>{3}</color>绑玉！"/utf8>>};

get(137,3) ->
	#language{module_id = 137,id = 3,type = 6,subtype = 10,tip = 0,content = <<"号外号外！勾玉擂台1~65级战区的登顶战结束啦，冠军是人见人爱，花见花开的<color@1>{1}</color>"/utf8>>};

get(137,4) ->
	#language{module_id = 137,id = 4,type = 1,subtype = 10,tip = 0,content = <<"各位阴阳师，勾玉擂台将于5分钟后开启！一大波绑玉即将来袭，请各位做好准备，还没报名的速速报名啦！<color@1><a@drumwar>查看活动</a></color>"/utf8>>};

get(137,5) ->
	#language{module_id = 137,id = 5,type = 1,subtype = 10,tip = 0,content = <<"号外号外！勾玉擂台66~75级战区的登顶战结束啦，冠军是人见人爱，花见花开的<color@1>{1}</color>"/utf8>>};

get(137,6) ->
	#language{module_id = 137,id = 6,type = 1,subtype = 10,tip = 0,content = <<"号外号外！勾玉擂台{1}~{2}级战区的登顶战结束啦，冠军是人见人爱，花见花开的<color@1>S{3}</color>.<color@1>{4}</color>"/utf8>>};

get(137,7) ->
	#language{module_id = 137,id = 7,type = 1,subtype = 10,tip = 0,content = <<"号外号外！勾玉擂台{1}级以上战区的登顶战结束啦，冠军是人见人爱，花见花开的<color@1>S{2}</color>.<color@1>{3}</color>"/utf8>>};

get(137,8) ->
	#language{module_id = 137,id = 8,type = 1,subtype = 10,tip = 0,content = <<"各位尊敬的阴阳师，由于人数不足，本次勾玉擂台活动取消！"/utf8>>};

get(137,9) ->
	#language{module_id = 137,id = 9,type = 1,subtype = 10,tip = 0,content = <<"勾玉擂台开始报名啦！参与活动领取海量勾玉！各位阴阳师切勿忘记报名哦~！<color@3><a@open_fun@64>立即前往</a></color>"/utf8>>};

get(140,1) ->
	#language{module_id = 140,id = 1,type = 3,subtype = 10,tip = 0,content = <<"<color@2>{1}</color>接受了你的好友申请"/utf8>>};

get(140,2) ->
	#language{module_id = 140,id = 2,type = 3,subtype = 10,tip = 0,content = <<"<color@2>{1}</color>拒绝了你的好友申请"/utf8>>};

get(142,1) ->
	#language{module_id = 142,id = 1,type = 1,subtype = 10,tip = 0,content = <<"恭喜<color@1>{1}</color>成功激活神巫<color@1>{2}</color>，战力飙升，令人艳羡！"/utf8>>};

get(143,1) ->
	#language{module_id = 143,id = 1,type = 1,subtype = 10,tip = 0,content = <<"玩家<color@2>{1}</color>成功激活<color@3>{2}</color>，实力大幅提升！"/utf8>>};

get(143,2) ->
	#language{module_id = 143,id = 2,type = 1,subtype = 10,tip = 0,content = <<"玩家<color@2><a@player@{1}@{2}></a></color>集齐<color@3>{3}</color>颗龙玉，激活<color@3>{4}</color>光环，羡煞旁人！"/utf8>>};

get(148,1) ->
	#language{module_id = 148,id = 1,type = 1,subtype = 10,tip = 0,content = <<"经过<color@2>{1}</color>玩家一路以来不断收集，终于将<color@3>{2}</color>侍魂激活，真让人羡慕！"/utf8>>};

get(150,1) ->
	#language{module_id = 150,id = 1,type = 1,subtype = 10,tip = 0,content = <<"<color@2>{1}</color>参与击杀{2}的过程中，意外获得{3}，幸运女神果然眷顾欧洲人啊！"/utf8>>};

get(150,2) ->
	#language{module_id = 150,id = 2,type = 1,subtype = 5,tip = 0,content = <<"<color@2>{1}</color>参与击杀{2}的过程中，意外获得{3}，幸运女神果然眷顾欧洲人啊！"/utf8>>};

get(150,5) ->
	#language{module_id = 150,id = 5,type = 1,subtype = 10,tip = 0,content = <<"<color@2>{1}</color>打开<a@goods@{2}></a>获得<a@goods3@{3}@{4}@{5}></a>。"/utf8>>};

get(150,6) ->
	#language{module_id = 150,id = 6,type = 1,subtype = 10,tip = 1,content = <<"你捡到了一个好装备"/utf8>>};

get(150,7) ->
	#language{module_id = 150,id = 7,type = 1,subtype = 10,tip = 0,content = <<"光柱冲天而起!<color@2><a@player@{1}@{2}></a></color>成功合成了稀有神饰<a@goods3@{3}@{4}@{5}></a>，战力暴增！"/utf8>>};

get(150,8) ->
	#language{module_id = 150,id = 8,type = 1,subtype = 10,tip = 0,content = <<"<color@2><a@player@{1}@{2}></a></color>潜心打造,成功合成了<color@4>{3}</color>星装备<a@goods3@{4}@{5}@{6}></a>，实力大增！"/utf8>>};

get(150,9) ->
	#language{module_id = 150,id = 9,type = 2,subtype = 10,tip = 1,content = <<"<color@2><a@player2@{1}@{2}@{3}></a></color>正偷偷地打量着你."/utf8>>};

get(150,10) ->
	#language{module_id = 150,id = 10,type = 2,subtype = 10,tip = 1,content = <<"<color@2><a@player2@{1}@{2}@{3}></a></color>向你投来了羡慕的目光."/utf8>>};

get(150,11) ->
	#language{module_id = 150,id = 11,type = 2,subtype = 10,tip = 1,content = <<"好奇宝宝<color@2><a@player2@{1}@{2}@{3}></a></color>瞄了瞄你OvO"/utf8>>};

get(150,12) ->
	#language{module_id = 150,id = 12,type = 2,subtype = 10,tip = 1,content = <<"<color@2><a@player2@{1}@{2}@{3}></a></color>偷偷瞻仰着你，害羞得不敢说话(*/ω＼*)"/utf8>>};

get(150,13) ->
	#language{module_id = 150,id = 13,type = 1,subtype = 10,tip = 1,content = <<"<color@2><a@player2@{1}@{2}@{3}></a></color>看着你惊人的战力大喊666(✧◡✧)"/utf8>>};

get(150,14) ->
	#language{module_id = 150,id = 14,type = 1,subtype = 10,tip = 0,content = <<"天降圣光!原来是<color@2><a@player@{1}@{2}></a></color>成功合成了<color@4>四星粉装</color><a@goods3@{3}@{4}@{5}></a>，战神附体！"/utf8>>};

get(150,15) ->
	#language{module_id = 150,id = 15,type = 1,subtype = 10,tip = 0,content = <<"<color@2><a@player@{1}@{2}></a></color>玩家经过不懈的努力，终于合成了影装<a@goods3@{3}@{4}@{5}></a>，实力大增！"/utf8>>};

get(150,16) ->
	#language{module_id = 150,id = 16,type = 1,subtype = 10,tip = 0,content = <<"光柱冲天而起!<color@2><a@player@{1}@{2}></a></color>成功合成了稀有神饰<a@goods3@{3}@{4}@{5}></a>，战力暴增！"/utf8>>};

get(150,17) ->
	#language{module_id = 150,id = 17,type = 1,subtype = 10,tip = 0,content = <<"<color@2><a@player@{1}@{2}></a></color>搏一搏单车变摩托,三合一成功合成了<color@4>{3}</color>星装备<a@goods3@{4}@{5}@{6}></a>！"/utf8>>};

get(150,18) ->
	#language{module_id = 150,id = 18,type = 1,subtype = 10,tip = 0,content = <<"<color@2><a@player@{1}@{2}></a></color>合成<a@goods@{3}></a>的过程中小手一抖,只获得了一件残次品！"/utf8>>};

get(150,19) ->
	#language{module_id = 150,id = 19,type = 1,subtype = 10,tip = 0,content = <<"<color@2><a@player@{1}@{2}></a></color>锦鲤附体四合一<color@4>{3}</color>星装备<a@goods3@{4}@{5}@{6}></a>成功,实力大增！"/utf8>>};

get(150,20) ->
	#language{module_id = 150,id = 20,type = 1,subtype = 10,tip = 0,content = <<"<color@2><a@player@{1}@{2}></a></color>在合成装备<a@goods@{3}></a>的紧要关头高兴过头,出现了一点小瑕疵！"/utf8>>};

get(150,21) ->
	#language{module_id = 150,id = 21,type = 1,subtype = 10,tip = 0,content = <<"<color@2><a@player@{1}@{2}></a></color>稳扎稳打五合一成功合成了<color@4>{3}</color>星装备<a@goods3@{4}@{5}@{6}></a>，超神指日可待！"/utf8>>};

get(150,22) ->
	#language{module_id = 150,id = 22,type = 1,subtype = 10,tip = 0,content = <<"天降圣光!<color@2><a@player@{1}@{2}></a></color>成功合成了稀有宝具<a@goods5@{3}@{4}@{5}></a>，战力暴增！"/utf8>>};

get(150,23) ->
	#language{module_id = 150,id = 23,type = 1,subtype = 10,tip = 0,content = <<"白虹贯日!<color@2><a@player@{1}@{2}></a></color>历尽千辛万苦,潜心打造出<a@goods3@{3}@{4}@{5}></a>，无人能挡！"/utf8>>};

get(150,24) ->
	#language{module_id = 150,id = 24,type = 1,subtype = 10,tip = 0,content = <<"光柱冲天而起!<color@2><a@player@{1}@{2}></a></color>成功合成了高阶永久守护<a@goods3@{3}@{4}@{5}></a>，麻麻再也不用担心它过时啦！"/utf8>>};

get(150,25) ->
	#language{module_id = 150,id = 25,type = 1,subtype = 10,tip = 0,content = <<"光柱冲天而起!<color@2><a@player@{1}@{2}></a></color>成功合成了<color@2>{3}</color>核心<a@goods@{4}></a>，战力疯涨根本停不下来！"/utf8>>};

get(150,26) ->
	#language{module_id = 150,id = 26,type = 1,subtype = 10,tip = 0,content = <<"功夫不负有心人<color@2><a@player@{1}@{2}></a></color>成功打造了<color@4>暗金装备</color><a@goods3@{3}@{4}@{5}></a>，威武霸气！"/utf8>>};

get(150,27) ->
	#language{module_id = 150,id = 27,type = 4,subtype = 10,tip = 0,content = <<"<color@2>{1}</color>打开<a@goods@{2}></a>获得幸运双倍奖励——{3}，天选欧洲人！"/utf8>>};

get(150,28) ->
	#language{module_id = 150,id = 28,type = 4,subtype = 10,tip = 0,content = <<"<a@goods3@{1}@{2}@{3}></a>*{4}"/utf8>>};

get(150,1509999) ->
	#language{module_id = 150,id = 1509999,type = 1,subtype = 0,tip = 0,content = <<""/utf8>>};

get(151,1) ->
	#language{module_id = 151,id = 1,type = 3,subtype = 0,tip = 0,content = <<"购买成功！剩余交易次数：{1}"/utf8>>};

get(151,2) ->
	#language{module_id = 151,id = 2,type = 2,subtype = 10,tip = 0,content = <<"<color@3>{1}</color>以<color@2>{2}</color>勾玉求购{3}个<a@goods@{4}></a>!【<color@1><a@seekgoods>去瞧瞧看</a></color>】"/utf8>>};

get(151,3) ->
	#language{module_id = 151,id = 3,type = 1,subtype = 10,tip = 0,content = <<"<color@3><a@player@{1}@{2}></a></color>以<color@2>{3}</color>勾玉价格上架了<a@goods@{4}></a>!【<color@1><a@sellid@{5}@{6}@{7}>去瞧瞧看</a></color>】"/utf8>>};

get(151,4) ->
	#language{module_id = 151,id = 4,type = 1,subtype = 10,tip = 0,content = <<"神秘人以<color@2>{1}</color>勾玉价格上架了<a@goods@{2}></a>!【<color@1><a@sellid@{3}@{4}@{5}>去瞧瞧看</a></color>】"/utf8>>};

get(152,1) ->
	#language{module_id = 152,id = 1,type = 1,subtype = 10,tip = 0,content = <<"<color@2><a@player@{1}@{2}></a></color>通过洗炼获得了一条<color@{3}>{4}</color>极品属性，获得成吨战力！"/utf8>>};

get(152,2) ->
	#language{module_id = 152,id = 2,type = 1,subtype = 10,tip = 0,content = <<"<color@2><a@player@{1}@{2}></a></color>将一件装备上的所有洗炼属性洗到<color@3>紫色</color>以上品质，神挡杀神！"/utf8>>};

get(152,3) ->
	#language{module_id = 152,id = 3,type = 1,subtype = 10,tip = 0,content = <<"<color@2><a@player@{1}@{2}></a></color>成功将<a@goods4@{3}@{4}@{5}></a>强化到<color@4>{6}</color>级，战力突飞猛进！"/utf8>>};

get(152,4) ->
	#language{module_id = 152,id = 4,type = 1,subtype = 10,tip = 0,content = <<"<color@2><a@player@{1}@{2}></a></color>成功将<a@goods4@{3}@{4}@{5}></a>激活了<color@3><{7}件></color><color@4>{6}共鸣</color>，获得了成吨的战力"/utf8>>};

get(152,5) ->
	#language{module_id = 152,id = 5,type = 1,subtype = 10,tip = 0,content = <<"<color@2><a@player@{1}@{2}></a></color>将<a@goods4@{3}@{4}@{5}></a>觉醒至<color@4>{6}</color>级，战力突飞猛进！"/utf8>>};

get(152,6) ->
	#language{module_id = 152,id = 6,type = 1,subtype = 10,tip = 0,content = <<"<color@2><a@player@{1}@{2}></a></color>为<a@goods4@{3}@{4}@{5}></a>附加了<color@0><{6}级></color><color@4>【{7}】</color>，实力愈发强大！"/utf8>>};

get(152,7) ->
	#language{module_id = 152,id = 7,type = 1,subtype = 10,tip = 0,content = <<"<color@2><a@player@{1}@{2}></a></color>通过洗炼获得一条<color@{3}>{4}</color>极品属性，瞬间爆炸！"/utf8>>};

get(152,8) ->
	#language{module_id = 152,id = 8,type = 1,subtype = 10,tip = 0,content = <<"<color@2><a@player@{1}@{2}></a></color>将<a@goods@{3}></a>打造成<color@5>{6}</color>神装，战力获得了巨大的提升！"/utf8>>};

get(152,9) ->
	#language{module_id = 152,id = 9,type = 1,subtype = 10,tip = 0,content = <<"恭喜<color@2><a@player@{1}@{2}></a></color>成功将<a@goods4@{3}@{4}@{5}></a>的洗炼段位提升到到<color@1>{6}段</color>！强无敌！"/utf8>>};

get(152,10) ->
	#language{module_id = 152,id = 10,type = 1,subtype = 10,tip = 0,content = <<"天降圣光！恭喜<color@2><a@player@{1}@{2}></a></color>成功激活了传世名铠<color@4>{3}</color>，战力飙升！"/utf8>>};

get(152,11) ->
	#language{module_id = 152,id = 11,type = 1,subtype = 10,tip = 0,content = <<"金色的圣光从天而降冲破了穹顶！恭喜<color@2>{1}</color>玩家成功将<a@goods4@{2}@{3}@{4}></a> 提升至<color@4>神炼+{5}</color>，极品属性获得巨额加成！"/utf8>>};

get(154,1) ->
	#language{module_id = 154,id = 1,type = 1,subtype = 4,tip = 0,content = <<"本轮<color@1>{1}</color>活动的拍卖会将在{2}分钟后开始，即将拍卖的物品有：{3}"/utf8>>};

get(154,2) ->
	#language{module_id = 154,id = 2,type = 1,subtype = 4,tip = 0,content = <<"本轮<color@1>{1}</color>活动的拍卖会开始啦，大佬们快来竞拍买买买！<color@1><a@worldauction>点击前往</a></color>"/utf8>>};

get(154,3) ->
	#language{module_id = 154,id = 3,type = 1,subtype = 10,tip = 0,content = <<"新一轮世界拍卖会将在{1}分钟后开始，即将拍卖的物品有：{2}"/utf8>>};

get(154,4) ->
	#language{module_id = 154,id = 4,type = 1,subtype = 10,tip = 0,content = <<"新一轮世界拍卖会开始了，大佬们快来竞拍买买买！<color@1><a@worldauction>查看竞拍</a></color>"/utf8>>};

get(154,5) ->
	#language{module_id = 154,id = 5,type = 1,subtype = 4,tip = 0,content = <<"本结社在<color@1>{1}</color>活动中没有获得拍卖物，希望各位阴阳师再接再厉！"/utf8>>};

get(154,6) ->
	#language{module_id = 154,id = 6,type = 1,subtype = 10,tip = 0,content = <<"小道消息：玩家<color@1>{1}</color>上架了拍卖物{2}，大家赶紧去抢购吧！ <color@1><a@worldauction>点击前往</a></color>"/utf8>>};

get(158,1) ->
	#language{module_id = 158,id = 1,type = 1,subtype = 10,tip = 1,content = <<"恭喜<color@2><a@player@{1}@{2}></a></color>成功领取首充礼包，获得传说武器<a@goods3@{3}@{4}@{5}></a><a@firstrecharge><color@1><我要首充></color></a>"/utf8>>};

get(158,2) ->
	#language{module_id = 158,id = 2,type = 1,subtype = 10,tip = 1,content = <<"恭喜<color@2><a@player@{1}@{2}></a></color>成功领取首充礼包，获得极品项链<a@goods3@{3}@{4}@{5}></a><a@firstrecharge><color@1><我要首充></color></a>"/utf8>>};

get(158,3) ->
	#language{module_id = 158,id = 3,type = 1,subtype = 10,tip = 1,content = <<"恭喜<color@2><a@player@{1}@{2}></a></color>成功领取首充礼包，获得极品护符<a@goods3@{3}@{4}@{5}></a><a@firstrecharge><color@1><我要首充></color></a>"/utf8>>};

get(160,1) ->
	#language{module_id = 160,id = 1,type = 1,subtype = 10,tip = 1,content = <<"<color@2>{1}</color></color>成功将{2}提升至<color@2>{3}</color>阶，实力大增！"/utf8>>};

get(160,3) ->
	#language{module_id = 160,id = 3,type = 1,subtype = 10,tip = 0,content = <<"恭喜<color@1>{1}</color>成功激活<color@1>{2}</color>外形<color@1>{3}</color>，战力飙升，令人艳羡！"/utf8>>};

get(172,1) ->
	#language{module_id = 172,id = 1,type = 2,subtype = 10,tip = 0,content = <<"<color@4><a@player@{1}@{2}></a></color>正在寻找心仪对象，各位单身贵族们，有意者速速前往撩TA吧！<color@2><a@sendpersonals>前往撩TA</a></color>"/utf8>>};

get(172,2) ->
	#language{module_id = 172,id = 2,type = 2,subtype = 10,tip = 0,content = <<"<color@4>{1}</color>答应了你的求婚，恭祝你们甜蜜幸福，百年好合"/utf8>>};

get(172,3) ->
	#language{module_id = 172,id = 3,type = 2,subtype = 10,tip = 0,content = <<"<color@4>{1}</color>拒绝了你的求婚，不要灰心继续坚持吧~"/utf8>>};

get(172,4) ->
	#language{module_id = 172,id = 4,type = 2,subtype = 10,tip = 0,content = <<"<color@4>{1}</color>拒绝了你的离婚请求"/utf8>>};

get(172,6) ->
	#language{module_id = 172,id = 6,type = 1,subtype = 10,tip = 0,content = <<"<color@4><a@player@{1}@{2}></a></color>和<color@4><a@player@{3}@{4}></a></color>在今天喜结良缘！恭喜两位新人恩爱美满！百年好合！<color@2><a@marriage>我要结婚</a></color>"/utf8>>};

get(172,7) ->
	#language{module_id = 172,id = 7,type = 1,subtype = 10,tip = 0,content = <<"<color@2>{1}</color>和<color@2>{2}</color>的{3}将于{4}分钟后正式开始，速速向他们索要请柬吧！<color@1><a@weddingask@{5}>立即索要</a></color>"/utf8>>};

get(172,8) ->
	#language{module_id = 172,id = 8,type = 6,subtype = 10,tip = 0,content = <<"东道主<color@1>{1}</color>正在为在场贵宾派发<color@1>{2}</color>！婚礼气氛值增加<color@1>{3}</color>点"/utf8>>};

get(172,9) ->
	#language{module_id = 172,id = 9,type = 6,subtype = 10,tip = 0,content = <<"<color@1>{1}</color>为宴会主人燃放了<color@1>{2}</color>！婚礼气氛值增加<color@1>{3}</color>点"/utf8>>};

get(172,10) ->
	#language{module_id = 172,id = 10,type = 6,subtype = 10,tip = 0,content = <<"婚礼宣誓即将开始，有请新人进场做好准备噢~"/utf8>>};

get(172,11) ->
	#language{module_id = 172,id = 11,type = 6,subtype = 10,tip = 0,content = <<"为了感谢来宾们的到来，宴会主人为各位准备了丰盛的宴席，请尽情享用！"/utf8>>};

get(172,12) ->
	#language{module_id = 172,id = 12,type = 6,subtype = 10,tip = 0,content = <<"天下无不散之筵席，期待下次与各位的相聚，后会有期！"/utf8>>};

get(172,13) ->
	#language{module_id = 172,id = 13,type = 6,subtype = 10,tip = 0,content = <<"现场来宾热情不减，反响热烈，美味糖果从天而降以此犒劳热情的各位！"/utf8>>};

get(174,1) ->
	#language{module_id = 174,id = 1,type = 1,subtype = 10,tip = 1,content = <<"<color@2>{1}</color>才智过人，成为本次智慧达人活动的<color@3>智慧之星</color>!"/utf8>>};

get(174,2) ->
	#language{module_id = 174,id = 2,type = 2,subtype = 10,tip = 1,content = <<"<color@2>智慧达人</color>活动开始啦，大家快去展现自己的聪明才智吧！"/utf8>>};

get(174,3) ->
	#language{module_id = 174,id = 3,type = 2,subtype = 10,tip = 0,content = <<"<color@2>智慧达人</color>活动即将在<color@0>5</color>分钟后开始！"/utf8>>};

get(177,1) ->
	#language{module_id = 177,id = 1,type = 1,subtype = 10,tip = 0,content = <<"<color@2>{1}</color>在<color@0>{2}</color>买下一套房子，小伙伴们速速去围观吧！"/utf8>>};

get(177,2) ->
	#language{module_id = 177,id = 2,type = 1,subtype = 10,tip = 0,content = <<"<color@2>{1}</color>和<color@1>{2}</color>在<color@0>{3}</color>买下一套房子，小伙伴们速速去围观吧！"/utf8>>};

get(177,3) ->
	#language{module_id = 177,id = 3,type = 1,subtype = 10,tip = 0,content = <<"<color@2>{1}</color>挥金如土，将房子规模提升至<color@3>{2}</color>，小伙伴们速速去围观吧！"/utf8>>};

get(177,4) ->
	#language{module_id = 177,id = 4,type = 1,subtype = 10,tip = 0,content = <<"<color@2>{1}</color>和<color@1>{2}</color>壕气冲天，将房子规模提升至<color@3>{3}</color>，小伙伴们速速去围观吧！"/utf8>>};

get(177,5) ->
	#language{module_id = 177,id = 5,type = 1,subtype = 10,tip = 0,content = <<"<color@2>{1}</color>小手一挥，为<color@0>{2}</color>的家园送上礼物<color@3>{3}</color>，令人感动！"/utf8>>};

get(177,6) ->
	#language{module_id = 177,id = 6,type = 1,subtype = 10,tip = 0,content = <<"<color@2>{1}</color>小手一挥，为<color@0>{2}</color>和<color@3>{3}</color>的家园送上礼物<color@3>{4}</color>，令人感动！"/utf8>>};

get(179,1) ->
	#language{module_id = 179,id = 1,type = 1,subtype = 10,tip = 0,content = <<"<color@2><a@player@{1}@{2}></a></color>在周一大奖中抽奖获得{3}等奖<a@goods@{4}></a>*{5}，666呀，<color@1><a@open_fun@111>我也要抽</a></color>"/utf8>>};

get(179,2) ->
	#language{module_id = 179,id = 2,type = 1,subtype = 10,tip = 0,content = <<"<color@2><a@player@{1}@{2}></a></color>在开服大奖中抽奖获得{3}等奖<a@goods@{4}></a>*{5}，666呀，<color@1><a@open_fun@111>我也要抽</a></color>"/utf8>>};

get(181,1) ->
	#language{module_id = 181,id = 1,type = 1,subtype = 10,tip = 0,content = <<"神纹法阵闪耀着奇迹之光，<color@2><a@player@{1}@{2}></a></color>将<a@goods3@{3}@{4}@{5}></a><color@1>X{6}</color>召唤到了现世！<color@1><a@open_fun@118>我也要召唤</a></color>"/utf8>>};

get(182,1) ->
	#language{module_id = 182,id = 1,type = 2,subtype = 1,tip = 0,content = <<"我家宝宝最可爱了，大家也来看看吧!<color@2><a@baby@{1}>逗弄宝宝</a></color>"/utf8>>};

get(182,2) ->
	#language{module_id = 182,id = 2,type = 1,subtype = 10,tip = 0,content = <<"玩家{1}正在逗弄您的宝宝，并给了您宝宝一个赞！<color@2><a@praiser@{2}>立即回赞</a></color>"/utf8>>};

get(182,3) ->
	#language{module_id = 182,id = 3,type = 1,subtype = 10,tip = 0,content = <<"恭喜玩家{1}成功激活宝具<a@goods5@{2}></a>专属技能<color@{3}>{4}</color>，战力暴涨！"/utf8>>};

get(183,1) ->
	#language{module_id = 183,id = 1,type = 1,subtype = 10,tip = 0,content = <<"一道光芒从天而降，定睛一看是<color@2>{1}</color>玩家成功将<color@4>{2}</color>妖灵升至{3}星，真的是可喜可贺"/utf8>>};

get(183,2) ->
	#language{module_id = 183,id = 2,type = 1,subtype = 10,tip = 0,content = <<"噼里啪啦噼里啪啦，恭喜<color@2>{1}</color>玩家成功激活<color@2>{2}</color>妖灵，真是让人羡慕妒忌恨"/utf8>>};

get(185,1) ->
	#language{module_id = 185,id = 1,type = 1,subtype = 10,tip = 0,content = <<"<color@4>s{1}.{2}</color>在<color@4>{3}</color>开始护送<color@4>{4}</color>！"/utf8>>};

get(185,2) ->
	#language{module_id = 185,id = 2,type = 2,subtype = 4,tip = 0,content = <<"水晶护送活动已经开始了，会长大人快来开车~<color@3><a@open_fun@179>参加活动</a></color>"/utf8>>};

get(185,3) ->
	#language{module_id = 185,id = 3,type = 2,subtype = 4,tip = 0,content = <<"{1}·<a@player@{2}@{3}></a> 花费<color@4><a@goods@{4}></a>*{5}</color>为结社开始护送<color@4>{6}</color>，结社伙伴们快来<color@3>{7}</color>一起护送吧~<color@3><a@convoy_scene@{8}>进入场景</a></color>"/utf8>>};

get(185,4) ->
	#language{module_id = 185,id = 4,type = 2,subtype = 4,tip = 0,content = <<"水晶护送活动开始了，我在<color@3>{1}</color>准备开始护送水晶，大家快来参与护送吧~<color@3><a@open_fun@179>参与护送</a></color>"/utf8>>};

get(185,5) ->
	#language{module_id = 185,id = 5,type = 1,subtype = 4,tip = 0,content = <<"本结社<color@4>{1}</color>的<color@4>{2}</color>，已经成功抵达目的地~"/utf8>>};

get(185,6) ->
	#language{module_id = 185,id = 6,type = 1,subtype = 4,tip = 0,content = <<"本结社护送的<color@4>{1}</color>遭到掠夺，已经严重受损，护送结束。"/utf8>>};

get(185,7) ->
	#language{module_id = 185,id = 7,type = 1,subtype = 10,tip = 0,content = <<"水晶护送活动已经开始，大家快去参与护送吧~"/utf8>>};

get(186,1) ->
	#language{module_id = 186,id = 1,type = 1,subtype = 10,tip = 0,content = <<"海域争夺赛开启了，海域之王谁来主宰，立即前往战场争夺吧！<color@1><a@open_fun@182>前往战场</a></color>"/utf8>>};

get(186,2) ->
	#language{module_id = 186,id = 2,type = 1,subtype = 10,tip = 0,content = <<"海王争霸赛开启了，四海之中究竟谁才是最终霸主，我们拭目以待！<color@1><a@open_fun@183>前往战场</a></color>"/utf8>>};

get(186,3) ->
	#language{module_id = 186,id = 3,type = 6,subtype = 10,tip = 0,content = <<"玩家<color@1>{1}</color>在战场上所向披靡，已经达到<color@1>{2}</color>人斩！"/utf8>>};

get(186,4) ->
	#language{module_id = 186,id = 4,type = 6,subtype = 10,tip = 0,content = <<"{1}据点已被摧毁，{2}据点的无敌状态将被解除"/utf8>>};

get(186,5) ->
	#language{module_id = 186,id = 5,type = 6,subtype = 10,tip = 0,content = <<"{1}据点已被成功修复，{2}据点恢复至无敌状态"/utf8>>};

get(186,6) ->
	#language{module_id = 186,id = 6,type = 6,subtype = 10,tip = 0,content = <<"{1}修复了{2}据点，海神城堡获得10s无敌效果"/utf8>>};

get(186,7) ->
	#language{module_id = 186,id = 7,type = 1,subtype = 0,tip = 0,content = <<"{1}开启封锁边境，各位阴阳师近期无法进去该领地搬砖~"/utf8>>};

get(186,8) ->
	#language{module_id = 186,id = 8,type = 1,subtype = 0,tip = 0,content = <<"{1}封锁状态解除，各位阴阳师能进去该领地搬砖了~"/utf8>>};

get(187,1) ->
	#language{module_id = 187,id = 1,type = 1,subtype = 19,tip = 0,content = <<"注意注意！<color@1>{1}</color>的<color@1>{2}</color>玩家正在偷偷搬运本海域圣殿砖块，请阴阳师们前往守卫制止！<color@1><a@seaAssert@{3}>立即前往</a></color>"/utf8>>};

get(187,2) ->
	#language{module_id = 187,id = 2,type = 1,subtype = 19,tip = 0,content = <<"本海域<color@1>s.{1}{2}</color>成员在{3}中被<color@1>s.{4}{5}</color>残忍杀害，请火速前往营救！<color@1><a@seaAssert@{6}>立即前往</a></color>"/utf8>>};

get(187,3) ->
	#language{module_id = 187,id = 3,type = 1,subtype = 19,tip = 0,content = <<"来自<color@1>{1}</color>的入侵者<color@1>s.{2}{3}</color>正在攻击本海域的雕像，请立即前往支援！<color@1><a@seaAssert@{4}>立即前往</a></color>"/utf8>>};

get(187,4) ->
	#language{module_id = 187,id = 4,type = 1,subtype = 19,tip = 0,content = <<"来自<color@1>{1}</color>的入侵者<color@1>s.{2}{3}</color>正在攻击本海域的守卫，请立即前往支援！<color@1><a@seaAssert@{4}>立即前往</a></color>"/utf8>>};

get(187,5) ->
	#language{module_id = 187,id = 5,type = 1,subtype = 19,tip = 0,content = <<"<color@1>{1}</color>的<color@1>{2}</color>玩家击杀了本海域的雕像,请前往驱赶！<color@1><a@seaAssert@{3}>立即前往</a></color>"/utf8>>};

get(187,6) ->
	#language{module_id = 187,id = 6,type = 1,subtype = 19,tip = 0,content = <<"<color@1>{1}</color>的<color@1>{2}</color>玩家击杀了本海域的守卫,请前往驱赶！<color@1><a@seaAssert@{3}>立即前往</a></color>"/utf8>>};

get(188,1) ->
	#language{module_id = 188,id = 1,type = 4,subtype = 10,tip = 1,content = <<"英雄诞生，恭喜<color@2>{1}</color>成为全服首个击败<color@5>{2}{3}</color>的玩家，获得首杀奖励，<color@1><a@open_fun@188>前往观摩</a></color>"/utf8>>};

get(194,1) ->
	#language{module_id = 194,id = 1,type = 1,subtype = 10,tip = 0,content = <<"恭喜<color@1><a@player@{1}@{2}></a></color>激活<color@5>豪华祭典</color>，可领取额外丰厚特权奖励。<color@1><a@open_fun2@{3}@2>前往激活</a></color>"/utf8>>};

get(203,1) ->
	#language{module_id = 203,id = 1,type = 1,subtype = 10,tip = 0,content = <<"<color@2>{1}</color>使用了<color@5>{2}藏宝图</color>，经过一番挖掘后，竟获得了<a@goods@{3}></a>*{4}！真令人羡慕。"/utf8>>};

get(203,2) ->
	#language{module_id = 203,id = 2,type = 4,subtype = 10,tip = 0,content = <<"<color@2>{1}</color>使用了<color@5>{2}藏宝图</color>，经过一番挖掘后，竟获得了<a@goods@{3}></a>*{4}！真令人羡慕。"/utf8>>};

get(206,1) ->
	#language{module_id = 206,id = 1,type = 2,subtype = 10,tip = 0,content = <<"百鬼夜行活动已限时开启，各位阴阳师请速速前往封印恶鬼<color@1><a@open_fun@206></a></color>"/utf8>>};

get(206,2) ->
	#language{module_id = 206,id = 2,type = 2,subtype = 10,tip = 0,content = <<"恭喜{1}小队封印{2}恶鬼，获得尾刀奖励<color@1><a@open_fun@206></a></color>"/utf8>>};

get(206,3) ->
	#language{module_id = 206,id = 3,type = 2,subtype = 10,tip = 0,content = <<"{1}剩余{2}只恶鬼未被封印，各位阴阳师速速寻找封印<color@1><a@open_fun@206></a></color>"/utf8>>};

get(206,4) ->
	#language{module_id = 206,id = 4,type = 2,subtype = 10,tip = 0,content = <<"百鬼夜行将在{1}分钟后结束！"/utf8>>};

get(206,5) ->
	#language{module_id = 206,id = 5,type = 2,subtype = 10,tip = 0,content = <<"感谢各位阴阳师的奋战，百鬼夜行已结束"/utf8>>};

get(210,1) ->
	#language{module_id = 210,id = 1,type = 2,subtype = 10,tip = 0,content = <<"<color@2><a@player@{1}@{2}></a></color>通关{3}级<color@3>{4}</color>,掌握了<a@skill@{5}></a>"/utf8>>};

get(216,1) ->
	#language{module_id = 216,id = 1,type = 1,subtype = 10,tip = 0,content = <<"恭喜<color@2>{1}</color>成功激活<color@3>{2}</color>获得buff加成，战斗力得到大幅度提升！！"/utf8>>};

get(216,2) ->
	#language{module_id = 216,id = 2,type = 1,subtype = 10,tip = 0,content = <<"恭喜<color@2>{1}</color>激活高阶守护<color@3>{2}</color>获得永久属性加成，战斗力飞跃提升~"/utf8>>};

get(218,1) ->
	#language{module_id = 218,id = 1,type = 1,subtype = 10,tip = 0,content = <<"尊神战场已正式开启，荣耀之战一触即发，证明自己的时刻到了！<color@3><a@open_fun@169>立即前往</a></color>"/utf8>>};

get(218,2) ->
	#language{module_id = 218,id = 2,type = 6,subtype = 0,tip = 0,content = <<"<color@2>{1}</color>玩家武力威猛，轻取{2}连杀！"/utf8>>};

get(218,3) ->
	#language{module_id = 218,id = 3,type = 6,subtype = 0,tip = 0,content = <<"<color@1>{1}</color>阵营势如破竹，占领了<color@1>{2}</color>，谁敢争锋？"/utf8>>};

get(221,1) ->
	#language{module_id = 221,id = 1,type = 1,subtype = 10,tip = 0,content = <<"恭喜<color@2>{1}</color>在<color@3>{2}</color>中荣登榜首，获得<color@3>{3}</color>称号！"/utf8>>};

get(221,2) ->
	#language{module_id = 221,id = 2,type = 1,subtype = 10,tip = 0,content = <<"恭喜<color@2>{1}</color>结社荣登<color@3>结社榜</color>榜首，全体成员获得<color@3>地表最强</color>称号！"/utf8>>};

get(222,1) ->
	#language{module_id = 222,id = 1,type = 2,subtype = 4,tip = 0,content = <<"恭喜<color@2>{1}</color>将头衔晋升到<color@{2}>「{3}」</color>，结社实力愈加强大了！"/utf8>>};

get(223,6) ->
	#language{module_id = 223,id = 6,type = 1,subtype = 10,tip = 0,content = <<"鲜花纷飞<color@4>{1}</color>赠送了{2}给<color@4>{3}</color>"/utf8>>};

get(223,7) ->
	#language{module_id = 223,id = 7,type = 1,subtype = 10,tip = 0,content = <<"<color@2>{1}</color>收到<color@4>{2}</color>"/utf8>>};

get(223,8) ->
	#language{module_id = 223,id = 8,type = 2,subtype = 10,tip = 0,content = <<"<color@4>{1}</color>感谢你送来的鲜花"/utf8>>};

get(223,9) ->
	#language{module_id = 223,id = 9,type = 1,subtype = 10,tip = 0,content = <<"<color@2>S{1}.{2}</color>赠送<a@goods@{3}></a>X{4}给<color@2>S{5}.{6}</color>，为其增加鲜花{7}朵，<color@1><a@custom@{8}@{9}>我也要送花</a></color>"/utf8>>};

get(223,10) ->
	#language{module_id = 223,id = 10,type = 1,subtype = 10,tip = 0,content = <<"<color@2>{1}</color>赠送<a@goods@{2}></a>X{3}给<color@2>{4}</color>，为其增加鲜花{5}朵，<color@1><a@custom@{6}@{7}>我也要送花</a></color>"/utf8>>};

get(224,1) ->
	#language{module_id = 224,id = 1,type = 1,subtype = 10,tip = 0,content = <<"<color@2>S{1}.{2}</color>散发出无穷魅力，成为<color@3>{3}</color>首位，让我们为TA献花吧~"/utf8>>};

get(224,2) ->
	#language{module_id = 224,id = 2,type = 4,subtype = 10,tip = 0,content = <<"<color@2>S{1}.{2}</color>以<color@2>{3}</color>朵鲜花成为<color@3>{4}</color>，大家撒花庆祝吧~"/utf8>>};

get(224,3) ->
	#language{module_id = 224,id = 3,type = 4,subtype = 10,tip = 0,content = <<"<color@2>S{1}.{2}</color>以<color@2>{3}</color>朵鲜花成为<color@3>{4}</color>，<color@2>S{5}.{6}</color>紧随其后，大家庆祝吧"/utf8>>};

get(224,4) ->
	#language{module_id = 224,id = 4,type = 4,subtype = 10,tip = 0,content = <<"<color@2>S{1}.{2}</color>以<color@2>{3}</color>朵鲜花成为<color@3>{4}</color>，<color@2>S{5}.{6}、S{7}.{8}</color>紧随其后，大家庆祝吧"/utf8>>};

get(232,1) ->
	#language{module_id = 232,id = 1,type = 1,subtype = 10,tip = 0,content = <<"辉光四射,恭喜<color@2><a@player@{1}@{2}></a></color>成功打造出<a@goods4@{3}@{4}@{5}></a> ,附带多种百分比极品属性,只有强者才配拥有!"/utf8>>};

get(232,2) ->
	#language{module_id = 232,id = 2,type = 1,subtype = 10,tip = 0,content = <<"恭喜<color@2><a@player@{1}@{2}></a></color>成功将<a@goods4@{3}@{4}@{5}></a>提升至进化<color@3>{6}级</color>，实力得到巨大加成！"/utf8>>};

get(232,3) ->
	#language{module_id = 232,id = 3,type = 1,subtype = 10,tip = 0,content = <<"恭喜<color@2><a@player@{1}@{2}></a></color>成功将<color@4>{3}</color>全身强化<color@2>+{4}</color>，激活额外属性实力倍增！"/utf8>>};

get(232,4) ->
	#language{module_id = 232,id = 4,type = 1,subtype = 10,tip = 0,content = <<"恭喜<color@2><a@player@{1}@{2}></a></color>成功将<color@3>{3}</color>全身觉醒<color@3>+{4}</color>，圣衣强化属性得到大大提升！"/utf8>>};

get(232,5) ->
	#language{module_id = 232,id = 5,type = 1,subtype = 10,tip = 0,content = <<"恭喜<color@2><a@player@{1}@{2}></a></color>成功将<a@goods4@{3}@{4}@{5}></a>解开封印进行<color@3>启灵</color>，获得巨额属性加成！"/utf8>>};

get(233,1) ->
	#language{module_id = 233,id = 1,type = 1,subtype = 10,tip = 0,content = <<"经过<color@1><a@player@{1}@{2}></a></color>玩家苦心积累，终于激活了<color@2>{3}</color>的<color@3>{5}件{4}阶</color>套装属性，实力大增！"/utf8>>};

get(240,4) ->
	#language{module_id = 240,id = 4,type = 2,subtype = 5,tip = 0,content = <<"<color@0>{1}</color>加入了队伍"/utf8>>};

get(240,5) ->
	#language{module_id = 240,id = 5,type = 2,subtype = 5,tip = 0,content = <<"<color@0>{1}</color>退出了队伍"/utf8>>};

get(240,6) ->
	#language{module_id = 240,id = 6,type = 2,subtype = 5,tip = 0,content = <<"<color@0>{1}</color>被请出了队伍"/utf8>>};

get(240,8) ->
	#language{module_id = 240,id = 8,type = 2,subtype = 10,tip = 0,content = <<"<color@2>{1}</color>正在招募队友--{2}(神创{3}-神创{4}等级)<color@1><a@team@{5}@{6}@{7}>立即加入</a></color>"/utf8>>};

get(240,9) ->
	#language{module_id = 240,id = 9,type = 2,subtype = 10,tip = 0,content = <<"<color@2>{1}</color>正在招募队友--{2}({3}-{4}等级)<color@1><a@team@{5}@{6}@{7}>立即加入</a></color>"/utf8>>};

get(240,10) ->
	#language{module_id = 240,id = 10,type = 2,subtype = 5,tip = 0,content = <<"队长大人赶紧开车！！"/utf8>>};

get(240,11) ->
	#language{module_id = 240,id = 11,type = 2,subtype = 10,tip = 0,content = <<"<color@2>{1}</color>正在招募队友--{2}(神创{3}-{4}等级)<color@1><a@team@{5}@{6}@{7}>立即加入</a></color>"/utf8>>};

get(240,12) ->
	#language{module_id = 240,id = 12,type = 2,subtype = 10,tip = 0,content = <<"<color@2>{1}</color>正在招募队友--{2}({3}-神创{4}等级)<color@1><a@team@{5}@{6}@{7}>立即加入</a></color>"/utf8>>};

get(279,1) ->
	#language{module_id = 279,id = 1,type = 1,subtype = 10,tip = 0,content = <<"天启之源将于{1}分钟后开启，请阴阳师们做好准备！"/utf8>>};

get(279,2) ->
	#language{module_id = 279,id = 2,type = 1,subtype = 10,tip = 0,content = <<"天启之源已正式开启！{1}分钟后停止入场，参与天启之源获取高战圣装！<color@3><a@open_fun@136>【立即前往】</a></color>"/utf8>>};

get(279,3) ->
	#language{module_id = 279,id = 3,type = 1,subtype = 10,tip = 0,content = <<"恭喜<color@2>S{1}.{2}</color>成功击杀{3}的{4}，S{5}.{6}获得进入天启之源场景的资格！<color@3><a@open_fun@136>【立即前往】</a></color>"/utf8>>};

get(279,4) ->
	#language{module_id = 279,id = 4,type = 1,subtype = 10,tip = 0,content = <<"威武惊人！<color@2>S{1}.{2}</color>成功将{3}击杀！！！"/utf8>>};

get(279,5) ->
	#language{module_id = 279,id = 5,type = 1,subtype = 10,tip = 0,content = <<"天启之源活动已结束，期待您的下次参与！"/utf8>>};

get(279,6) ->
	#language{module_id = 279,id = 6,type = 1,subtype = 10,tip = 0,content = <<"{1}已刷新，获得{2}归属的服务器即可获得进入天启之源的资格！"/utf8>>};

get(279,7) ->
	#language{module_id = 279,id = 7,type = 1,subtype = 10,tip = 0,content = <<"恭喜<color@2>S{1}.{2}</color>成功击杀{3}的{4}，S{5}.{6}获得进入天启之源场景的资格！"/utf8>>};

get(280,1) ->
	#language{module_id = 280,id = 1,type = 1,subtype = 10,tip = 0,content = <<"<color@2>{1}</color>成功击败<color@2>{2}</color>，夺得竞技场赛第<color@3>{3}</color>名的宝座"/utf8>>};

get(281,1) ->
	#language{module_id = 281,id = 1,type = 1,subtype = 10,tip = 1,content = <<"巅峰竞技玩法已限时开启,赶紧前往竞技,铸就巅峰吧!"/utf8>>};

get(283,1) ->
	#language{module_id = 283,id = 1,type = 3,subtype = 4,tip = 0,content = <<"请注意！我方异域中的{1}级大妖正在被攻击！<a@sanctuary@{2}@{3}>前往守护</a>"/utf8>>};

get(284,0) ->
	#language{module_id = 284,id = 0,type = 1,subtype = 10,tip = 0,content = <<"<color@2><a@player@{1}@{2}></a></color>将{3}<color@5>{4}</color>化成灰烬!获得令人垂涎欲滴的<a@goods3@{5}@{6}@{7}></a>!"/utf8>>};

get(284,1) ->
	#language{module_id = 284,id = 1,type = 1,subtype = 10,tip = 0,content = <<"<color@2><a@player@{1}@{2}></a></color>将{3}<color@5>{4}</color>化成灰烬!获得令人垂涎欲滴的<a@goods3@{5}@{6}@{7}></a>!"/utf8>>};

get(284,2) ->
	#language{module_id = 284,id = 2,type = 1,subtype = 10,tip = 0,content = <<"<color@2><a@player@{1}@{2}></a></color>小宇宙爆发,从{3}<color@5>{4}</color>身上打出了<a@goods3@{5}@{6}@{7}></a>！"/utf8>>};

get(284,3) ->
	#language{module_id = 284,id = 3,type = 1,subtype = 10,tip = 0,content = <<"跨服异域将在<color@1>{1}分钟</color>后自动关闭，每天9：00-次日2：00为活动开放时间。"/utf8>>};

get(284,4) ->
	#language{module_id = 284,id = 4,type = 1,subtype = 10,tip = 0,content = <<"<color@2>{1}</color>玩家以<color@1>{2}</color>贡献值带领<color@4>{3}</color>成功占领<color@5>{4}</color>"/utf8>>};

get(285,1) ->
	#language{module_id = 285,id = 1,type = 1,subtype = 10,tip = 0,content = <<"5分钟后开启午间派对，丰厚宝箱、海量经验等你来拿！"/utf8>>};

get(285,2) ->
	#language{module_id = 285,id = 2,type = 1,subtype = 10,tip = 0,content = <<"午间派对已正式开启，一起参加派对获取丰厚奖励吧！<color@1><a@open_fun@109>立即前往</a></color>"/utf8>>};

get(285,3) ->
	#language{module_id = 285,id = 3,type = 1,subtype = 10,tip = 0,content = <<"午间派对已结束，期待下一次您的参与！"/utf8>>};

get(286,1) ->
	#language{module_id = 286,id = 1,type = 1,subtype = 10,tip = 0,content = <<"<color@2>{1}</color>集齐<color@5>全套{2}星天启圣装</color>,激活酷炫专属{3}外形!"/utf8>>};

get(331,1) ->
	#language{module_id = 331,id = 1,type = 1,subtype = 10,tip = 0,content = <<"霹雳啪啦哐当一声巨响，<color@2>{1}</color>人品爆表，居然砸出了<color@{2}><a@goods@{3}></a>x{4}</color>，<color@4><a@moneyTree@{5}@{6}>我要砸蛋</a></color>！"/utf8>>};

get(331,2) ->
	#language{module_id = 331,id = 2,type = 1,subtype = 10,tip = 0,content = <<"震惊！<color@2>{1}</color>臂力过人，竟然在砸蛋活动中砸出了<color@{2}><a@goods@{3}></a>x{4}</color>，<color@4><a@moneyTree@{5}@{6}>我要砸蛋</a></color>！"/utf8>>};

get(331,3) ->
	#language{module_id = 331,id = 3,type = 1,subtype = 0,tip = 0,content = <<"新的云购又可以随便买买买了，下一个欧皇会是谁呢"/utf8>>};

get(331,4) ->
	#language{module_id = 331,id = 4,type = 1,subtype = 0,tip = 0,content = <<"<color@2>{1}</color>获得幸运女神的眷顾，喜中大奖羡煞旁人～～～"/utf8>>};

get(331,5) ->
	#language{module_id = 331,id = 5,type = 1,subtype = 10,tip = 1,content = <<"<color@1>【{1}】</color>活动已开启，快去野外场景击杀大妖，<color@4>稀有羽翼</color>和<color@4>珍贵戒指</color>等你来拿！"/utf8>>};

get(331,6) ->
	#language{module_id = 331,id = 6,type = 1,subtype = 10,tip = 1,content = <<"<color@1>【{1}】</color>活动暂时结束，请大家关注下一次活动开启时间！"/utf8>>};

get(331,7) ->
	#language{module_id = 331,id = 7,type = 1,subtype = 10,tip = 1,content = <<"<color@2><a@player@{1}@{2}></a></color>在<color@0>{3}</color>给予<color@4>{4}</color>最后一击，目前一共还剩<color@4>{5}只</color>大妖！"/utf8>>};

get(331,8) ->
	#language{module_id = 331,id = 8,type = 1,subtype = 10,tip = 1,content = <<"<color@2><a@player@{1}@{2}></a></color>在<color@0>{3}</color>拾取了<color@4>{4}</color>掉落的<a@goods3@{5}@{6}@{7}></a>，真是羡煞众人！"/utf8>>};

get(331,9) ->
	#language{module_id = 331,id = 9,type = 1,subtype = 10,tip = 1,content = <<"恭喜<color@2>{1}</color>在<color@1>{2}</color>拿下<color@4>{3}</color>首杀"/utf8>>};

get(331,10) ->
	#language{module_id = 331,id = 10,type = 1,subtype = 10,tip = 0,content = <<"<color@2><a@player@{1}@{2}></a></color>人品爆发，在幸运鉴宝活动中鉴定出<color@{3}><a@goods@{4}></a>x{5}</color>！<color@0><a@lucky_acc>我要鉴宝</a></color>"/utf8>>};

get(331,11) ->
	#language{module_id = 331,id = 11,type = 1,subtype = 10,tip = 0,content = <<"<a@goods1@{1}></a>全服提交数量达到<color@0>{2}</color>，<color@3>经验双倍</color>开启啦，打怪获得的经验将增加<color@0>100%</color>。"/utf8>>};

get(331,12) ->
	#language{module_id = 331,id = 12,type = 1,subtype = 10,tip = 0,content = <<"<a@goods1@{1}></a>全服提交数量达到<color@0>{2}</color>，<color@3>掉落双倍</color>开启啦，财源滚滚、万物有灵掉落将<color@0>翻倍</color>。<color@0><a@elf_area>立即前往</a></color>"/utf8>>};

get(331,13) ->
	#language{module_id = 331,id = 13,type = 1,subtype = 10,tip = 0,content = <<"<a@goods1@{1}></a>全服提交数量达到<color@0>{2}</color>，触发<color@3>大妖重置</color>，所有的本服大妖已刷新，阴阳师们赶快前往挑战吧！。"/utf8>>};

get(331,14) ->
	#language{module_id = 331,id = 14,type = 1,subtype = 10,tip = 0,content = <<"<a@goods1@{1}></a>全服提交数量达到<color@0>{2}</color>，触发<color@3>全服礼包</color>，快前往领取吧！<color@0><a@mail>立即前往</a></color>"/utf8>>};

get(331,15) ->
	#language{module_id = 331,id = 15,type = 1,subtype = 10,tip = 0,content = <<"<color@2><a@player@{1}@{2}></a></color>成功获得<color@4>{3}</color>，将<color@3>{4}</color>揽入怀中！更多勾玉等你免费来拿！"/utf8>>};

get(331,16) ->
	#language{module_id = 331,id = 16,type = 1,subtype = 10,tip = 0,content = <<"恭喜<color='#ef4136'>壕情万丈、壕无人性、人中壕杰</color>的<color@2><a@player@{1}@{2}></a></color>勇夺充值排行第{3}名，让我们壕不犹豫地恭喜他们吧！"/utf8>>};

get(331,17) ->
	#language{module_id = 331,id = 17,type = 1,subtype = 10,tip = 0,content = <<"本期跨服云购已开奖，恭喜获得大奖的阴阳师！下期云购期待大家的参与！"/utf8>>};

get(331,18) ->
	#language{module_id = 331,id = 18,type = 1,subtype = 10,tip = 0,content = <<"玩家名字人品爆发，在<color@2>{1}</color>活动中获得[{2}]*{3}!我要云购"/utf8>>};

get(331,19) ->
	#language{module_id = 331,id = 19,type = 1,subtype = 10,tip = 0,content = <<"恭喜<color='#ef4136'>壕情万丈、壕无人性、人中壕杰</color>的<color@2><a@player@{1}@{2}></a></color>勇夺消费排行第{3}名，让我们壕不犹豫地恭喜他们吧！"/utf8>>};

get(331,20) ->
	#language{module_id = 331,id = 20,type = 1,subtype = 10,tip = 0,content = <<"恭喜<color@2>{1}</color>人品大爆发，在<color@0>{2}</color>中获得了<a@goods@{3}></a>x{4}"/utf8>>};

get(331,21) ->
	#language{module_id = 331,id = 21,type = 1,subtype = 10,tip = 0,content = <<"<color@2><a@player@{1}@{2}></a></color>玩家成功购买<color@4>{3}</color>，获得惊喜大礼，还能获得全额勾玉返还，<color@4><a@zore@{4}@{5}>我也要买</a></color>"/utf8>>};

get(331,22) ->
	#language{module_id = 331,id = 22,type = 1,subtype = 0,tip = 0,content = <<"很遗憾本期云购无人中奖，请再接再厉，也许下一位幸运之子就是您！"/utf8>>};

get(331,23) ->
	#language{module_id = 331,id = 23,type = 1,subtype = 10,tip = 0,content = <<"<color@2><a@player@{1}@{2}></a></color>摇摇乐活动获得<a@goods@{3}></a>，战力大增，<color@4><a@custom@{4}@{5}>试试手气</a></color>！"/utf8>>};

get(331,24) ->
	#language{module_id = 331,id = 24,type = 1,subtype = 10,tip = 0,content = <<"<color@2>{1}</color>领取到了累充大奖，战力大增。<color@4><a@moneyTree@{2}@{3}>我要领取</a></color>"/utf8>>};

get(331,25) ->
	#language{module_id = 331,id = 25,type = 1,subtype = 10,tip = 0,content = <<"<color@2><a@player@{1}@{2}></a></color>玩家在<color@4>许愿树</color>抽取到<a@goods@{3}></a>，羡煞旁人，<color@4><a@moneyTree@{4}@{5}>前往抽取</a></color>"/utf8>>};

get(331,26) ->
	#language{module_id = 331,id = 26,type = 1,subtype = 0,tip = 0,content = <<"各位阴阳师，新的一批云购开启了，各位阴阳师可以速速前往参与，手快有手慢无啊"/utf8>>};

get(331,27) ->
	#language{module_id = 331,id = 27,type = 1,subtype = 10,tip = 0,content = <<"怪物攻城将于{1}分钟后开始,请各位阴阳师做好准备,保卫水晶!"/utf8>>};

get(331,28) ->
	#language{module_id = 331,id = 28,type = 1,subtype = 10,tip = 0,content = <<"怪物攻城开始,请各位阴阳师立即前往保卫水晶!开启宝箱更可获得丰厚奖励!"/utf8>>};

get(331,29) ->
	#language{module_id = 331,id = 29,type = 1,subtype = 10,tip = 0,content = <<"{1}玩家购买{2}限时礼包，战力大增，<color@4><a@custom@{3}@{4}>我也要买</a></color>"/utf8>>};

get(331,30) ->
	#language{module_id = 331,id = 30,type = 1,subtype = 10,tip = 0,content = <<"<color@2><a@player@{1}@{2}></a></color>玩家提交任务，获得珍稀道具<a@goods@{3}></a>，战力大增，<color@4><a@moneyTree@{4}@{5}>立即提交。</a></color>"/utf8>>};

get(331,31) ->
	#language{module_id = 331,id = 31,type = 1,subtype = 10,tip = 0,content = <<"<color@2><a@player@{1}@{2}></a></color>坐骑活动中，玩家抽取到<a@goods@{3}></a>，战力大增，<color@4><a@custom@{4}@{5}>我也要转。</a></color>"/utf8>>};

get(331,32) ->
	#language{module_id = 331,id = 32,type = 1,subtype = 10,tip = 0,content = <<"<color@2><a@player@{1}@{2}></a></color>从赛博夺宝中抽取到<a@goods@{3}></a>，真是让人羡慕，<color@4><a@custom@{4}@{5}>前往夺宝。</a></color>"/utf8>>};

get(331,33) ->
	#language{module_id = 331,id = 33,type = 1,subtype = 10,tip = 0,content = <<"<color@2><a@player@{1}@{2}></a></color>按下扭蛋按钮，打开扭蛋竟获得了<a@goods@{3}></a>，真是运气爆表！<color@4><a@custom@{4}@{5}>前往扭蛋</a></color>"/utf8>>};

get(331,34) ->
	#language{module_id = 331,id = 34,type = 1,subtype = 10,tip = 0,content = <<"<color@2><a@player@{1}@{2}></a></color>欧气爆发，在绑玉转盘中获得<color@4>{3}倍绑玉</color>返利，<color@4><a@custom@{4}@{5}>我要试试</a></color>"/utf8>>};

get(331,35) ->
	#language{module_id = 331,id = 35,type = 1,subtype = 10,tip = 0,content = <<"<color@2><a@player@{1}@{2}></a></color>一掷千金，购买了<color@4>{3}</color>，获得了<color@4>{4}</color>，更有<color@4>{5}</color>天豪礼领取！真让人羡慕。<color@4><a@custom@{6}@{7}>我要购买</a></color>"/utf8>>};

get(331,36) ->
	#language{module_id = 331,id = 36,type = 1,subtype = 10,tip = 0,content = <<"<color@2><a@player@{1}@{2}></a></color>进行了神圣召唤，召唤获得<a@goods@{3}></a>，真是运气爆表！<color@4><a@custom@{4}@{5}>前往召唤</a></color>"/utf8>>};

get(331,37) ->
	#language{module_id = 331,id = 37,type = 1,subtype = 10,tip = 0,content = <<"<color@2><a@player@{1}@{2}></a></color>向上天祈愿，在神灵的庇佑下，他竟获得了{3}<a@goods@{4}></a> x {5}！<color@4><a@custom@{6}@{7}>前往祈愿</a></color>"/utf8>>};

get(331,38) ->
	#language{module_id = 331,id = 38,type = 4,subtype = 10,tip = 0,content = <<"<color@2><a@player@{1}@{2}></a></color>向上天祈愿，在神灵的庇佑下，他竟获得了{3}<a@goods@{4}></a> * {5}！<color@4><a@custom@{6}@{7}>前往祈愿</a></color>"/utf8>>};

get(331,39) ->
	#language{module_id = 331,id = 39,type = 1,subtype = 10,tip = 0,content = <<"<color@2><a@player@{1}@{2}></a></color>在{3}购买了超珍贵道具<a@goods@{4}></a>，数量有限，先到先得，<color@4><a@custom@{5}@{6}>前往抢购！</a></color>"/utf8>>};

get(331,40) ->
	#language{module_id = 331,id = 40,type = 1,subtype = 10,tip = 0,content = <<"<color@2><a@player@{1}@{2}></a></color>参与至尊探宝活动，竟获得了传说奖励<a@goods@{3}></a>*{4}！<color@4><a@custom@{5}@{6}>前往探宝</a></color>！"/utf8>>};

get(331,41) ->
	#language{module_id = 331,id = 41,type = 1,subtype = 10,tip = 0,content = <<"恭喜<color@2><a@player@{1}@{2}></a></color>在幸运占卜中获得大奖<a@goods@{3}></a> * {4}！<color@4><a@custom@{5}@{6}>前往占卜</a></color>"/utf8>>};

get(331,42) ->
	#language{module_id = 331,id = 42,type = 4,subtype = 10,tip = 0,content = <<"<color@4>资源本收益双倍</color>已触发，奖励多多，<color@1><a@open_fun@53>立即前往</a></color>"/utf8>>};

get(331,43) ->
	#language{module_id = 331,id = 43,type = 4,subtype = 10,tip = 0,content = <<"<color@4>经验本收益双倍</color>已触发，奖励多多，<color@1><a@open_fun@7>立即前往</a></color>"/utf8>>};

get(331,44) ->
	#language{module_id = 331,id = 44,type = 4,subtype = 10,tip = 0,content = <<"<color@4>装备寻宝满幸运值</color>已触发，奖励多多，<color@1><a@open_fun@71>立即前往</a></color>"/utf8>>};

get(331,45) ->
	#language{module_id = 331,id = 45,type = 4,subtype = 10,tip = 0,content = <<"<color@4>本服大妖复活</color>已触发，奖励多多，<color@1><a@open_fun@26>立即前往</a></color>"/utf8>>};

get(331,46) ->
	#language{module_id = 331,id = 46,type = 4,subtype = 10,tip = 0,content = <<"恭喜<color@2><a@player@{1}@{2}></a></color>在<color@3>幸运探宝</color>活动中获得珍稀奖励<color@{4}><a@goods@{3}></a></color>*{4}，欧皇附身，<color@1><a@custom@{5}@{6}>我也试试</a></color>"/utf8>>};

get(331,47) ->
	#language{module_id = 331,id = 47,type = 4,subtype = 10,tip = 0,content = <<"恭喜<color@2><a@player@{1}@{2}></a></color>获得<color@3>活跃大转盘</color>的幸运大奖<a@goods@{3}></a></color> * {4}，还有更多大奖，<color@1><a@custom@{5}@{6}>等你抽取</a></color>"/utf8>>};

get(331,48) ->
	#language{module_id = 331,id = 48,type = 1,subtype = 10,tip = 0,content = <<"<color@2>{1}</color>已激活，将在<color@2>{2}</color>准时开启，数量有限，抢完为止！"/utf8>>};

get(331,49) ->
	#language{module_id = 331,id = 49,type = 1,subtype = 10,tip = 0,content = <<"第{1}波红包将在{2}秒后开始"/utf8>>};

get(331,50) ->
	#language{module_id = 331,id = 50,type = 1,subtype = 10,tip = 0,content = <<"恭喜<color@2><a@player@{1}@{2}></a></color>在<color@3>{3}</color>活动中获得珍稀奖励<a@goods@{4}></a> * {5}"/utf8>>};

get(331,51) ->
	#language{module_id = 331,id = 51,type = 4,subtype = 10,tip = 0,content = <<"恭喜玩家{1}首杀大妖之家四层【金鳞幼龙】，获得奖励100元天猫卡*1"/utf8>>};

get(331,52) ->
	#language{module_id = 331,id = 52,type = 4,subtype = 10,tip = 0,content = <<"恭喜<color@2><a@player@{1}@{2}></a></color>获得<color@3>充值转盘</color>的幸运大奖<a@goods@{3}></a></color> * {4}，还有更多大奖，<color@1><a@custom@{5}@{6}>等你抽取</a></color>"/utf8>>};

get(331,53) ->
	#language{module_id = 331,id = 53,type = 1,subtype = 10,tip = 0,content = <<"<color@2><a@player@{1}@{2}></a></color>进行了许愿盛典，召唤获得<a@goods@{3}></a>，真是运气爆表！<color@4><a@custom@{4}@{5}>前往召唤</a></color>"/utf8>>};

get(331,54) ->
	#language{module_id = 331,id = 54,type = 1,subtype = 10,tip = 0,content = <<"<color@2><a@player@{1}@{2}></a></color>转动招财猫转盘，获得<a@goods@{3}></a>*{4}，真是运气爆表！<color@4><a@custom@{5}@{6}>前往招财猫</a></color>"/utf8>>};

get(331,55) ->
	#language{module_id = 331,id = 55,type = 1,subtype = 10,tip = 0,content = <<"恭喜<color@2><a@player@{1}@{2}></a></color>玩家激活传说契约，可领取额外丰厚特权奖励。<color@4><a@custom@{3}@{4}>前往激活</a></color>"/utf8>>};

get(331,56) ->
	#language{module_id = 331,id = 56,type = 4,subtype = 10,tip = 0,content = <<"<color@2><a@player@{1}@{2}></a></color>成功进行星际旅行，获得了行星赠礼。<color@4><a@custom@{4}@{5}>参与星际旅行</a></color>"/utf8>>};

get(331,57) ->
	#language{module_id = 331,id = 57,type = 1,subtype = 10,tip = 0,content = <<"<color@2><a@player@{1}@{2}></a></color>天命降临，转动天命转盘竟获得了<a@goods@{3}></a> * {4}，真是运气爆表！<color@4><a@custom@{5}@{6}>我也要参与</a></color>"/utf8>>};

get(331,58) ->
	#language{module_id = 331,id = 58,type = 1,subtype = 10,tip = 0,content = <<"<color@1>{1}</color>成功购买了{2}，战力更上一层楼，<color@2><a@custom@{3}@{4}>前往购买</a></color>"/utf8>>};

get(331,59) ->
	#language{module_id = 331,id = 59,type = 1,subtype = 10,tip = 0,content = <<"幸运驾到，好运来袭，祝贺<color@2><a@player@{1}@{2}></a></color>在幸运鉴宝中获得<a@goods@{3}></a>，<color@1><a@custom@{4}@{5}>立即前往</a></color>"/utf8>>};

get(331,60) ->
	#language{module_id = 331,id = 60,type = 4,subtype = 10,tip = 0,content = <<"<color@2><a@player@{1}@{2}></a></color>在幸运扭蛋中，抽到<a@goods@{3}></a>，战力大增，<color@4><a@custom@{4}@{5}>我也要抽。</a></color>"/utf8>>};

get(331,61) ->
	#language{module_id = 331,id = 61,type = 1,subtype = 10,tip = 0,content = <<"<color@2><a@player@{1}@{2}></a></color>在{3}购买了超值<a@goods@{4}></a>礼包，折扣多多，<color@4><a@custom@{5}@{6}>前往抢购！</a></color>"/utf8>>};

get(331,62) ->
	#language{module_id = 331,id = 62,type = 1,subtype = 10,tip = 0,content = <<"恭喜<color@2><a@player@{1}@{2}></a></color>在<color@3>幸运探宝</color>活动中获得珍稀奖励<color@{4}><a@goods@{3}></a></color>*{4}，欧皇附身，<color@1><a@custom@{5}@{6}>我也试试</a></color>"/utf8>>};

get(331,63) ->
	#language{module_id = 331,id = 63,type = 4,subtype = 10,tip = 0,content = <<"<color@2><a@player@{1}@{2}></a></color>在幸运鉴宝中，觅得大奖<a@goods@{3}></a>，<color@4><a@custom@{4}@{5}>我也要鉴宝。</a></color>"/utf8>>};

get(331,64) ->
	#language{module_id = 331,id = 64,type = 4,subtype = 10,tip = 0,content = <<"<color@2><a@player@{1}@{2}></a></color>购买了<color@1>{3}</color>件冲榜特惠礼包，享受超低折扣。<color@4><a@open_fun@331112>我也要购买</a></color>"/utf8>>};

get(331,65) ->
	#language{module_id = 331,id = 65,type = 1,subtype = 10,tip = 0,content = <<"恭喜<color@1><a@player@{1}@{2}></a></color>达成连充天数，领取连充豪华大奖<color@5><a@goods@{3}></a></color>！"/utf8>>};

get(331,66) ->
	#language{module_id = 331,id = 66,type = 1,subtype = 10,tip = 0,content = <<"<color@1><a@player@{1}@{2}></a></color>领取了连充豪礼，达成连充天数更有豪华大奖<color@5><a@goods@{3}></a></color>！"/utf8>>};

get(331,67) ->
	#language{module_id = 331,id = 67,type = 1,subtype = 10,tip = 0,content = <<"1折秒杀，<color@2><a@player@{1}@{2}></a></color>购买了<color@1>{3}礼包</color>，折扣满满，优惠多多!<color@4><a@custom@{4}@{5}>前往购买</a></color>"/utf8>>};

get(331,68) ->
	#language{module_id = 331,id = 68,type = 1,subtype = 10,tip = 0,content = <<"折上折，<color@2><a@player@{1}@{2}></a></color>打包购买<color@1>{3}礼包</color>，优惠拉满，奖励多多！<color@4><a@custom@{4}@{5}>前往购买</a></color>"/utf8>>};

get(331,69) ->
	#language{module_id = 331,id = 69,type = 1,subtype = 10,tip = 0,content = <<"运气爆棚，恭喜<color@5>S{1}.</color><color@5><a@player@{2}@{3}></a></color>在<color@5>{4}</color>活动中获得珍稀奖励<color@5><a@goods@{5}></a></color>。<color@1><a@open_fun@331116>立即前往</a></color>"/utf8>>};

get(331,70) ->
	#language{module_id = 331,id = 70,type = 1,subtype = 10,tip = 0,content = <<"<color@2><a@player@{1}@{2}></a></color>购买十倍返利<color@5>{3}</color>，海量礼包1折限购！"/utf8>>};

get(331,71) ->
	#language{module_id = 331,id = 71,type = 4,subtype = 10,tip = 0,content = <<"<color@4>资源本收益+15%</color>已触发，奖励多多，<color@1><a@open_fun@53>立即前往</a></color>"/utf8>>};

get(331,72) ->
	#language{module_id = 331,id = 72,type = 1,subtype = 10,tip = 0,content = <<"恭喜<color@2>{1}</color>领取了累充赠礼奖励，战力大增！<color@4><a@custom@{2}@{3}>我也要领取</a></color>"/utf8>>};

get(331,73) ->
	#language{module_id = 331,id = 73,type = 1,subtype = 10,tip = 0,content = <<"恭喜<color@2>{1}</color>领取了单笔充值奖励，奖励多多！<color@4><a@custom@{2}@{3}>前往领取</a></color>"/utf8>>};

get(331,74) ->
	#language{module_id = 331,id = 74,type = 1,subtype = 10,tip = 0,content = <<"<color@2><a@player@{1}@{2}></a></color>进行绑玉祈愿，获得<a@goods@{3}></a>*{4}，真是运气爆表！<color@4><a@custom@{5}@{6}>前往绑玉祈愿</a></color>"/utf8>>};

get(331,75) ->
	#language{module_id = 331,id = 75,type = 1,subtype = 10,tip = 0,content = <<"绝版秒杀，<color@2><a@player@{1}@{2}></a></color>购买了<color@5>绝版{3}礼包</color>，折扣满满，优惠多多!<color@4><a@custom@{4}@{5}>前往购买</a></color>"/utf8>>};

get(331,76) ->
	#language{module_id = 331,id = 76,type = 1,subtype = 10,tip = 0,content = <<"折上折，<color@2><a@player@{1}@{2}></a></color>打包购买<color@5>绝版{3}礼包</color>，优惠拉满，奖励多多！<color@4><a@custom@{4}@{5}>前往购买</a></color>"/utf8>>};

get(332,1) ->
	#language{module_id = 332,id = 1,type = 1,subtype = 10,tip = 0,content = <<"神兵加持！<color@2>{1}</color>成功租借<color@3>{2}</color>，战力获得了极大提升！<color@3><a@open_fun@74>立即前往</a></color>"/utf8>>};

get(332,2) ->
	#language{module_id = 332,id = 2,type = 4,subtype = 10,tip = 0,content = <<"恭喜<color@2>{1}</color>获得<color@3>{2}</color>的幸运大奖，奖励已发送邮箱；还有更多大奖，敬请关注！"/utf8>>};

get(332,3) ->
	#language{module_id = 332,id = 3,type = 1,subtype = 10,tip = 0,content = <<"<color@3>{1}</color>将于{2}:{3}（{4}分钟后）开始抽取，满足抽奖条件的玩家千万不要错过！{5}等你来取！"/utf8>>};

get(332,4) ->
	#language{module_id = 332,id = 4,type = 1,subtype = 10,tip = 0,content = <<"<color@2>{1}</color>成功交付了订金，以超低价参与<color@3>{2}</color>团购，参团人数越多，价格越优惠。"/utf8>>};

get(332,5) ->
	#language{module_id = 332,id = 5,type = 1,subtype = 10,tip = 0,content = <<"跨服团购，立享折扣！<color@{1}>{2}</color>现享<color@1>{3}</color>折，全服再订<color@5>{4}</color>件即可享更高折扣，快来组团订购吧！<color@1><a@groupbuy@{5}@{6}@{7}}>前往订购</a></color>"/utf8>>};

get(332,6) ->
	#language{module_id = 332,id = 6,type = 1,subtype = 10,tip = 0,content = <<"跨服团购，立享折扣！<color@{1}>{2}</color>现享<color@1>{3}</color>折，已达最高折扣，快来组团订购吧！<color@1><a@groupbuy@{5}@{6}@{7}>前往订购</a></color>"/utf8>>};

get(332,7) ->
	#language{module_id = 332,id = 7,type = 1,subtype = 10,tip = 0,content = <<"<color@{1}><a@goods@{2}>{3}</a> </color>x{4}现享<color@1>{5}</color>折，全服再订<color@5>{6}</color>件即可享更高折扣！<color@1><a@groupbuy@{7}@{8}@{9}>前往订购</a></color>"/utf8>>};

get(332,8) ->
	#language{module_id = 332,id = 8,type = 1,subtype = 10,tip = 0,content = <<"<color@{1}><a@goods@{2}>{3}</a></color>x{4}现享<color@1>{5}</color>折，已达最高折扣！<color@1><a@groupbuy@{6}@{7}@{8}>前往订购</a></color>"/utf8>>};

get(332,9) ->
	#language{module_id = 332,id = 9,type = 1,subtype = 10,tip = 0,content = <<"<color@2>{1}</color>成功交付了订金，以超低价参与<a@goods@{2}></a>x{3}团购，参团人数越多，价格越优惠。"/utf8>>};

get(338,1) ->
	#language{module_id = 338,id = 1,type = 1,subtype = 10,tip = 1,content = <<"恭喜<color@1><a@player2@{1}@{2}@{3}></a></color>在<color@4>坐骑竞榜</color>中获得<color@4>{4}×{5}</color>，运气十足，实力更进一步，<color@1><a@race_act@{6}@{7}>我也要抽</a></color>"/utf8>>};

get(338,2) ->
	#language{module_id = 338,id = 2,type = 1,subtype = 10,tip = 0,content = <<"恭喜<color@1><a@player2@{1}@{2}@{3}></a></color>在<color@4>伙伴竞榜</color>中获得<color@4>{4}×{5}</color>，运气十足，实力更进一步，<color@1><a@race_act@{6}@{7}>我也要抽</a></color>"/utf8>>};

get(338,3) ->
	#language{module_id = 338,id = 3,type = 1,subtype = 10,tip = 0,content = <<"恭喜<color@1><a@player2@{1}@{2}@{3}></a></color>在<color@4>套装竞榜</color>中获得<color@4>{4}×{5}</color>，运气十足，实力更进一步，<color@1><a@race_act@{6}@{7}>我也要抽</a></color>"/utf8>>};

get(338,4) ->
	#language{module_id = 338,id = 4,type = 1,subtype = 10,tip = 0,content = <<"恭喜<color@1><a@player2@{1}@{2}@{3}></a></color>在<color@4>宝宝竞榜</color>中获得<color@4>{4}×{5}</color>，运气十足，实力更进一步，<color@1><a@race_act@{6}@{7}>我也要抽</a></color>"/utf8>>};

get(338,9) ->
	#language{module_id = 338,id = 9,type = 1,subtype = 10,tip = 0,content = <<"恭喜<color@1><a@player2@{1}@{2}@{3}></a></color>在<color@4>降神竞榜</color>中获得<color@4>{4}×{5}</color>，运气十足，实力更进一步，<color@1><a@race_act@{6}@{7}>我也要抽</a></color>"/utf8>>};

get(338,10) ->
	#language{module_id = 338,id = 10,type = 1,subtype = 10,tip = 0,content = <<"恭喜<color@1><a@player2@{1}@{2}@{3}></a></color>在<color@4>羽翼竞榜</color>中获得<color@4>{4}×{5}</color>，运气十足，实力更进一步，<color@1><a@race_act@{6}@{7}>我也要抽</a></color>"/utf8>>};

get(338,11) ->
	#language{module_id = 338,id = 11,type = 1,subtype = 10,tip = 0,content = <<"恭喜<color@1><a@player2@{1}@{2}@{3}></a></color>在<color@4>妖灵竞榜</color>中获得<color@4>{4}×{5}</color>，运气十足，实力更进一步，<color@1><a@race_act@{6}@{7}>我也要抽</a></color>"/utf8>>};

get(338,12) ->
	#language{module_id = 338,id = 12,type = 1,subtype = 10,tip = 0,content = <<"恭喜<color@1><a@player2@{1}@{2}@{3}></a></color>在<color@4>背饰竞榜</color>中获得<color@4>{4}×{5}</color>，运气十足，实力更进一步，<color@1><a@race_act@{6}@{7}>我也要抽</a></color>"/utf8>>};

get(339,1) ->
	#language{module_id = 339,id = 1,type = 2,subtype = 4,tip = 0,content = <<"{1}【<color@1><a@red_envelopes>去抢红包</a></color>】"/utf8>>};

get(339,3) ->
	#language{module_id = 339,id = 3,type = 2,subtype = 4,tip = 0,content = <<"恭喜大家齐心协力成功击杀八岐大蛇，获得丰厚的绑玉红包奖励！【<color@1><a@red_envelopes>去抢红包</a></color>】"/utf8>>};

get(339,100) ->
	#language{module_id = 339,id = 100,type = 2,subtype = 4,tip = 0,content = <<"{1}壕气十足，一出手就是<color@1>{2}勾玉</color>的大红包！大家赶紧抢红包呀！【<color@1><a@red_envelopes>去抢红包</a></color>】"/utf8>>};

get(400,1) ->
	#language{module_id = 400,id = 1,type = 2,subtype = 4,tip = 0,content = <<"<color@2>{1}</color>成为结社领袖！真是一位具有领袖气质的成员呢！"/utf8>>};

get(400,2) ->
	#language{module_id = 400,id = 2,type = 2,subtype = 4,tip = 0,content = <<"<color@2>{1}</color>成为结社会长！希望你能让结社变的更加强大！"/utf8>>};

get(400,3) ->
	#language{module_id = 400,id = 3,type = 2,subtype = 4,tip = 0,content = <<"<color@2>{1}</color>成为结社副会长！协助会长的重任就交给你了！"/utf8>>};

get(400,4) ->
	#language{module_id = 400,id = 4,type = 2,subtype = 4,tip = 0,content = <<"<color@2>{1}</color>成为结社理事！真是个明智的选择！"/utf8>>};

get(400,5) ->
	#language{module_id = 400,id = 5,type = 2,subtype = 4,tip = 0,content = <<"欢迎「<color@3>{1}</color>」成为结社一员，大家热烈欢迎！<color@2>【<a@guildjoin@{2}>调戏一下</a>】</color>"/utf8>>};

get(400,7) ->
	#language{module_id = 400,id = 7,type = 1,subtype = 1,tip = 0,content = <<"哇哦，<color@2>{1}</color>创建了结社<color@2>{2}</color>。精彩活动，强力技能，每日工资等你来拿！<color@1><a@guildapply@{3}><我要加入></a></color>"/utf8>>};

get(400,8) ->
	#language{module_id = 400,id = 8,type = 3,subtype = 0,tip = 0,content = <<"获得结社贡献：<color@0>{1}</color>"/utf8>>};

get(400,9) ->
	#language{module_id = 400,id = 9,type = 3,subtype = 0,tip = 0,content = <<"获得结社资金：<color@0>{1}</color>"/utf8>>};

get(400,10) ->
	#language{module_id = 400,id = 10,type = 1,subtype = 1,tip = 0,content = <<"结社<color@2>{1}</color>改名为<color@2>{2}</color>"/utf8>>};

get(400,11) ->
	#language{module_id = 400,id = 11,type = 3,subtype = 0,tip = 0,content = <<"获得结社成长值：<color@0>{1}</color>"/utf8>>};

get(400,12) ->
	#language{module_id = 400,id = 12,type = 2,subtype = 4,tip = 0,content = <<"{1}"/utf8>>};

get(400,13) ->
	#language{module_id = 400,id = 13,type = 2,subtype = 4,tip = 0,content = <<"注意！第{1}层{2}入口是【{3}】"/utf8>>};

get(400,14) ->
	#language{module_id = 400,id = 14,type = 2,subtype = 4,tip = 0,content = <<"表彰<color@2>{1}</color>做出的卓越贡献,授予他[<color@3>{2}</color>]头衔"/utf8>>};

get(400,15) ->
	#language{module_id = 400,id = 15,type = 2,subtype = 4,tip = 0,content = <<"{1}"/utf8>>};

get(401,1) ->
	#language{module_id = 401,id = 1,type = 2,subtype = 4,tip = 0,content = <<"<color@3>{1}</color>在仓库中捐献了<color@2>{2}</color>阶<color@2>{3}</color>星神装<a@goods3@{4}@{5}@{6}></a>！【<color@1><a@guilddepot>前往兑换</a></color>】"/utf8>>};

get(401,2) ->
	#language{module_id = 401,id = 2,type = 2,subtype = 4,tip = 0,content = <<"<color@3>{1}</color>在仓库中兑换了<color@2>{2}</color>阶<color@2>{3}</color>星神装<a@goods3@{4}@{5}@{6}></a>！【<color@1><a@guilddepot>我也去看看</a></color>】"/utf8>>};

get(402,1) ->
	#language{module_id = 402,id = 1,type = 2,subtype = 4,tip = 1,content = <<"<color@2>{1}</color>学识渊博，回答正确，为结社赢得<color@1>{2}</color>点积分，目前共获得<color@1>{3}</color>分"/utf8>>};

get(402,2) ->
	#language{module_id = 402,id = 2,type = 2,subtype = 4,tip = 1,content = <<"本次结社答题已结束，恭喜以下才华横溢的结社勇夺前三名！第一名：<color@2>{1}</color>，第二名：<color@2>{2}</color>,第三名：<color@2>{3}</color>"/utf8>>};

get(402,3) ->
	#language{module_id = 402,id = 3,type = 2,subtype = 10,tip = 1,content = <<"恭喜<color@2>{1}</color>在结社答题中夺取第<color@1>{2}</color>名，获得<color@1>{3}</color>绑玉红包奖励"/utf8>>};

get(402,4) ->
	#language{module_id = 402,id = 4,type = 2,subtype = 4,tip = 1,content = <<"<color@1>八岐大蛇</color>已经苏醒，大家赶紧前往结社篝火进行击杀!"/utf8>>};

get(402,5) ->
	#language{module_id = 402,id = 5,type = 2,subtype = 4,tip = 1,content = <<"{1}将在<color@1>{2}</color>秒后开启，请前往宴会场景！"/utf8>>};

get(402,9) ->
	#language{module_id = 402,id = 9,type = 2,subtype = 4,tip = 1,content = <<"最强结社第<color@0>{1}</color>战已经打响，赶快进入战场，为结社荣耀而战！"/utf8>>};

get(402,10) ->
	#language{module_id = 402,id = 10,type = 2,subtype = 4,tip = 1,content = <<"最强结社第<color@0>{1}</color>战已全部落下帷幕，<color@0>{2}</color>分钟后将开启第<color@0>{3}</color>场战斗，请阴阳师们做好准备！"/utf8>>};

get(402,11) ->
	#language{module_id = 402,id = 11,type = 2,subtype = 10,tip = 1,content = <<"<color@0>最强结社</color>即将开启，加入结社为荣誉而战吧！并可赢取海量<color@4>经验</color>和<color@4>结社贡献</color>！"/utf8>>};

get(402,12) ->
	#language{module_id = 402,id = 12,type = 1,subtype = 10,tip = 1,content = <<"恭喜结社<color@2>{1}</color>夺得本次最强结社冠军，获得了神殿的主宰权！"/utf8>>};

get(402,13) ->
	#language{module_id = 402,id = 13,type = 6,subtype = 10,tip = 1,content = <<"<color@2>{1}</color>已连续击败10名对手，大杀四方，无人能敌！"/utf8>>};

get(402,14) ->
	#language{module_id = 402,id = 14,type = 6,subtype = 10,tip = 1,content = <<"<color@2>{1}</color>已连续击败20名对手，犹如战神降临，逆天弑神！"/utf8>>};

get(402,15) ->
	#language{module_id = 402,id = 15,type = 6,subtype = 10,tip = 1,content = <<"<color@2>{1}</color>超神手速，一举拿下<color@1>{2}</color>！"/utf8>>};

get(402,16) ->
	#language{module_id = 402,id = 16,type = 6,subtype = 10,tip = 1,content = <<"<color@1>{1}</color>正在被敌方攻击，速速前去援救！"/utf8>>};

get(402,17) ->
	#language{module_id = 402,id = 17,type = 6,subtype = 10,tip = 1,content = <<"<color@1>{1}</color>结社累计资源已超过2500，正向胜利迈进！"/utf8>>};

get(402,18) ->
	#language{module_id = 402,id = 18,type = 1,subtype = 10,tip = 1,content = <<"本次最强结社赛事全部落下帷幕，请持续关注下次赛事开启！"/utf8>>};

get(402,20) ->
	#language{module_id = 402,id = 20,type = 2,subtype = 16,tip = 0,content = <<"正确答案为：<color@3>{1}</color>，很遗憾，没有人答对。"/utf8>>};

get(402,21) ->
	#language{module_id = 402,id = 21,type = 2,subtype = 16,tip = 0,content = <<"正确答案为：<color@3>{1}</color>，<color@2>{2}</color>聪明绝顶，第一个回答正确！"/utf8>>};

get(402,22) ->
	#language{module_id = 402,id = 22,type = 2,subtype = 16,tip = 0,content = <<"恭喜您回答正确，积分<color@2>+{1}</color>!"/utf8>>};

get(402,23) ->
	#language{module_id = 402,id = 23,type = 2,subtype = 16,tip = 0,content = <<"很遗憾，您回答错误，请再接再厉。"/utf8>>};

get(402,24) ->
	#language{module_id = 402,id = 24,type = 1,subtype = 10,tip = 0,content = <<"<color@2>守卫结社</color>已经开启!参与防守即可获得海量经验! <color@2><a@guildguard>立即前往</a></color>"/utf8>>};

get(402,25) ->
	#language{module_id = 402,id = 25,type = 2,subtype = 4,tip = 1,content = <<"即将到可召唤<color@1>八岐大蛇</color>的时间，大家快前往结社篝火准备接受挑战！"/utf8>>};

get(402,26) ->
	#language{module_id = 402,id = 26,type = 2,subtype = 16,tip = 0,content = <<"恭喜<color@1>{1}</color>第一个回答正确，为结社带来<color@1>{2}</color>积分，马上开始下一题"/utf8>>};

get(402,27) ->
	#language{module_id = 402,id = 27,type = 2,subtype = 16,tip = 0,content = <<"本题正确答案为<color@5>{1}</color>，很遗憾没有玩家回答正确，现在开始下一题"/utf8>>};

get(402,28) ->
	#language{module_id = 402,id = 28,type = 2,subtype = 4,tip = 0,content = <<"本结社在此次答题中获得了<color@1>第{1}名</color>的好成绩，奖励已发送至成员背包或者邮箱，望再接再厉~"/utf8>>};

get(402,29) ->
	#language{module_id = 402,id = 29,type = 2,subtype = 4,tip = 0,content = <<"很遗憾，结社本次答题成绩不够理想，望下次加油"/utf8>>};

get(402,30) ->
	#language{module_id = 402,id = 30,type = 1,subtype = 4,tip = 0,content = <<"{1}购买了<color@1>普通菜肴</color>，为大家带来了经验加成。"/utf8>>};

get(402,31) ->
	#language{module_id = 402,id = 31,type = 1,subtype = 4,tip = 0,content = <<"{1}购买了<color@2>优质菜肴</color>，为大家带来了经验加成。"/utf8>>};

get(402,32) ->
	#language{module_id = 402,id = 32,type = 4,subtype = 4,tip = 0,content = <<"{1}花费{2}勾玉购买了<color@5>极品菜肴</color>，为大家带来了<color@1>大量经验加成</color>，大佬大气~"/utf8>>};

get(402,33) ->
	#language{module_id = 402,id = 33,type = 2,subtype = 4,tip = 0,content = <<"{1}<color@2><a@guildquiz>前往答题</a></color>"/utf8>>};

get(402,34) ->
	#language{module_id = 402,id = 34,type = 2,subtype = 16,tip = 0,content = <<"恭喜你答对了，你是第{1}个答对的玩家，将获得{2}分"/utf8>>};

get(402,35) ->
	#language{module_id = 402,id = 35,type = 2,subtype = 16,tip = 0,content = <<"本题正确答案是{1}，{2}第一个答对"/utf8>>};

get(402,36) ->
	#language{module_id = 402,id = 36,type = 2,subtype = 16,tip = 0,content = <<"正确答案为：<color@3>{1}</color>，<color@2>S{2}.{3}</color>聪明绝顶，第一个回答正确！"/utf8>>};

get(402,37) ->
	#language{module_id = 402,id = 37,type = 2,subtype = 16,tip = 0,content = <<"本题正确答案为{1}，很遗憾没有玩家回答正确，本次答题即将结束"/utf8>>};

get(404,1) ->
	#language{module_id = 404,id = 1,type = 2,subtype = 4,tip = 0,content = <<"<color@1>{1}</color>义薄云天,成功协助<color@2>{2}</color>击杀<color@3>{3}</color>."/utf8>>};

get(404,2) ->
	#language{module_id = 404,id = 2,type = 2,subtype = 4,tip = 0,content = <<"<color@1>{1}</color>义薄云天,成功协助<color@2>{2}</color>通关<color@3>{3}</color>."/utf8>>};

get(404,3) ->
	#language{module_id = 404,id = 3,type = 2,subtype = 4,tip = 0,content = <<"<color@1>{1}</color>义薄云天,大胜S{2}.<color@1>{3}</color>替<color@2>{4}</color>夺回了全部巡航奖励."/utf8>>};

get(404,4) ->
	#language{module_id = 404,id = 4,type = 1,subtype = 4,tip = 0,content = <<"<color@1>{1}</color>义薄云天,惜败于S{2}.<color@1>{3}</color>替<color@2>{4}</color>夺回了部分巡航奖励."/utf8>>};

get(404,5) ->
	#language{module_id = 404,id = 5,type = 2,subtype = 4,tip = 0,content = <<"<color@1>{1}</color>斩妖卡{2}关了，来个大佬帮帮我吧。 <color@1><a@guildassist>前往协助</a></color>"/utf8>>};

get(404,6) ->
	#language{module_id = 404,id = 6,type = 2,subtype = 4,tip = 0,content = <<"<color@1>{1}</color>别慌，我来助你斩妖"/utf8>>};

get(405,1) ->
	#language{module_id = 405,id = 1,type = 1,subtype = 10,tip = 0,content = <<"<color@2>{1}</color>成功激活<color@{2}>{3}</color>,可进行武魂觉醒和铭文装配,超神指日可待!<color@1><a@open_fun@181>我也想要</a></color>"/utf8>>};

get(405,2) ->
	#language{module_id = 405,id = 2,type = 1,subtype = 10,tip = 0,content = <<"<color@2>{1}</color>成功将<color@{2}>{3}</color>提升至<color@{4}>{5}</color>,百分比属性大幅提升!<color@1><a@open_fun@181>我也想要</a></color>"/utf8>>};

get(405,3) ->
	#language{module_id = 405,id = 3,type = 1,subtype = 10,tip = 0,content = <<"<color@2>{1}</color>成功将<color@{2}>{3}</color>提升至觉醒<color@1>{4}</color>级,战力暴涨!<color@1><a@open_fun@181>我也想要</a></color>"/utf8>>};

get(405,4) ->
	#language{module_id = 405,id = 4,type = 1,subtype = 10,tip = 0,content = <<"<color@2>{1}</color>将<color@{2}>{3}铭文</color>全部升至<color@1>{4}级</color>,铭文组合属性获百分比增幅!<color@1><a@open_fun@181>我也想要</a></color>"/utf8>>};

get(405,5) ->
	#language{module_id = 405,id = 5,type = 1,subtype = 10,tip = 0,content = <<"<color@2>{1}</color>激活了<color@{2}>{3}</color>的<color@4>{4}</color>,神光附体<color@1><a@open_fun@181>我也想要</a></color>"/utf8>>};

get(416,1) ->
	#language{module_id = 416,id = 1,type = 1,subtype = 10,tip = 1,content = <<"<color@2>{1}</color>人品爆发在<color@3>{2}</color>中获得<color@{3}>{4}</color>"/utf8>>};

get(416,2) ->
	#language{module_id = 416,id = 2,type = 1,subtype = 10,tip = 1,content = <<"<color@2>{1}</color>人品爆发在<color@4>{2}</color>中获得<color@{3}>{4}</color>"/utf8>>};

get(416,3) ->
	#language{module_id = 416,id = 3,type = 1,subtype = 10,tip = 1,content = <<"<color@2>{1}</color>人品爆发在<color@5>{2}</color>中获得<color@{3}>{4}</color>"/utf8>>};

get(416,4) ->
	#language{module_id = 416,id = 4,type = 1,subtype = 10,tip = 1,content = <<"<color@2>{1}</color>人品爆发在<color@5>{2}</color>中获得<color@{3}>{4}</color>"/utf8>>};

get(416,5) ->
	#language{module_id = 416,id = 5,type = 4,subtype = 10,tip = 0,content = <<"<color@2>{1}</color>在<color@3>{2}</color>中人品爆发，获得稀有道具<color@{3}>{4}</color>，幸运值稍后重置，阴阳师们抓紧时间夺宝！"/utf8>>};

get(416,6) ->
	#language{module_id = 416,id = 6,type = 4,subtype = 10,tip = 0,content = <<"<color@2>{1}</color>在<color@3>{2}</color>中人品爆发，获得稀有道具<color@{3}>{4}</color>，阴阳师们抓紧时间夺宝！"/utf8>>};

get(416,7) ->
	#language{module_id = 416,id = 7,type = 4,subtype = 10,tip = 0,content = <<"S{1}.<color@2>{2}</color>在<color@3>{3}</color>中人品爆发，获得稀有道具<color@{4}>{5}</color>，幸运值稍后重置，阴阳师们抓紧时间夺宝！"/utf8>>};

get(416,8) ->
	#language{module_id = 416,id = 8,type = 4,subtype = 10,tip = 0,content = <<"<color@2>{1}</color>在<color@3>{2}</color>中人品爆发，获得稀有道具<color@{3}>{4}</color> ！"/utf8>>};

get(416,9) ->
	#language{module_id = 416,id = 9,type = 4,subtype = 10,tip = 0,content = <<"<color@2>{1}</color>人品爆发在<color@5>{2}</color>中获得极品SP御魂<color@7>{4}</color>"/utf8>>};

get(420,1) ->
	#language{module_id = 420,id = 1,type = 1,subtype = 10,tip = 0,content = <<"<color@2><a@player@{1}@{2}></a></color>花费{3}勾玉成功参与<color@3>等级投资</color>，<color@0>高倍</color>回报无风险，10倍返利乐翻天！<color@1><a@open_fun@62>我要参与</a></color>"/utf8>>};

get(420,2) ->
	#language{module_id = 420,id = 2,type = 1,subtype = 10,tip = 0,content = <<"<color@2><a@player@{1}@{2}></a></color>花了一笔小钱成功参与了<color@3>月卡投资</color>，<color@0>高倍</color>回报无风险，每日绑玉不用愁！<color@1><a@open_fun@61>我要投资</a></color>"/utf8>>};

get(420,3) ->
	#language{module_id = 420,id = 3,type = 1,subtype = 10,tip = 0,content = <<"<color@2><a@player@{1}@{2}></a></color>花了一笔小钱成功参与了<color@3>vip投资</color>，<color@0>十倍</color>回报无风险，升级之路不用愁！<color@1><a@open_fun@63>我要投资</a></color>"/utf8>>};

get(420,4) ->
	#language{module_id = 420,id = 4,type = 1,subtype = 10,tip = 0,content = <<"<color@2><a@player@{1}@{2}></a></color>花费{3}勾玉成功参与<color@3>巅峰投资</color>，<color@0>高倍</color>回报无风险，10倍返利乐翻天！<color@1><a@open_fun@115>我要参与</a></color>"/utf8>>};

get(420,6) ->
	#language{module_id = 420,id = 6,type = 1,subtype = 10,tip = 0,content = <<"<color@2><a@player@{1}@{2}></a></color>花费{3}勾玉成功参与<color@3>王者投资</color>，<color@0>高倍</color>回报无风险，10倍返利乐翻天！<color@1><a@open_fun@184>我要参与</a></color>"/utf8>>};

get(420,7) ->
	#language{module_id = 420,id = 7,type = 1,subtype = 10,tip = 0,content = <<"<color@2><a@player@{1}@{2}></a></color>花费{3}勾玉成功参与<color@3>至尊投资</color>，<color@0>高倍</color>回报无风险，10倍返利乐翻天！<color@1><a@open_fun@155>我要参与</a></color>"/utf8>>};

get(420,8) ->
	#language{module_id = 420,id = 8,type = 1,subtype = 10,tip = 0,content = <<"<color@2><a@player@{1}@{2}></a></color>花费{3}勾玉成功参与<color@3>神眷投资</color>，<color@0>高倍</color>回报无风险，10倍返利乐翻天！<color@1><a@open_fun@185>我要参与</a></color>"/utf8>>};

get(424,1) ->
	#language{module_id = 424,id = 1,type = 2,subtype = 10,tip = 0,content = <<"<color@2>{1}</color>成功激活了<color@3>狩猎契约</color>：增加人物<color@1>20%</color>打怪经验加成"/utf8>>};

get(424,2) ->
	#language{module_id = 424,id = 2,type = 2,subtype = 10,tip = 0,content = <<"<color@2>{1}</color>成功激活了<color@3>不朽契约</color>：每10秒回复<color@1>5%</color>生命值"/utf8>>};

get(424,3) ->
	#language{module_id = 424,id = 3,type = 2,subtype = 10,tip = 0,content = <<"<color@2>{1}</color>成功激活了<color@3>护佑契约</color>：生命+<color@1>10000</color>生命加成+<color@1>1%</color>"/utf8>>};

get(424,4) ->
	#language{module_id = 424,id = 4,type = 2,subtype = 10,tip = 0,content = <<"<color@2>{1}</color>成功激活了<color@3>狂暴契约</color>：暴击+<color@1>1000</color>暴击加成+<color@1>1%</color>"/utf8>>};

get(424,5) ->
	#language{module_id = 424,id = 5,type = 2,subtype = 10,tip = 0,content = <<"<color@2>{1}</color>成功激活了<color@3>坚定契约</color>：防御+<color@1>1000</color>防御加成+<color@1>2%</color>"/utf8>>};

get(424,6) ->
	#language{module_id = 424,id = 6,type = 2,subtype = 10,tip = 0,content = <<"<color@2>{1}</color>成功激活了<color@3>觉醒契约</color>：破甲+<color@1>1000</color>破甲加成+<color@1>2%</color>"/utf8>>};

get(424,7) ->
	#language{module_id = 424,id = 7,type = 2,subtype = 10,tip = 0,content = <<"<color@2>{1}</color>成功激活了<color@3>惩戒契约</color>：攻击+<color@1>1000</color>攻击加成+<color@1>1%</color>"/utf8>>};

get(440,1) ->
	#language{module_id = 440,id = 1,type = 1,subtype = 10,tip = 0,content = <<"一道光芒从天降！<color@2>{1}</color>激活了降神<color@{2}>{3}</color>，人神合一，所向披靡，问谁敢与其一战！"/utf8>>};

get(440,2) ->
	#language{module_id = 440,id = 2,type = 1,subtype = 10,tip = 0,content = <<"实力无法挡！<color@2>{1}</color>将降神<color@{2}>{3}</color>提升到了{4}星，获得了成吨的战力，小朋友们害怕了吗！"/utf8>>};

get(440,3) ->
	#language{module_id = 440,id = 3,type = 1,subtype = 10,tip = 0,content = <<"<color@2>{1}</color>将降神<color@{2}>{3}</color>提升到了{4}阶，战力得到大大提升！"/utf8>>};

get(451,1) ->
	#language{module_id = 451,id = 1,type = 1,subtype = 10,tip = 0,content = <<"<color@2><a@player@{1}@{2}></a></color>激活<color@4>体验至尊vip</color>，尊贵身份加身引得众人膜拜！<color@2><a@open_fun2@451@1>前往激活</a></color>"/utf8>>};

get(451,2) ->
	#language{module_id = 451,id = 2,type = 1,subtype = 10,tip = 0,content = <<"<color@2><a@player@{1}@{2}></a></color>升级<color@4>永久至尊vip</color>，立享永久至尊特权，更有每日好礼领取！<color@2><a@open_fun2@451@2>前往查看</a></color>"/utf8>>};

get(452,1) ->
	#language{module_id = 452,id = 1,type = 1,subtype = 10,tip = 0,content = <<"玩家<color@2><a@player@{1}@{2}></a></color>成功购买<color@3>周卡</color>，击杀boss可领取额外宝箱，<color@0>超多特权乐翻天！</color><color@1><a@open_fun@452>我要参与</a></color>"/utf8>>};

get(460,1) ->
	#language{module_id = 460,id = 1,type = 1,subtype = 10,tip = 0,content = <<"<color@2><a@player@{1}@{2}></a></color>在{3}与<color@5>{4}</color>激战999回合后成功将其击杀，获得极品<a@goods3@{5}@{6}@{7}></a>！"/utf8>>};

get(460,2) ->
	#language{module_id = 460,id = 2,type = 1,subtype = 10,tip = 0,content = <<"<color@5>{1}</color>刷新啦，赶紧前往{2}战斗吧。<a@scene3@{3}@{4}@{5}@{6}></a>"/utf8>>};

get(460,3) ->
	#language{module_id = 460,id = 3,type = 1,subtype = 10,tip = 0,content = <<"<color@2><a@player@{1}@{2}></a></color>小试牛刀，在{3}将<color@5>{4}</color>的<color@5>{5}</color><color@4><a@player@{6}@{7}></a></color>击败。"/utf8>>};

get(460,4) ->
	#language{module_id = 460,id = 4,type = 2,subtype = 4,tip = 0,content = <<"<color@2><a@player@{1}@{2}></a></color>在{3}被<color@5><a@player@{4}@{5}></a></color>击杀，小伙伴们快来帮忙呀！<a@scene3@{6}@{7}@{8}@{9}@{10}></a>"/utf8>>};

get(460,8) ->
	#language{module_id = 460,id = 8,type = 1,subtype = 10,tip = 0,content = <<"{1}<color@1>{2}</color>级<color@2>{3}</color>带着大量宝藏出现啦！击杀大妖可获得各种珍稀奖励！<color@1><a@open_fun@36>我要前往</a></color>"/utf8>>};

get(460,9) ->
	#language{module_id = 460,id = 9,type = 1,subtype = 10,tip = 0,content = <<"{1}的{2}已刷新！各位小伙伴抓紧前往采集呀！"/utf8>>};

get(460,10) ->
	#language{module_id = 460,id = 10,type = 1,subtype = 10,tip = 0,content = <<"<color@2><a@player@{1}@{2}></a></color>小宇宙爆发,从{3}<color@5>{4}</color>身上打出了<a@goods3@{5}@{6}@{7}></a>！"/utf8>>};

get(460,11) ->
	#language{module_id = 460,id = 11,type = 1,subtype = 10,tip = 0,content = <<"<color@2><a@player@{1}@{2}></a></color>将{3}<color@5>{4}</color>化成灰烬!获得令人垂涎欲滴的<a@goods3@{5}@{6}@{7}></a>!"/utf8>>};

get(460,12) ->
	#language{module_id = 460,id = 12,type = 1,subtype = 10,tip = 0,content = <<"<color@2>{1}</color>在开启秘境归属宝箱的过程中，意外获得{2}，真令人羡慕啊！"/utf8>>};

get(460,13) ->
	#language{module_id = 460,id = 13,type = 1,subtype = 10,tip = 0,content = <<"<color@2><a@player@{1}@{2}></a></color>在{3}将<color@5>{4}</color>撕成碎片!获得战利品<a@goods3@{5}@{6}@{7}></a>!"/utf8>>};

get(460,14) ->
	#language{module_id = 460,id = 14,type = 2,subtype = 4,tip = 0,content = <<"受欺负啦！我方结社成员<color@1>{1}</color>在<color@3>{2}</color>{3}层中被<color@2>{4}</color>所击杀！<color@2><a@bosshelp@{5}@{6}@{7}@{8}@{9}>前往帮忙</a></color>"/utf8>>};

get(460,15) ->
	#language{module_id = 460,id = 15,type = 2,subtype = 4,tip = 0,content = <<"受欺负啦！我方结社成员<color@1>{1}</color>在<color@3>{2}</color>中被<color@2>{3}</color>所击杀！<color@2><a@bosshelp@{4}@{5}@{6}@{7}@{8}>前往帮忙</a></color>"/utf8>>};

get(460,16) ->
	#language{module_id = 460,id = 16,type = 2,subtype = 4,tip = 0,content = <<"我方结社成员<color@1>{1}</color>在<color@3>{2}</color>中击杀了<color@2>{3}</color>,壕无人性异常凶猛..."/utf8>>};

get(460,17) ->
	#language{module_id = 460,id = 17,type = 2,subtype = 10,tip = 0,content = <<"<color@2>{1}</color>在怪物攻城中，从宝箱中获得了<a@goods3@{2}@{3}@{4}></a>，真令人羡慕啊！"/utf8>>};

get(460,18) ->
	#language{module_id = 460,id = 18,type = 1,subtype = 10,tip = 0,content = <<"<color@5>{1}</color>愤怒地出现在{2},击杀有更高概率掉落降神装备<color@2><a@mystery@{3}>[立即前往]</a></color>"/utf8>>};

get(460,19) ->
	#language{module_id = 460,id = 19,type = 1,subtype = 10,tip = 0,content = <<"<color@2><a@player@{1}@{2}></a></color>在{3}与{4}级<color@5>{5}</color>激战1000回合，意外斩获极品<a@goods3@{6}@{7}@{8}></a>，这谁顶得住呀！"/utf8>>};

get(460,20) ->
	#language{module_id = 460,id = 20,type = 1,subtype = 10,tip = 0,content = <<"<color@2><a@player@{1}@{2}></a></color>在{3}启封了{4}，在莹莹的光中搜出了<a@goods3@{5}@{6}@{7}></a>！"/utf8>>};

get(460,21) ->
	#language{module_id = 460,id = 21,type = 2,subtype = 4,tip = 0,content = <<"受欺负啦！我方结社成员<color@1>{1}</color>在<color@3>{2}</color>共享层中被<color@2>{3}</color>所击杀！<color@2><a@bosshelp@{4}@{5}@{6}@{7}@{8}>前往帮忙</a></color>"/utf8>>};

get(460,22) ->
	#language{module_id = 460,id = 22,type = 5,subtype = 10,tip = 0,content = <<"<color@2><a@player@{1}@{2}></a></color>在{3}将<color@5>{4}</color>击败，获得极品<a@goods3@{5}@{6}@{7}></a>,幸运无限！"/utf8>>};

get(470,1) ->
	#language{module_id = 470,id = 1,type = 1,subtype = 10,tip = 0,content = <<"<color@1><a@player2@{1}@{2}@{3}></a></color>在{4}与<color@4>{5}</color>激战三百回合后成功将其击杀，获得极品<a@goods3@{6}@{7}@{8}></a>！"/utf8>>};

get(470,2) ->
	#language{module_id = 470,id = 2,type = 1,subtype = 10,tip = 0,content = <<"<color@4>{1}</color>刷新啦，赶紧前往<color@1>{2}</color>争夺吧。<a@scene3@{3}@{4}@{5}@{6}></a>"/utf8>>};

get(470,3) ->
	#language{module_id = 470,id = 3,type = 1,subtype = 10,tip = 0,content = <<"<color@2><a@player2@{1}@{2}@{3}></a></color>小试牛刀，在{4}将<color@4>{5}</color>的<color@4>{6}</color><color@3><a@player2@{7}@{8}@{9}></a></color>击败。"/utf8>>};

get(470,4) ->
	#language{module_id = 470,id = 4,type = 2,subtype = 4,tip = 0,content = <<"<color@2><a@player2@{1}@{2}@{3}></a></color>在{4}被<color@4><a@player2@{5}@{6}@{7}></a></color>击杀，小伙伴们快来帮忙呀！<a@scene3@{8}@{9}@{10}@{11}@{12}></a>"/utf8>>};

get(470,5) ->
	#language{module_id = 470,id = 5,type = 6,subtype = 10,tip = 1,content = <<"<color@2>{1}</color>中的<color@5>{2}</color>已被抢夺一空，没有抢够的小伙伴请耐心等待下一波刷新"/utf8>>};

get(470,6) ->
	#language{module_id = 470,id = 6,type = 3,subtype = 0,tip = 0,content = <<"采集成功，今日还可采集{1}次"/utf8>>};

get(470,7) ->
	#language{module_id = 470,id = 7,type = 3,subtype = 0,tip = 0,content = <<"成功击杀大妖，疲劳加{1}"/utf8>>};

get(470,8) ->
	#language{module_id = 470,id = 8,type = 1,subtype = 10,tip = 0,content = <<"锦鲤福运！恭喜<color@2>{1}</color>在蜃气楼{2}层开启<a@goods@{3}></a>时获得<a@goods@{4}></a>，真令人羡慕！"/utf8>>};

get(471,1) ->
	#language{module_id = 471,id = 1,type = 2,subtype = 4,tip = 0,content = <<"我正在挑战怨灵封印大妖-{1}，急需强力大佬助我一臂之力。<color@2><a@open_fun3@471@1@{2}>立即前往协助</a></color>"/utf8>>};

get(471,2) ->
	#language{module_id = 471,id = 2,type = 1,subtype = 10,tip = 0,content = <<"怨灵封印之中传来异响，异兽之王带着愤怒之火降临在怨灵封印之中，急需征募大量阴阳师前往阻止异兽之王的来袭。<color@2><a@open_fun2@471@1>立即前往挑战</a></color>"/utf8>>};

get(471,3) ->
	#language{module_id = 471,id = 3,type = 1,subtype = 10,tip = 0,content = <<"怨灵封印大妖<color@1>【{1}级】{2}</color>携带大量珍宝出现了，击杀大妖可获得各种珍稀奖励！<color@2><a@open_fun3@471@2@{3}>前往击杀</a></color>"/utf8>>};

get(490,1) ->
	#language{module_id = 490,id = 1,type = 1,subtype = 10,tip = 0,content = <<"<color@2><a@player@{1}@{2}></a></color>玩家购买了<color@4>特权礼包—{3}</color>，战力提升，还能享受每天<color@2>勾玉返还</color>。<color@1><a@open_fun@134>我也要买</a></color>"/utf8>>};

get(505,1) ->
	#language{module_id = 505,id = 1,type = 1,subtype = 10,tip = 0,content = <<"最强结社战即将开启，热血战斗，称王称霸，等你来战！"/utf8>>};

get(505,2) ->
	#language{module_id = 505,id = 2,type = 1,subtype = 10,tip = 0,content = <<"<color@1>{1}</color>结社势如破竹，占领了<color@1>{2}</color>，谁敢争锋？"/utf8>>};

get(505,3) ->
	#language{module_id = 505,id = 3,type = 6,subtype = 10,tip = 0,content = <<"玩家<color@2>{1}</color>在最强结社战场上所向披靡，已经达到<color@1>{2}</color>人斩！"/utf8>>};

get(505,4) ->
	#language{module_id = 505,id = 4,type = 6,subtype = 10,tip = 0,content = <<"玩家<color@2>{1}</color>在最强结社战场上所向披靡，已经无人能挡了！"/utf8>>};

get(505,5) ->
	#language{module_id = 505,id = 5,type = 6,subtype = 10,tip = 0,content = <<"砍据点雕像，可以获得高额资源点"/utf8>>};

get(505,6) ->
	#language{module_id = 505,id = 6,type = 6,subtype = 10,tip = 0,content = <<"据点的首个占领结社，可获得大量资源点"/utf8>>};

get(505,7) ->
	#language{module_id = 505,id = 7,type = 6,subtype = 10,tip = 0,content = <<"占领中央王者据点的结社，将获得争霸战的胜利！"/utf8>>};

get(505,8) ->
	#language{module_id = 505,id = 8,type = 6,subtype = 10,tip = 0,content = <<"在刷怪点殴打小怪，有积分和资源点哦！"/utf8>>};

get(505,9) ->
	#language{module_id = 505,id = 9,type = 1,subtype = 0,tip = 0,content = <<"<color@1>{1}</color>结社势不可挡，所向披靡。最终成为最强结社战的霸主，真是令人畏惧！"/utf8>>};

get(505,10) ->
	#language{module_id = 505,id = 10,type = 6,subtype = 10,tip = 0,content = <<"<color@1>{1}</color>在争霸战中击杀了<color@1>{2}</color>，拿下了第一滴血"/utf8>>};

get(505,11) ->
	#language{module_id = 505,id = 11,type = 6,subtype = 10,tip = 0,content = <<"<color@1>{1}</color>结社第一个占领了<color@1>{2}</color>，成员获得了额外的资源点"/utf8>>};

get(506,1) ->
	#language{module_id = 506,id = 1,type = 1,subtype = 10,tip = 0,content = <<"结社领地战即将开启，热血战斗，称王称霸，等你来战！"/utf8>>};

get(506,2) ->
	#language{module_id = 506,id = 2,type = 1,subtype = 10,tip = 0,content = <<"<color@1>{1}</color>结社势如破竹，占领了<color@1>{2}</color>，谁敢争锋？"/utf8>>};

get(506,3) ->
	#language{module_id = 506,id = 3,type = 6,subtype = 10,tip = 0,content = <<"玩家<color@2>{1}</color>在结社领地战场上所向披靡，已经达到<color@1>{2}</color>人斩！"/utf8>>};

get(506,4) ->
	#language{module_id = 506,id = 4,type = 6,subtype = 10,tip = 0,content = <<"玩家<color@2>{1}</color>在结社领地战场上所向披靡，已经无人能挡了！"/utf8>>};

get(506,5) ->
	#language{module_id = 506,id = 5,type = 6,subtype = 10,tip = 0,content = <<"占领据点夺取积分，时间结束时占领王者据点的结社可以获得胜利！"/utf8>>};

get(506,6) ->
	#language{module_id = 506,id = 6,type = 6,subtype = 10,tip = 0,content = <<"据点的首个占领结社，可获得大量战场积分，积分达到上限时可提前获得胜利"/utf8>>};

get(506,7) ->
	#language{module_id = 506,id = 7,type = 6,subtype = 10,tip = 0,content = <<"占领中央王者据点的结社，将获得争霸战的胜利！"/utf8>>};

get(506,8) ->
	#language{module_id = 506,id = 8,type = 6,subtype = 10,tip = 0,content = <<"注意保护好己方据点哦，如果丢失据点后将不再会获得战场积分！"/utf8>>};

get(506,9) ->
	#language{module_id = 506,id = 9,type = 6,subtype = 10,tip = 0,content = <<"<color@1>{1}</color>结社势不可挡，所向披靡。最终成为最强结社战的霸主，真是令人畏惧！"/utf8>>};

get(506,10) ->
	#language{module_id = 506,id = 10,type = 6,subtype = 10,tip = 0,content = <<"<color@1>{1}</color>在争霸战中击杀了<color@1>{2}</color>，拿下了第一滴血"/utf8>>};

get(506,11) ->
	#language{module_id = 506,id = 11,type = 6,subtype = 10,tip = 0,content = <<"<color@1>{1}</color>结社成功占领了<color@1>{2}</color>"/utf8>>};

get(506,12) ->
	#language{module_id = 506,id = 12,type = 1,subtype = 10,tip = 0,content = <<"结社领地争夺战第{1}轮正式开启了，拥有参战资格的结社成员请尽快入场！<color@1><a@terri_war>立即入场</a></color>"/utf8>>};

get(510,1) ->
	#language{module_id = 510,id = 1,type = 1,subtype = 10,tip = 0,content = <<"喜从天降，恭喜<color@1><a@player@{1}@{2}></a></color> 成功击杀<color@1>{3}</color>.<color@1>{4}</color>，并触发了大妖转盘，获得了<a@goods@{5}></a>*{6} 。<color@1><a@open_fun@{7}>前往击杀</a></color>"/utf8>>};

get(512,1) ->
	#language{module_id = 512,id = 1,type = 1,subtype = 10,tip = 0,content = <<"玩家{1}人品逆天，在限时云购中喜中大奖<a@goods@{2}></a>*{3}真是羡煞众人！"/utf8>>};

get(606,1) ->
	#language{module_id = 606,id = 1,type = 1,subtype = 10,tip = 1,content = <<"<color@2>{1}</color>成功将“<color@2>{2}</color>”提升至<color@2>{3}</color>阶，实力大增！"/utf8>>};

get(610,1) ->
	#language{module_id = 610,id = 1,type = 1,subtype = 10,tip = 0,content = <<"<color@2><a@player@{1}@{2}></a></color>在{3}中获得极品装备<a@goods3@{4}@{5}@{6}></a>，缘分到了一切都是这么简单~"/utf8>>};

get(610,2) ->
	#language{module_id = 610,id = 2,type = 2,subtype = 4,tip = 1,content = <<"怪物突袭结社水晶,迅速前往支援!"/utf8>>};

get(610,3) ->
	#language{module_id = 610,id = 3,type = 1,subtype = 10,tip = 0,content = <<"<color@2><a@player@{1}@{2}></a></color>在{3}中获得宝物<a@goods3@{4}@{5}@{6}></a>,应有尽有~"/utf8>>};

get(610,4) ->
	#language{module_id = 610,id = 4,type = 1,subtype = 10,tip = 0,content = <<"<color@2><a@player@{1}@{2}></a></color>在{3}中获得神物<a@goods3@{4}@{5}@{6}></a>,欧气来了挡都挡不住!"/utf8>>};

get(610,5) ->
	#language{module_id = 610,id = 5,type = 4,subtype = 10,tip = 0,content = <<"<color@2>{1}</color>率先首通神巫副本精英关卡，获得唯一奖励！"/utf8>>};

get(610,6) ->
	#language{module_id = 610,id = 6,type = 5,subtype = 10,tip = 0,content = <<"<color@2><a@player@{1}@{2}></a></color>在{3}中获得极品装备<a@goods3@{4}@{5}@{6}></a>，缘分到了一切都是这么简单~"/utf8>>};

get(610,7) ->
	#language{module_id = 610,id = 7,type = 4,subtype = 10,tip = 0,content = <<"恭喜<color@2>{1}</color>成为全服第一位突破<color@5>{2}</color>的玩家。为大家赢取了丰厚的奖励，<color@1><a@open_fun@6>点击领取</a></color>"/utf8>>};

get(610,8) ->
	#language{module_id = 610,id = 8,type = 1,subtype = 10,tip = 0,content = <<"众生之门玩法已限时开启，各位阴阳师请速速前往诛灭恶鬼！<color@3><a@open_fun@236>立即前往</a></color>"/utf8>>};

get(610,9) ->
	#language{module_id = 610,id = 9,type = 1,subtype = 10,tip = 0,content = <<"众生之门中所有的传送门已被全部摧毁，感谢各位阴阳师的踊跃参与！"/utf8>>};

get(610,10) ->
	#language{module_id = 610,id = 10,type = 1,subtype = 10,tip = 0,content = <<"<color@3>{1}</color>通关<color@4>{2}</color>，掌握了神技<color@5>{3}</color>，{4}"/utf8>>};

get(610,11) ->
	#language{module_id = 610,id = 11,type = 1,subtype = 10,tip = 0,content = <<"玩家<color@2>{1}</color>成功通过<color@2>{2}</color>的所有关卡，并领取了极品稀有奖励"/utf8>>};

get(610,12) ->
	#language{module_id = 610,id = 12,type = 1,subtype = 10,tip = 0,content = <<"<color@2><a@player@{1}@{2}></a></color>挑战<color@5>{3}</color>，经过一番激烈的战斗，获得战利品<a@goods@{4}></a>*{5}！"/utf8>>};

get(612,1) ->
	#language{module_id = 612,id = 1,type = 1,subtype = 10,tip = 0,content = <<"<color@2><a@player@{1}@{2}></a></color>在<color@4>{3}</color>中一掷千金，购买了<color@4>{4}</color>，真是豪破天际！<color@1>【<a@open_fun@{5}>前往抢购</a>】</color>"/utf8>>};

get(612,2) ->
	#language{module_id = 612,id = 2,type = 1,subtype = 10,tip = 0,content = <<"<color@2><a@player@{1}@{2}></a></color>在<color@4>{3}</color>中一掷千金，购买了<color@4>{4}</color>，真是豪破天际！<color@1>【<a@open_fun@{5}>前往抢购</a>】</color>"/utf8>>};

get(612,3) ->
	#language{module_id = 612,id = 3,type = 1,subtype = 10,tip = 0,content = <<"<color@2><a@player@{1}@{2}></a></color>在<color@4>{3}</color>中一掷千金，购买了<color@4>{4}</color>，真是豪破天际！<color@1>【<a@open_fun@{5}>前往抢购</a>】</color>"/utf8>>};

get(612,4) ->
	#language{module_id = 612,id = 4,type = 1,subtype = 10,tip = 0,content = <<"<color@2><a@player@{1}@{2}></a></color>在<color@4>{3}</color>中一掷千金，购买了<color@4>{4}</color>，真是豪破天际！<color@1>【<a@open_fun@{5}>前往抢购</a>】</color>"/utf8>>};

get(612,5) ->
	#language{module_id = 612,id = 5,type = 1,subtype = 10,tip = 0,content = <<"<color@2><a@player@{1}@{2}></a></color>在<color@4>{3}</color>中一掷千金，购买了<color@4>{4}</color>，真是豪破天际！<color@1>【<a@open_fun@{5}>前往抢购</a>】</color>"/utf8>>};

get(612,6) ->
	#language{module_id = 612,id = 6,type = 1,subtype = 10,tip = 0,content = <<"<color@2><a@player@{1}@{2}></a></color>在<color@4>{3}</color>中一掷千金，购买了<color@4>{4}</color>，真是豪破天际！<color@1>【<a@open_fun@{5}>前往抢购</a>】</color>"/utf8>>};

get(612,7) ->
	#language{module_id = 612,id = 7,type = 1,subtype = 10,tip = 0,content = <<"<color@2><a@player@{1}@{2}></a></color>在<color@4>{3}</color>中一掷千金，购买了<color@4>{4}</color>，真是豪破天际！<color@1>【<a@open_fun@{5}>前往抢购</a>】</color>"/utf8>>};

get(612,8) ->
	#language{module_id = 612,id = 8,type = 1,subtype = 10,tip = 0,content = <<"<color@2><a@player@{1}@{2}></a></color>在<color@4>{3}</color>中一掷千金，购买了<color@4>{4}</color>，真是豪破天际！<color@1>【<a@open_fun@{5}>前往抢购</a>】</color>"/utf8>>};

get(612,9) ->
	#language{module_id = 612,id = 9,type = 1,subtype = 10,tip = 0,content = <<"<color@2><a@player@{1}@{2}></a></color>在<color@4>{3}</color>中一掷千金，购买了<color@4>{4}</color>，真是豪破天际！<color@1>【<a@open_fun@{5}>前往抢购</a>】</color>"/utf8>>};

get(612,10) ->
	#language{module_id = 612,id = 10,type = 1,subtype = 10,tip = 0,content = <<"<color@2><a@player@{1}@{2}></a></color>在<color@4>{3}</color>中一掷千金，购买了<color@4>{4}</color>，真是豪破天际！<color@1>【<a@open_fun@{5}>前往抢购</a>】</color>"/utf8>>};

get(612,63) ->
	#language{module_id = 612,id = 63,type = 1,subtype = 10,tip = 0,content = <<"<color@2><a@player@{1}@{2}></a></color>在<color@4>{3}</color>中一掷千金，购买了<color@4>{4}</color>，真是豪破天际！<color@1>【<a@open_fun@{5}>前往抢购</a>】</color>"/utf8>>};

get(612,75) ->
	#language{module_id = 612,id = 75,type = 1,subtype = 10,tip = 0,content = <<"<color@2><a@player@{1}@{2}></a></color>在<color@4>{3}</color>中一掷千金，购买了<color@4>{4}</color>，真是豪破天际！<color@1>【<a@open_fun@{5}>前往抢购</a>】</color>"/utf8>>};

get(621,1) ->
	#language{module_id = 621,id = 1,type = 1,subtype = 10,tip = 1,content = <<"最强王者正式开启！谁能一举问鼎王者之巅称霸跨服，让我们一起期待吧！！<color@1>【<a@open_fun@621>进入战场</a>】</color>"/utf8>>};

get(621,2) ->
	#language{module_id = 621,id = 2,type = 1,subtype = 10,tip = 1,content = <<"最强王者擂台赛已正式开启！以一敌众，战个痛快，让我们一起见证最强王者的诞生！"/utf8>>};

get(621,3) ->
	#language{module_id = 621,id = 3,type = 1,subtype = 10,tip = 1,content = <<"<color@2>{1}</color>武艺超群，大杀四方，完成了一次{2}连胜！"/utf8>>};

get(621,4) ->
	#language{module_id = 621,id = 4,type = 1,subtype = 10,tip = 1,content = <<"谁会成为最终的跨服王者呢？快为你心仪的实力派选手投票打CALL吧！<color@1><a@kf王者之巅bet>【前往竞猜】</a></color>"/utf8>>};

get(621,5) ->
	#language{module_id = 621,id = 5,type = 1,subtype = 10,tip = 1,content = <<"最强王者竞猜活动正在进行，参与竞猜赢大奖，你也能成为战场外的竞猜王者！"/utf8>>};

get(621,6) ->
	#language{module_id = 621,id = 6,type = 1,subtype = 10,tip = 1,content = <<"最强王者报名火热进行中！王者之巅，谁与争锋！参与报名证明你自己！<color@1>【<a@open_fun@621>立即报名</a>】</color>"/utf8>>};

get(621,7) ->
	#language{module_id = 621,id = 7,type = 1,subtype = 10,tip = 1,content = <<"<color@2>{1}</color>势不可挡，在资格赛中轻松拿下{2}连胜！"/utf8>>};

get(621,8) ->
	#language{module_id = 621,id = 8,type = 1,subtype = 10,tip = 1,content = <<"<color@2>{1}</color>究极无敌牛逼，成功通过1V{2}环节"/utf8>>};

get(621,9) ->
	#language{module_id = 621,id = 9,type = 1,subtype = 10,tip = 1,content = <<"<color@2>{1}</color>惊为天人，一举获得本次最强王者的第{2}名，让我们膜拜他吧！"/utf8>>};

get(621,10) ->
	#language{module_id = 621,id = 10,type = 1,subtype = 10,tip = 1,content = <<"最强王者擂台赛一触即发，请各位擂主和挑战者们做好准备，准时参加！"/utf8>>};

get(650,1) ->
	#language{module_id = 650,id = 1,type = 1,subtype = 10,tip = 0,content = <<"欢迎进入3v3战场，占领据点争夺积分，占塔多的一方或积分达到2000分即可获得胜利！"/utf8>>};

get(650,2) ->
	#language{module_id = 650,id = 2,type = 1,subtype = 10,tip = 0,content = <<"跨服3v3玩法已限时开启,决战王者巅峰，展示真正实力的时刻到了！<color@3><a@open_fun@112>立即前往</a></color>"/utf8>>};

get(650,3) ->
	#language{module_id = 650,id = 3,type = 2,subtype = 1,tip = 0,content = <<"<color@2>{1}</color>正在为<color@2>{2}</color>招募强力队友一起决战王者之巅！<color@3><a@3v3team@{3}>立即申请</a></color>"/utf8>>};

get(650,4) ->
	#language{module_id = 650,id = 4,type = 3,subtype = 0,tip = 0,content = <<"{1}加入了战队"/utf8>>};

get(650,5) ->
	#language{module_id = 650,id = 5,type = 1,subtype = 0,tip = 0,content = <<"{1}拒绝了您的入队申请"/utf8>>};

get(650,6) ->
	#language{module_id = 650,id = 6,type = 1,subtype = 0,tip = 0,content = <<"玩家{1}离开了战队"/utf8>>};

get(650,7) ->
	#language{module_id = 650,id = 7,type = 1,subtype = 10,tip = 0,content = <<"万众瞩目的3v3冠军赛争夺战正式开启了，入围的战队请尽快入场，让我们一起见证王者的降临！<color@3><a@open_fun@112>立即前往</a></color>"/utf8>>};

get(650,8) ->
	#language{module_id = 650,id = 8,type = 4,subtype = 10,tip = 0,content = <<"恭贺<color@2>s{1}.{2}</color>战队成功夺得本次3v3冠军，祝贺他们！敬请期待下次活动！"/utf8>>};

get(651,1) ->
	#language{module_id = 651,id = 1,type = 4,subtype = 10,tip = 0,content = <<"S{1}.<color@2>{2}</color>在<color@3>{3}</color>中人品爆发，获得稀有道具<a@goods@{4}></a>"/utf8>>};

get(652,1) ->
	#language{module_id = 652,id = 1,type = 1,subtype = 10,tip = 0,content = <<"恭喜<color@2><a@player@{1}@{2}></a></color>玩家在异域夺宝活动中获得<a@goods3@{3}@{4}@{5}></a>，真让人羡慕妒忌！"/utf8>>};

get(_Moduleid,_Id) ->
	[].

