%% ---------------------------------------------------------------------------
%% @doc dummy.hrl

%% @author zzm
%% @since  2015-04-21
%% @deprecated  假人模块记录
%% ---------------------------------------------------------------------------.

-record(dummy, {
        id=0,               %% 角色id
        name="",            %% 角色名字
        lv=0,               %% 角色等级
        career=0,           %% 角色职业
        speed=0,            %% 角色走路速度
        vip=0,              %% 角色vip等级
        figure_id=0,        %% 角色形象id
        skill_list=[]       %% 角色技能列表
    }).
