%%-----------------------------------------------------------------------------
%% @Module  :       extra
%% @Author  :       Czc
%% @Email   :       389853407@qq.com
%% @Created :       2018-06-06
%% @Description:    额外配置
%%-----------------------------------------------------------------------------

%% 额外配置类型
-define(EXTRA_CFG_CUSTOM_ACT,                   1).         %% 额外定制活动
-define(EXTRA_CFG_GUESS,                        2).         %% 竞猜活动

%% 到处的函数接口类型
%% 类型1
%% 函数名(参数1, 参数2...) -> #record{}.
%% 函数名(参数1, 参数2...) -> [].
%% 类型2
%% 函数名() -> [返回的字段] | [{返回的字段, 返回的字段}].
%% 类型3
%% 函数名(参数1, 参数2...) -> [返回的字段] | [{返回的字段, 返回的字段}].
-define(EXTRA_CFG_FUNC_TYPE_1,                  1).
-define(EXTRA_CFG_FUNC_TYPE_2,                  2).
-define(EXTRA_CFG_FUNC_TYPE_3,                  3).