%%----------------------------------------------------
%% @Describe    版本更新信息
%% @Creator     yxf
%% @Date        20171121
%%----------------------------------------------------
-define(VERSION_USING, 1).                  %% 版本启用
-define(VERSION_NOT_USING, 0).              %% 版本未启用

-define(VersionUpgradeBagOpenLv, 30).
%%----------------------------------------------------
%% 功能表
%%---------------------------------------------------
-record(version_upgradebag,{
        state = 0,                          %% 领取状态
        rewards = []                        %% 奖励
    }).

%%----------------------------------------------------
%% 更新配置信息
%%----------------------------------------------------
-record(base_version_upgradebag_reward,{
        version_code = 0,                       %% 编号
        color = 0,                              %% 公告颜色
        content = "",                           %% 公告内容
        name = "",                              %% 礼包名称
        rewards = [],                           %% 奖励
        starttime = 0,                          %% 开始时间
        endtime = 0,                            %% 结束时间
        state = 0                               %% 状态
        , is_login_tip = 0                      %% 是否登录提示##1.非更新弹出;2.更新弹出
        , source_list = []                      %% 渠道来源##[]:不限制
    }).