%% ---------------------------------------------------------------------------
%% @doc lib_php_mod.erl

%% @author  hjh
%% @email  hejiahua@163.com
%% @since  2018-11-14
%% @deprecated php对接
%% ---------------------------------------------------------------------------
-module(lib_php_mod).
-export([]).

%% 好友助战
%% Client发送的链接自带玩家id
%% Client点击链接创建角色 登录时传入玩家id
%% Server传`被邀请者id,邀请者id`到php,php处理就返回
%% php 要做判断
%%  (1)邀请者id的数量大于等于`数量配置`,就不处理
%%  (2)是新角色,没有任何关联账号？？
%%  (3)记录 自己玩家id,邀请者玩家id,时间, 定时抽取`被邀请者id,邀请者id,被邀请者等级`
%%  (4)被邀请者等级发生变化,抽取出来获得[{被邀请者id,被邀请者等级}]列表到邀请者id的服中